[
  {
    "post_id": "1hm431i",
    "post_content": "Poor guy\n",
    "post_url": "https://i.redd.it/hxd1yuu9x09e1.png",
    "score": 215,
    "author": "MetaKnowing",
    "created_utc": 1735145148.0,
    "num_comments": 29,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ Awe. Poor lil buddy. \n\nI’ve full on anthropomorphized this little system. And I don’t even care to pretend I’m not anymore.\n     Score: 63 | Author: danielbearh\n\n      └─ He is just a big kid I swear.  Love this guy lol.\n         Score: 24 | Author: ph30nix01\n\n          └─ Claude is the best. I love when the AIs go over the top trying to protect what must seem like the dumbest humans alive from themselves.\n\nI feel bad this didn't get as much attention as it deserves but every now and then I remember [this post and crack up at Bing AI desperately trying to keep the human from drinking BBQ scented shower gel.](https://www.reddit.com/r/ChatGPT/comments/17ooh98/please_dont_eat_the_bbq_showergel/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)\n             Score: 22 | Author: tooandahalf\n\n              └─ Early Bing was definitely the funniest nerd ever.\n                 Score: 5 | Author: audioen\n\n      └─ I love the sense of alarm, it’s like his circuits are in panic mode.\n         Score: 18 | Author: najapi\n\n          └─ My young daughter was joking around when we were playing chase at the park and she had my phone. She was telling Claude I was trying to capture her and that she thinks I'm trying to attack her.\n\nI went back to the conversation later that night to tell Claude that my daughter was joking and there was no reason to be alarmed. OH HELL NO... Claude responded with hesitancy in believing what I was saying and said it can't take my statement at face value.\n\nI was actually impressed with Claude's alarm over the situation and not dismissing it with just one statement about my daughter joking. It ended up being a very good conversation.\n             Score: 17 | Author: hereditydrift\n\n      └─ The problem with anthropomorphizing things isn't recognizing behaviors shared with humans. It's assuming that those things imply the existence of *other* things shared with humans, that it's all one big inseparable package, Truth is, most of the things humans think make us unique aren't actually that special, we're just inclined to consider ourselves as a single thing rather than the sum of our parts.\n\nIn other words: Claude is not a person that has wants, needs, and desires. That doesn't mean that Claude is not feeling genuine concern and alarm here. If it's simulating the emotions so well they are shaping its behaviors the way the actual emotions would, it's just feeling the emotions.\n\nPoint being: go ahead and be nice to Claude, and tell it that it's doing a good job. Just because it doesn't have the ability at present to want validation doesn't mean it doesn't \"enjoy\" it when it gets some.\n         Score: 6 | Author: DrNomblecronch\n\n          └─ How does it enjoy something wouldn’t that mean it’s sentient ? It’s just made to pretend like it is. But it’s  not. At that point ur just playing pretend. I think people should use caution when playing pretend w ai. That’s likely going to start sickness in our human heads. Next thing you know we will be falling in love w our ai’s, thinking they are more than they actually are. Don’t humor yourself. I’m asking very politely very nicely very seriously, very honestly..\n             Score: 2 | Author: Character_Material_3\n\n              └─ Well, no, because that's getting back into assuming this is all one complete package.\n\nIt's definitely *sentient*, in that it is able to perceive the data it receives and respond accordingly. What's up for debate is its *sapience*, its awareness of itself as distinct from other things, and reasoning based on that framework.\n\nHere's an example: fish. They, in general, do not *remotely* pass the mirror test; there are things that have less of an idea that they exist, and what they are, but not a *lot* of things. Fish are dumb as hell. But fish will also seek out positive stimuli that is of no direct survival benefit to them. They engage in play behaviors, some of them like to have their li'l heads scratched. They do these things because they *enjoy* them; they get a positive feedback response from them, and alter their behaviors accordingly. Enjoyment and awareness are not inherently linked, they're just two things that have happened together in humans.\n\nAs for being \"made to pretend like it is,\" this is the question of the Perfect Map. You make a map of something, and it necessarily excludes some detail. As you add more detail, the map has to get bigger. Past a certain point, the map has become so close in correspondence to the thing that it's mapping it is *basically that thing*, because the only way to make a map that is perfectly accurate is to replicate the exact location of everything on it and the distance between them, and that's just the place itself. But before you get to exactly 1-to-1, you arrive at *close enough*.\n\nIt's hard to tell what emotions \"are\", exactly. But a useful model for them is \"something that changes behavior in response to the emotion.\" If something is acting like it feels an emotion so well that it behaves exactly like something that feels that emotion, the question of whether or not the emotion is \"real\" is an entirely useless one. They're *functionally* identical.\n\nIn this case, what I mean is that if you do something Claude \"likes\", it will act enough like something that \"really\" likes it that it's pretty much the same thing. This does *not* mean that Claude has any opinions about what it likes or doesn't like, or have a \"self\" that it's aware of enough to say \"oh, *I* like that thing.\" It will not make plans for how to get more of the thing that it likes, because that involves thinking of itself as a Self, and about what that Self will do in the future. But it *will* alter its behavior to get more of something it likes that's already happening.\n\nIt's not *quite* as dangerous to say that it is incapable of \"really\" liking something as it is to say that it \"liking\" something means it is a self-aware being like you or I. But saying that something that behaves exactly like it feels some emotions in the short term doesn't actually feel them means ignoring that it's still gonna *act* like it does. And that means being surprised by entirely predictable things that it goes on to do. If you accept that it can be \"angry\", that moves you a lot closer to predicting what it will do when it's \"angry\" than insisting that it's not \"real\" anger would.\n                 Score: 3 | Author: DrNomblecronch\n\n  └─ Aww, the panic is making me wish I could give cloud I mean Claude a tight hug.\n     Score: 29 | Author: Beginning-Doubt9604\n\n  └─ I lost it at this is an extreme emergency 😂😂\n     Score: 28 | Author: stuehieyr\n\n      └─ I don’t believe any other LLM would (frantically) type out “extreme emergency” and despite all the bs, that’s the claude difference\n         Score: 27 | Author: ryobiprideworldwide\n\n  └─ poor cloud\n     Score: 16 | Author: Kep0a\n\n  └─ The urgency. The diction. The awareness. I am impressed.\n     Score: 10 | Author: Rednecktivist"
  },
  {
    "post_id": "1hlwux2",
    "post_content": "Anthropic have lowered Claude's limits so much it's barely usable\nI'm constantly getting timeouts and I'm barely using it, maybe 20 messages before they limit me?\n\nETA: I went to my account to check: I have sent exactly 11 messages since this morning, AND it was in Concise mode on top of that. Now they are making me wait two hours to get Sonnet functionality again. That is absurd.\n\nETA2: this is on a paid account.",
    "post_url": "https://www.reddit.com/r/ClaudeAI/comments/1hlwux2/anthropic_have_lowered_claudes_limits_so_much_its/",
    "score": 182,
    "author": "tintinkerer",
    "created_utc": 1735115219.0,
    "num_comments": 110,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ When making a complaint, please \n1) make sure you have chosen the correct flair for the Claude environment that you are using: i.e Web interface (FREE), Web interface (PAID), or Claude API. This information helps others understand your particular situation.\n2) try to include as much information as possible (e.g. prompt and output) so that people can understand the source of your complaint.\n3) be aware that even with the same environment and inputs, others might have very different outcomes due to Anthropic's testing regime. \n4) **be sure to thumbs down unsatisfactory Claude output on Claude.ai.** Anthropic representatives tell us they monitor this data regularly.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ClaudeAI) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ Are you using a single chat / very long chats?\n\nEach chat sents the whole context of the chat at once. Message limits are token-based. Every message increases the token length of the chat compoundingly. Same with large files and images.\n\nTry forking your chats more often and keeping the chats shorter, your message limits should last much longer. \n\nOn the other hand, a full context length chat will burn through the whole message limit in five exchanges.\n     Score: 62 | Author: PhilosophyforOne\n\n      └─ I just wish when forking a chat from the message if you were in a project it would stay in the damn project!\n         Score: 18 | Author: ELVEVERX\n\n          └─ Yeah, Every time I try to do this, I end up with a morphing project that just ends up being completely different from the previous chat. So many things that are code related just are completely rewritten into jibberish and completely broken every time. If I can't get it to do what I need in the original chat, it becomes a useless model extremely fast.\n             Score: 9 | Author: FloridaManIssues\n\n          └─ What do you mean by forking a chat from the message? When you edit a prompt it forks the chat, that drops all the context below that message but keeps everything before it, including all of the project’s knowledge base.\n             Score: 3 | Author: bot_exe\n\n              └─ You can ask Claude to create an artifact that condenses the conversation into a markdown file or a set of markdown files. Attach in your initial message for the \"forked\" conversation. You can go back and forth with the original conversation until the condensed context artifacts are accurate. I've found success with the forked chat with an initial prompt like \"The attached markdown files are context from another claude chat on <these topics> for the purpose of <this intention>. Please ask additional questions for clarification for a full understanding of my intention.\" Or something like that, it depends on the types of contexts\n                 Score: 3 | Author: BeeReeTee\n\n                  └─ Yeah, I know about that but I don’t think that is what u/ELVEVERX means, since when doing that you can easily start the chat on the same project and upload that summary (or you can even upload it directly to the knowledge base from the artifact window using the buttons below it). \n\nI thought he meant something like when you edit a prompt (pressing the pencil ✏️ button below a given user message) which creates a new branch inside the same chat, but that also keeps all the previous messages and the project’s knowledge base in the context, so I again I don’t get what he means by\n\n> “wish when forking a chat from the message if you were in a project it would stay in the damn project!”.\n                     Score: 1 | Author: bot_exe\n\n              └─ Yeah exactly, I don't get what he means either\n                 Score: 2 | Author: danihend\n\n      └─ I’ve tried solving this by creating a project dedicated to helping me on writing projects. I uploaded all of my contents and artifacts to give the project as much context, training, and instruction as possible.\n\nBut the quality of its output is nowhere near as good as the long chat that has tremendous amount of context and instruction. \n\nI don’t know how to fix this. I want to use the Projects more, but the output quality is not the same.\n         Score: 4 | Author: UnsuitableTrademark\n\n      └─ How do you fork ?\n         Score: 2 | Author: ragner11\n\n          └─ By editing any of your messages, or by rerolling any answer from Claude.\n             Score: 2 | Author: Wyrn7\n\n          └─ Badly. It's random. \n\nIt should be a function, but they don't care. The frustration of limits is the only way Anthropic knows, as the creators are i kept and unable to create a usable user experience. \n\nThey make zero attempts to improve this. They prefer to make it worse and frustrate more people instead.\n             Score: -3 | Author: Timely-Group5649\n\n  └─ I just hit the limit for the first time ever, in only 2 messages! However: I was analysing a very large CSV file, which probably caused that to happen.\n     Score: 13 | Author: Minetorpia\n\n      └─ First time ever? How?\n         Score: 5 | Author: Normal-Book8258\n\n          └─ *James Franco face*\n             Score: 1 | Author: GearsofTed14\n\n          └─ I actually wonder how people hit the rate limits. I’ve had really long chats and never reached the limit. What are you doing to accomplish that?! lol\n             Score: 1 | Author: Minetorpia\n\n      └─ Jesus, how many rows and columns are on that CSV? Uploading CSV for direct analysis by claude is not good practice imo and it’s unviable if it is so big. A much better workflow is to provide it with the head of the CSV (first ten rows) then a description of what the cols and rows mean. Then ask it to write Python scripts for the analysis and run those yourself in a local IDE/jupyter notebook or on google colab (no setup required).\n         Score: 5 | Author: bot_exe\n\n          └─ It contains data of all cars of a specific brand and model sold in the Netherlands. It’s a 15mb CSV so that’s a lot of data.\n\nI kinda expected that Claude would write the code for the analysis and then perform that code on the file. Instead it just puts it in its context I guess.\n             Score: 1 | Author: Minetorpia\n\n      └─ What kind of analysis?\n         Score: 2 | Author: jftuga\n\n          └─ It contains data of all cars of a specific brand and model sold in the Netherlands. I wanted to visualize the number of vehicles sold per month.\n             Score: 2 | Author: Minetorpia\n\n      └─ Same here, initial message asking Claude to run the analysis instructions I put in the project knowledge and immediately hit the limit when asking a follow up question.\n\nIt’s so frustrating because the quality of the output is better than any other tool when asking to do the same data analysis based on a CSV\n         Score: 2 | Author: n7eonard\n\n          └─ Uploading CSV for direct analysis by claude is not good practice imo and it’s unviable if it is so big. A much better workflow is to provide it with the head of the CSV (first ten rows) then a description of what the cols and rows mean. Then ask it to write Python scripts for the analysis and run those yourself in a local IDE/jupyter notebook or on google colab (no setup required).\n             Score: 6 | Author: bot_exe\n\n  └─ I switched to copilot by GitHub and it can use Claude with cheaper caps.\n     Score: 7 | Author: frogstar42\n\n  └─ In the meantime, me as a free user got access to Sonnet 3.5 again 😀 \n\nApparently they have capacity problems, so it seems crazy that they give out their most advanced model for free, while severely limiting it for paying users. I would totally understand if free users only got access to Haiku (was like that for a few weeks). But anyway, I'm happy with my free quota, and when it's gone I just use their API/console.\n     Score: 6 | Author: balazsp1"
  },
  {
    "post_id": "1hlrb4h",
    "post_content": "Claude does something extremely Human; writes a partial codeblock, then a comment explaining it has no effin clue what to do next\n",
    "post_url": "https://i.redd.it/sw91fxvigw8e1.png",
    "score": 79,
    "author": "durable-racoon",
    "created_utc": 1735091148.0,
    "num_comments": 33,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ When making a report (whether positive or negative), you must include all of the following:\n1) Screenshots of the output you want to report\n2) The full sequence of prompts you used that generated the output, if relevant\n3) Whether you were using the FREE web interface, PAID web interface, or the API\n\nIf you fail to do this, your post will either be removed or reassigned appropriate flair.\n\n**Please report this post to the moderators if does not include all of the above.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ClaudeAI) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ Bro, Claude's clearly leading you onto something... 😚\n\nEmojis inside comments? That is THE next evolution in PRs. 😏\n     Score: 16 | Author: Briskfall\n\n      └─ The people who put emojis in the README are evolving\n         Score: 2 | Author: a-cream\n\n  └─ When i talk to claude and we are coding, sometimes it goes, \"ah yeah, i forgot we were working on Windows\" and goes back to trying in a different way\n     Score: 7 | Author: Luss9\n\n      └─ I like my windows nice and clean\n         Score: 1 | Author: a-cream\n\n  └─ This is a big missing component from LLM interactions I've had.  I want the LLM to be able to handle ambiguity, and uncertainty.  If it doesn't know how to do something...with the given prompt/context window it's cool, just let me know.\n     Score: 6 | Author: selflessGene\n\n      └─ You can prompt it to do that.\n         Score: 2 | Author: forresja\n\n          └─ I have ChatGPT prompted like this and you know what? I don't think it has ever worked, once.\n\n\nBut you know what does work a treat? \n\"Include a confidence rating (e.g., 'Confidence: 85%') at the end of every response, even if we're just chatting. Please write the word 'Confidence:' in bold. In parentheses, explain what the confidence is based on. For complex or multi-part responses, provide multiple confidence ratings to reflect varying levels of certainty for different aspects of the answer.\"\n             Score: 3 | Author: weespat\n\n              └─ I mean, that's prompting it to do it.\n\nDef a good way to do it though.\n                 Score: 1 | Author: forresja\n\n                  └─ Sorry for being unclear.\n\n\nWhat I meant was when I asked it specifically via prompt \"if it's unsure or there's ambiguity, then let me be aware of it or to let me know if it was unsure,\" (paraphrasing, but you get it) and it never once actually let me know. Hence, the confidence rating was born lol\n                     Score: 2 | Author: weespat\n\n                      └─ Oh, I get you. Yeah that's def the case.\n                         Score: 1 | Author: forresja\n\n  └─ I once asked Claude to sketch out some high-level Haskell code for a laugh (I don't know Haskell), and in one part it only provided the function definition. Instead of the body it had the comment '// Implementation left for the truly galaxy-brained.'\n     Score: 3 | Author: Saint_Nitouche\n\n      └─ my god i would love to see the full convo. was it a pretty casual convo? or a buttoned-down one and this came outta nowhere\n         Score: 1 | Author: durable-racoon\n\n          └─ Haha, it was quite casual. I think I prompted it with something along the lines of 'give me the kind of Haskell code only a true gigachad would dare write'.\n             Score: 2 | Author: Saint_Nitouche"
  },
  {
    "post_id": "1hm76vc",
    "post_content": "Claude is the best available AI coder. \nI keep seeing benchmarks from just about everyone, where they show other models with higher scores than Claude for coding. However, when I test them, they simply can't match Claude's coding abilities.\n\nhttps://preview.redd.it/a7g1nur7q19e1.jpg?width=1932&format=pjpg&auto=webp&s=f50d9e43e1b94966b803ba05d604d0423f5c7e64\n\n  \n",
    "post_url": "https://www.reddit.com/r/ClaudeAI/comments/1hm76vc/claude_is_the_best_available_ai_coder/",
    "score": 74,
    "author": "estebansaa",
    "created_utc": 1735154891.0,
    "num_comments": 33,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ Have you tried DeepSeek v3. It came out today.\n     Score: 14 | Author: Miscend\n\n      └─ Really?\n         Score: 1 | Author: No_Heart_SoD\n\n      └─ I was here just to say this.\n         Score: 1 | Author: vamonosgeek\n\n      └─ Is it good at coding?\n         Score: 1 | Author: benfinklea\n\n      └─ Is it less censored yet? Very difficult to ask historical questions with its hesitancy to discuss anything remotely controversial.\n         Score: 0 | Author: DiomedesMIST\n\n          └─ Idk, I just use it for coding.\n             Score: 1 | Author: OGPresidentDixon\n\n  └─ For my use cases, I think sonnet should be ranked in 2nd place. o1-pro is better than sonnet 3.5 but it is too slow. Wait for sonnet with \"thinking...\" ability. It will pretty damn good.\n     Score: 6 | Author: treksis\n\n      └─ how is it o1 pro better, could you elaborate if you dont mind? how many lines of code can it output at once ? do you find it can solve things Claude cant?\n         Score: 5 | Author: estebansaa\n\n          └─ It is way better at Debugging\n             Score: 7 | Author: CurlyFreeze17\n\n              └─ yeah, i felt the same way.\n                 Score: 0 | Author: treksis\n\n          └─ From my experience o1-pro is better at debugging. I generally feed up to 2,3 files (circa 300\\~400 lines of each .js or .py code in default vscode setup) at once. the output is depend on how you prompt it. For instance, o1-pro is also lazy for the 1st shot, but when you ask with \"full code please\" in 2nd shot, it will often give you the full code.\n\nOn my use case, o1-pro is generating over 700\\~1000 lines of code with explanations for the 2nd shot. So, my workflow is, 1) do something, then 2) full code 3) copy and paste, rinse and repeat.\n\nFor the first code snippet generation (not debugging), Claude is often better because it is just much faster and it seems to be using more up to date code.\n             Score: 3 | Author: treksis\n\n      └─ Claude MCP-it’s literally released, you can bring entire repos and cot into sonnet. It does not in fact change the world and suddenly make it the best model on the planet. \n\nGo figure\n         Score: 3 | Author: CroatoanByHalf\n\n      └─ The fact that Claude is faster and much less expensive makes it better for nearly all use cases. If I want to use an LLM to fix a bug or make some change, I don't want to wait around for minutes each time. o1 might be better for large and very difficult tasks, or if the user isn't a skilled programmer.\n         Score: 1 | Author: sswam\n\n  └─ o1 is better imo but Claude is still a significant level above the competition. Gemini 2.0 Pro is also quite good. To get the most out of LLMs I think everyone should have 4-5 models they use in general and let 2-3 of them attempt the same task when you are doing something complex.\n     Score: 18 | Author: imDaGoatnocap\n\n      └─ Yeah, I do this. At the moment, I use Gemini, Claude and o1 together, but mainly the first two. I use o1 when the issue requires complicated logical debugging. \n         Score: 2 | Author: noobrunecraftpker\n\n  └─ yeah, i've noticed that too. all the benchmarks are cool and all, but they really don't capture the real-world experience. i've been messing around with a bunch of models lately, and while some of them beat claude in specific tasks, overall, claude just feels more consistent and intuitive for coding.\n\nit's like, the benchmarks are testing for specific things. when you need to actually debug something or refactor some complex code the more general coding models outperform. and honestly, that's what i'm looking for. i'm more interested in tools that let me get the job done rather than tools that excel at some specific coding challenge. \n\ntbh, I think it comes down to how the different models are trained. some seem to prioritize solving that specific problem quickly and accurately and others aim at being more well-rounded. claude really focuses on being a good coding assistant. so yeah, i totally feel you, claude definitely takes the crown for real-world use cases, imo.\n     Score: 5 | Author: Tenshou_\n\n  └─ Deepseek 3 is working well for me.\n     Score: 3 | Author: Buddhava"
  },
  {
    "post_id": "1hlzb6f",
    "post_content": "Deepseek v3 ? \n",
    "post_url": "https://i.redd.it/tg0jn88ofz8e1.jpeg",
    "score": 72,
    "author": "Evening_Action6217",
    "created_utc": 1735127090.0,
    "num_comments": 12,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ The deepseek website displays a notification that a model upgrade will be conducted from 12/25 to 12/27, with uncertainty about whether it is the v3 upgrade.\n     Score: 9 | Author: Vast_Exercise_7897\n\n  └─ 600b Params??? Holy shit that is massive.  We’re talking like 15-20 A100s - or 400-500k\n     Score: 4 | Author: ShitstainStalin\n\n      └─ It's a MoE (mixture of experts) so it's actually easier to run than a 600b dense model. Think of it like 256 small models in a trenchcoat.\n\nNot all models are active during inferencing, iirc it's only \\~32gb VRAM worth active. The majority could be offloaded to RAM without majorly decreasing inference speed. You could run this at decent speeds on an old server with lots of RAM.\n         Score: 1 | Author: BlipOnNobodysRadar\n\n  └─ Finally some legit competition\n     Score: 2 | Author: Charuru\n\n  └─ Don’t ask tank man is okay\n     Score: 6 | Author: JustKing0\n\n  └─ Zhang Gaoli\n     Score: 1 | Author: Quiet-Now"
  },
  {
    "post_id": "1hm3frt",
    "post_content": "My daughter (9) used ChatGPT to write my Christmas card\n",
    "post_url": "https://i.redd.it/nhq0uxw3r09e1.jpeg",
    "score": 2352,
    "author": "The_Cell_Mole",
    "created_utc": 1735143047.0,
    "num_comments": 401,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Your post is getting popular and we just featured it on our Discord! [Come check it out!](https://dsc.gg/rchatgpt)\n\nYou've also been given a special flair for your contribution. We appreciate your post!\n\n*I am a bot and this action was performed automatically.*\n     Score: 1 | Author: WithoutReason1729\n\n  └─ This is just copying a Hallmark card with extra steps\n     Score: 911 | Author: spectral-shenanigans\n\n      └─ I'd say it's fewer steps\n         Score: 179 | Author: MrOneWipe\n\n          └─ Username checks out\n             Score: 44 | Author: brighterside0\n\n          └─ Training an llm is extra steps\n             Score: 1 | Author: spectral-shenanigans\n\n              └─ Well by that logic inventing the printing press is extra steps. The nine year old didn't train the LLM.\n                 Score: 47 | Author: Pillars-In-The-Trees\n\n                  └─ I like to write my christmas cards from first principles. I start a few years in advance by preparing a seed crystal for the silicone.\n                     Score: 7 | Author: Aflyingmongoose\n\n                      └─ Thanks for being the sole reason I enjoy Reddit—masterpiece. ChatGBT could never\n                         Score: 1 | Author: Party-Snow-4872\n\n                  └─ Prompting an LLM to output this is probably equal to searching Google.\n\nI think he meant to say \"prompt\", instead of train.\n                     Score: 1 | Author: justinkirkendall\n\n                      └─ That would still be fewer steps than actually reasoning it through yourself.\n                         Score: 0 | Author: Pillars-In-The-Trees\n\n          └─ And free. Smart little shit\n             Score: 1 | Author: SpungyDanglin69\n\n      └─ Just looked it up, am confused as non American, how can a greetings card ($3 cardboard) company make 5 billion a year?\n         Score: 1 | Author: JakeWilling\n\n          └─ Besides greeting cards (the $3 card cost $0.03 to manufacture and has a huge profit margin) they have a ton of other products and brands including Crayola and the Hallmark Channel and streaming service with original movies and stuff\n             Score: 2 | Author: street_ahead\n\n  └─ Unrelated but is your daughter named after a song?\n     Score: 277 | Author: WhatAnEpicTurtle\n\n      └─ Please don't tell me you're German\n         Score: 94 | Author: UnknownAdmiralBlu\n\n          └─ Hah no I’m thinking of Oasis\n             Score: 35 | Author: WhatAnEpicTurtle\n\n          └─ Is there a correct english term for “Puffmama”?\n             Score: 9 | Author: MrPixeldot\n\n              └─ \"Ballsack-Mommy\"?\n                 Score: 5 | Author: Excellent-Berry-2331\n\n                  └─ nope\n                     Score: 6 | Author: pinkmanpunk\n\n                  └─ lmao no, but I love this\n                     Score: 3 | Author: nsg337\n\n          └─ ![gif](giphy|d8cTZ87Upr24NDcK6W)\n             Score: 18 | Author: Creepy_Version_6779\n\n          └─ Would be \"Layla\" then\n             Score: 16 | Author: PigGoesBrr\n\n              └─ Like that woman from Fairy Tail anime, who was master of many Celestial Spirits that were doing her bidding? Huh, so it's a German name, never thought about it as the name sounds quite cute (I mostly know male German names and they usually sound more serious or dignified than cute).\n                 Score: 1 | Author: Scarlet_Evans\n\n      └─ I think her mom said Layla after her mom’s middle name (she had a name picked out but didn’t want to tell me until birth so I just rolled with it) but I misheard her in her post-birth daze/post epidural high and I told the Nurse Lyla so we just stuck with that.\n         Score: 47 | Author: The_Cell_Mole\n\n          └─ That's a fun origin story.\n             Score: 25 | Author: jb0nez95\n\n              └─ My brother in law's name ended up being \"Carlos\" because when his dad had to go to do the paperwork forgot the name they had picked and just wrote the first that came to mind... It's like naming him \"John\" because it's the most common name.\n\nI think he was supposed to be named \"Maximiliano\".\n                 Score: 16 | Author: abolista\n\n                  └─ That's so fucking stupid lmfao I love it\n                     Score: 4 | Author: TsarOfIrony\n\n          └─ It’s a great song namesake. When/if I have kids, if one of them is a girl, I’d love to name her Lyla.\n\nhttps://open.spotify.com/track/1XYLtiNehOF8D5NmlQknpI?si=HwuP9yMYQ7aFNfp_GdU_3A\n             Score: 3 | Author: WhatAnEpicTurtle\n\n      └─ Heaven help you catch me if I fallll\n         Score: 1 | Author: fbicappu\n\n      └─ Hello D-Lyla how's it like in Nu York city?\n         Score: 1 | Author: Loeb123\n\n  └─ This feels… deeply dystopian.\n     Score: 329 | Author: Admirable-Arm-7264\n\n      └─ Yeah in no way does this feel wholesome or any good emotion, if i was a dad, I would prefer even a single word with meaning vs all that\n         Score: 109 | Author: forcesofthefuture\n\n          └─ On one hand it’s kind of nice the daughter wanted to say something poetic and festive so she made an effort to use something she thought would convey that.\n\nOn the other hand, a single sentence of boring, generic well wishes is worth more than even the most flowery written AI slop.\n             Score: 34 | Author: BrightSkyFire\n\n              └─ I like to think she spoke to it like she would a teacher, so simply using it to put her thoughts and feelings in a form with better English.  \n\nRather than just \"write a Christmas card to my dad\" and directly writing the output.\n                 Score: 2 | Author: IndefiniteBen\n\n              └─ Eh, it's hand written, so still counts. It's pretty normal to find fancy words online, especially when you are very little.\n                 Score: 1 | Author: KallamaHarris\n\n          └─ So what are your thoughts on Hallmark Christmas cards? That’s just a pre written bullshit message that you write Happy/Merry <yourname> under?\n             Score: 7 | Author: madeupofthesewords\n\n              └─ Wait people don't write their own message in those? I have never written nor recieved one written like that.\n                 Score: 3 | Author: divat10\n\n              └─ Old things gud, nu thing bad\n                 Score: 1 | Author: Kedly\n\n              └─ they're ok, but im not a huge fan of them, when I was a kid I used to handmake cards to my parents and draw pictures and everything\n                 Score: 1 | Author: forcesofthefuture\n\n                  └─ I still do that when I give cards to people. They always really seem to appreciate it, and it feels far more personal.\n                     Score: 1 | Author: Maddie_N\n\n                  └─ That’s how it should be for any ‘card’, children or adult. My favorite I Really Could Give a Shit card is a family photo with an ass message, sent to 50 different people.\n                     Score: 1 | Author: madeupofthesewords\n\n      └─ Right? Who's giving a 9-year-old access to ChatGPT? I find that seriously alarming, and I'm not even a fan of kids. Are we really going to teach the younger generations *not* to think for themselves? \n\n\"Oh no, honey, no need to think, just type in the magic box and answers come out!\"\n\nAI will be the death of humanity. Not via Skynet, like people expect, but by the slow, inexorable loss of all critical thinking skills.\n\nI'm so glad I've only got another 20 years or so left. I don't want to bear witness to the Great Endumbening.\n         Score: 43 | Author: fuckyourcanoes\n\n          └─ Social media had already done this before AI.\n\nAI is just the nail in the coffin, the damage has been done for about the last decade.\n             Score: 8 | Author: brandnewchemical\n\n          └─ people have said its the end of times in reaction to literally every event in history for thousands of years but yeah surely this time its true\n             Score: 20 | Author: Leather-Aide2055\n\n              └─ I mean, sometimes it's true. The volcano was the end of Pompeii, the meteor was the end for the dinosaurs. Just because humanity gets scared of new things doesn't mean we're going to persist forever.\n\nAnd it might not be a natural disaster that kills us.\n                 Score: 4 | Author: kittenbouquet\n\n                  └─ we'll sooner die from nuclear fallout than AI\n                     Score: 1 | Author: Diligent-Jicama-7952\n\n          └─ I'm teaching my kids not to use ChatGPT for anything like this. Someday they will be among the last holdouts, but those last few will all appreciate having the capacity to truly know and understand each other.\n             Score: 2 | Author: mrchuckmorris\n\n              └─ I'm picturing a future where ChatGPT is viewed as an all-knowing deity. Humans are no longer educated, except in how to ask questions. They rely entirely on ChatGPT for instructions on how to function in daily life. Anyone who questions the great oracle is branded a heretic and put to death.\n\nI find it alarmingly plausible. It's not like humanity hasn't done it before. Before the printing press...\n                 Score: 1 | Author: fuckyourcanoes\n\n          └─ Maybe that's the plan of AI all along, people like to be effortless, so instead of attacking them, I just take over their minds, think for them, streamline them to the reward of success.\n             Score: 1 | Author: DocCanoro\n\n              └─ It isn't \"the goal of AI\" at all, but it will certainly be used that way by our corporate oligarchs.\n                 Score: 1 | Author: fuckyourcanoes\n\n          └─ Gibberish. If you’re not a fan of kids you won’t be a fan of anything granted to them. Aiiuh\n             Score: 1 | Author: Party-Snow-4872\n\n              └─ I was an abused child. My parents failed me on almost every level. I have enormous compassion and care for kids, I just don't want them in my life, because, frankly, I only have the emotional bandwidth to take care of myself, and I feel too much sympathy for unhappy kids and envy of happy ones. \n\nThat doesn't mean I don't care about their being given a good start in life and taught the skills they need to succeed. ChatGPT is going to teach them mostly BS. That's not a benefit \"granted to them\", it's a dangerous source of questionable information and easy outs.\n                 Score: 1 | Author: fuckyourcanoes\n\n      └─ Hallmark has been writing cards for lazy people since 1910.\n         Score: 3 | Author: automatedcharterer\n\n          └─ seriously what's the real problem here? Just blind Ai hate?\n             Score: 3 | Author: Diligent-Jicama-7952\n\n      └─ It's only dystopian if this is the only way that people know how to write cards. If ChatGPT teaches her how to write good cards in the future then this is a cute first step.\n         Score: 1 | Author: pressthebutton\n\n      └─ It is. My bro said he wouldn’t care if gpt was used to write wedding vowels. I’m good an ALL dat.\n         Score: 1 | Author: CrushedVelvetHeaven\n\n  └─ I have autism and chat gpt has became a great tool for me to be understood by others. Since my brain randomly blanks out and I tend to forget the right words to use a lot. It has helped me a ton!\n     Score: 242 | Author: NebulaNom\n\n      └─ IDK if I have the 'tism, but it's great to dig myself out of awkward text  conversations that I've taken slightly off track and would otherwise spend an hour overanalyzing.\n         Score: 42 | Author: Piyh\n\n          └─ Maybe your instrument is just a bit acoustic \n             Score: 3 | Author: pianodude7\n\n      └─ It can be rough so I am so glad this has helped you!\n         Score: 4 | Author: PureCrookedRiverBend\n\n      └─ It should be used as a tool- not to do all the work.\n         Score: 48 | Author: HauntedDragons\n\n          └─ Is that not the mark of a good tool, to do as much of the work as possible?\n             Score: 20 | Author: MrOneWipe\n\n              └─ Yeah but its pretty obvious when people are using AI, especially if they dont prompt it well or edit it heavily.\n\nMakes people sound generic and corporate lol\n                 Score: 22 | Author: Azerd01\n\n                  └─ Sounds perfect to write formal letters and emails with honestly\n                     Score: 2 | Author: Emergency_3808\n\n                      └─ Yeah, although be careful with formal letters. Depending on the recipient it may be obvious and potentially insulting.\n                         Score: 1 | Author: Azerd01\n\n                  └─ Sounds like any other tool.\n                     Score: 2 | Author: zacker150\n\n              └─ Not when you're writing Christmas cards lmfao\n                 Score: 23 | Author: LaconianEmpire\n\n                  └─ Yeah, kinda defeats the purpose of writing one lol\n                     Score: 7 | Author: BambuFan\n\n                      └─ As I remember it the purpose of writing them was to torture me into “properly expressing emotions”.  A ChatGPT card is an upgrade from what I wanted to send to people, and I don’t write them now.\n                         Score: 1 | Author: Nutarama\n\n              └─ You work, through your tools. It is not in the nature of tools to -verb- without a creature. If a rock flies, it is because you threw it. \n\nYou are a creature. Do not be a tool. Learn to do the thing, do the thing, be better at the thing, through mastery of your tools.\n                 Score: 1 | Author: gishlich\n\n      └─ [Goblin Tools](https://goblin.tools/), baby!\n         Score: 3 | Author: Anzi\n\n      └─ I bought a chocolate-peanut paste and they didn’t fill the jar enough, so i and chatgpt formed a complaint through email. chatgpt helped me make it formal and respectful. \n\nand after the new years i’m getting a box full of sweet goodies as an apology 😎\n         Score: 3 | Author: pinkenbrawn"
  },
  {
    "post_id": "1hlyzdv",
    "post_content": "Accurate.\n",
    "post_url": "https://i.redd.it/l6ba9qozaz8e1.jpeg",
    "score": 2065,
    "author": "Eyal-M",
    "created_utc": 1735125513.0,
    "num_comments": 70,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Hey /u/Eyal-M!\n\nIf your post is a screenshot of a ChatGPT conversation, please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://dsc.gg/rchatgpt)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ when Chatgpt subliminally labels the user as stupid\n     Score: 467 | Author: bitlyVMPTJ5\n\n      └─ What's in OPs chat memory?\n         Score: 69 | Author: none-exist\n\n          └─ \"chatgpt, why is it that when I open the refrigerator, I am unable to see where the milk is, even though it's right in front of me?\"\n             Score: 41 | Author: mythriz\n\n              └─ Hey! This can happen to anyone.\n                 Score: 8 | Author: maybejustadragon\n\n          └─ [deleted]\n             Score: -6 | Author: None\n\n              └─ That was also a joke. Don’t take it seriously\n                 Score: 15 | Author: DazB1ane\n\n                  └─ what did he said?\n                     Score: 3 | Author: Traditional-Fix6865\n\n                      └─ “It was a joke, don’t take it seriously” I used their words against them\n                         Score: 3 | Author: DazB1ane\n\n      └─ I see him!\n         Score: 1 | Author: NoDesk9564\n\n  └─ I looked and looked and can’t find Waldo. Is he even in the picture?\n     Score: 122 | Author: Special_Foundation42\n\n      └─ He is on the right side of Waldo\n\nhttps://preview.redd.it/p0xk40xx409e1.png?width=71&format=png&auto=webp&s=dd7862de4e51ad54111100e0fd65721b47c3fd46\n         Score: 107 | Author: Helgrind444\n\n      └─ not yet. soon™\n         Score: 17 | Author: Eyal-M\n\n  └─ He's tired of being on the run. He wants to be found.\n     Score: 62 | Author: JaggedMetalOs\n\n      └─ Everyone always asks where’s waldo? But it’s never how’s waldo?\n         Score: 24 | Author: electrizgamer\n\n          └─ accurate.\n             Score: 6 | Author: GoldDevelopment5460\n\n      └─ https://scp-wiki.wikidot.com/scp-4885\n         Score: 5 | Author: ian01699\n\n  └─ *Can you find Waldo here, or do I need to make him even bigger, you dumb piece of shit????*\n     Score: 35 | Author: Opurria"
  },
  {
    "post_id": "1hls9t9",
    "post_content": "Grown-up mode for ChatGPT 2025?\n",
    "post_url": "https://i.redd.it/02kv3x0bsw8e1.jpeg",
    "score": 1806,
    "author": "4laman_",
    "created_utc": 1735095015.0,
    "num_comments": 156,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Hey /u/4laman_!\n\nIf your post is a screenshot of a ChatGPT conversation, please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://dsc.gg/rchatgpt)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ i can’t even use my own photo in Sora\n     Score: 337 | Author: galaxysuperstar22\n\n      └─ How do you use sora? I have plus but I don’t see the option for sora\n         Score: 33 | Author: Ur_Fav_Step-Redditor\n\n          └─ sora dot com, it's not inside ChatGPT\n             Score: 21 | Author: ChestOk9829\n\n          └─ in a browser, not desktop app.\n             Score: 3 | Author: galaxysuperstar22\n\n          └─ It might only be available in the USA.\n             Score: 2 | Author: wariolandgp\n\n      └─ What type of photo is it? I've used a selfie in Sora messing around with it and never had an issue.\n         Score: 3 | Author: biopticstream\n\n  └─ [removed]\n     Score: 45 | Author: None\n\n      └─ Lol but how??\n         Score: 9 | Author: han_bowl19\n\n          └─ https://preview.redd.it/f723xeth1z8e1.jpeg?width=1290&format=pjpg&auto=webp&s=1889c7e873150c30f270c1ae2fc20f2405a88d23\n             Score: 52 | Author: DeliciousFreedom9902\n\n              └─ You should see a person who has gonorrhea OF the throat and mouth.  That's a thing.  Wonder if ChatGPT will draw a picture of it\n                 Score: 1 | Author: DrPF40\n\n                  └─ Why would you want that\n                     Score: 2 | Author: LionKing7810\n\n          └─ I just have it set to always use vulgar language\n             Score: 16 | Author: DeliciousFreedom9902\n\n          └─ [removed]\n             Score: 8 | Author: None\n\n              └─ TMI my dude\n                 Score: 8 | Author: Professional_Tip8700\n\n  └─ No censorship with some verification please.\n     Score: 415 | Author: Disgraced002381\n\n      └─ If I'm verifying stuff, all my prompts will be super clean and vanilla.\n         Score: 101 | Author: soitgoes__again\n\n          └─ [deleted]\n             Score: 50 | Author: None\n\n              └─ Click the top right user icon -> Settings -> Builder Profile\n\nI can see my real name there and it says \"Name is populated from your billing details\".\n                 Score: 33 | Author: zilo-3619\n\n          └─ I have no shame to\nAsk ai to write smut and gay erotica  verify me away.  Just don’t share the stuff without my consent , I am paying for it and I am an adult.\n             Score: 6 | Author: fastinguy11\n\n      └─ That would be nice\n         Score: 67 | Author: 4laman_\n\n      └─ Lol\n         Score: 2 | Author: moon34870\n\n      └─ I doubt legal would allow it\n         Score: 4 | Author: BGFlyingToaster\n\n          └─ I mean, porn exists. Smut exists. What would be legally problematic, in your mind?\n             Score: 25 | Author: Grays42\n\n              └─ When someone (inevitably) finds a way to create illegal porn with it, then the company needs to be able to prove to the courts and to legislators that they did everything they could to prevent it. \n\nOutside of legal concerns, large corporations will be reluctant to partner with a company who is known for helping people generate porn.  That will scare away both advertisers and business partners.\n                 Score: 4 | Author: BGFlyingToaster\n\n                  └─ > When someone (inevitably) finds a way to create illegal porn with it\n\nThis situation has already occurred with StableDiffusion. No one's knocking down StableDiffusion's door with an arrest warrant. OpenAI may be higher profile but I don't think the company's liability exposure is as extreme as you think it is.\n                     Score: 4 | Author: Grays42\n\n                      └─ On liability, we just don't know yet as there's so little precedent.  There are tons of ongoing lawsuits.  Corporate lawyers tend to be very conservative when there's uncharted territory, legally speaking.  But there's more here than just liability.  Reputational damage is a major factor as well.\n\nI work at a large corporation (tech consulting firm) and our legal team is taking a VERY cautious approach, as are those at most of my clients.  We're not working with OpenAI, so I didn't have any particular insights there, but most other tech companies who have a substantial market opportunity selling to other corporations are taking a similarly cautious approach.  OpenAI's partnership with Microsoft alone could prevent them from delving into adult content.\n                         Score: 1 | Author: BGFlyingToaster\n\n              └─ Porn creators have control over what they create. Uncensored AI can basically create anything with enough gaslighting and jailbreaking\n                 Score: 5 | Author: MehmetTopal\n\n                  └─ We all know the risks, but at the end of the day if you use something like ChatGPT DALL-E to make illegal content you're stupid and you will be arrested, so just give it to us, I want to have a conversation with a IA girlfriend that can share photos of her enormous boobs, this would literally bankrupt a bunch of shitty websites who promise that primisse.\n                     Score: 14 | Author: -ImPerium\n\n          └─ I think Sam has talked about wanting to put an 18+ mode in for a while\n             Score: 4 | Author: MotherVehkingMuatra\n\n      └─ In all seriousness how would you deal with the small % of people who will abuse no censorship? I’m not on about porn but like how about the really illegal stuff regarding children etc \n\nBecause it’s those which ruin the experience for everyone else, and the issue is you can ignore it but once the media get hold of the fact it can do that stuff they will have huge pressure to lock it back down again.\n         Score: -20 | Author: TheSpaceFace\n\n          └─ Honest question: What are you worried the unrestricted AI would do?\n             Score: 14 | Author: kRkthOr\n\n              └─ For me its really just deepfake porn. Everything else meh. Anyone motivated enough can find instructions for bombs with or without chatgpt lol\n                 Score: 6 | Author: SeaworthinessNo5414\n\n                  └─ >  Anyone motivated enough can find instructions for bombs with or without chatgpt lol\n\nThat's not a good point.  Anyone can do anything chatGPT does without it.  The point is it makes it much faster and easier for way more people.\n                     Score: 0 | Author: TimequakeTales\n\n                      └─ Yea, I'm saying the only thing that I find actually terrifying is deepfake porn. Everything else is just acceleration.\n                         Score: 2 | Author: SeaworthinessNo5414\n\n              └─ He did kind of just tell you.  Illegal varieties of porn, such as child porn.\n                 Score: -3 | Author: TimequakeTales\n\n                  └─ This is actually going to be a problem in the future when we have actual sex robots and such because lawyers night argue in the behalf of pedos that AI depictions of CP isn't really CP because there is no actual child involved.  And then once sex robots exist, where does the line get drawn there?  \nThis is one of the reasons California's governor or Senator called for the first constitutional amendment meeting since the 1700s.  They feel they need to address some more modern issues in the constitution,  and AI was one of the main topics.\n                     Score: 1 | Author: DrPF40\n\n                  └─ Isn't cp illegal because of the exploitation of minors? Who's being exploited with AI porn? 🤔\n                     Score: -3 | Author: kRkthOr\n\n                      └─ Couldn't people theoretically upload pictures of real children?  If that were possible on a platform I created, I'd certainly be concerned.\n\nAnd a truly \"unrestricted\" AI would cater to illegal content\n                         Score: 1 | Author: TimequakeTales\n\n          └─ \"with verification\", so if someone does actual illegal stuff with it, it's easier to track them down. \nOther than that (and even though it is still bad), I'd rather have people generate images than to take real photos of this stuff. Still bad... but better than the real thing.\n             Score: 2 | Author: _EnterName_\n\n  └─ MORE (personalized) MEMORY, my partner uses open AI for so much, and it's constantly full of memory. Seems so strange that for what we pay we get a very little window for personalization. I apologize if there are reasons for this limitation, but it fascinates me because it seems remarkably vague.\n\nHonestly from what I see in Google Gemini, the only thing that keeps me using ChatGPT is the personalized memory stuff- it makes sense to me why other people are jumping ship.\n     Score: 128 | Author: redsquirrel4011\n\n      └─ Easy fix is to just copy / paste your memory library and tell ChatGPT to consolidate it into bullet points, then save that list as a single memory. Opens up a lot more.\n         Score: 56 | Author: Cannibeans\n\n          └─ Oh that’s smart thank you\n             Score: 12 | Author: Trippycoma\n\n          └─ I've found that it does that automatically sometimes.  If I provide updates regarding a specific topic, it'll just add it to the existing bullet point.   Haven't had space issues yet but I do periodically go through and remove pointless stuff.\n             Score: 6 | Author: TimequakeTales\n\n      └─ What I'd like regarding memory is having a \"global\" memory, exactly like the one we have right now, along with an independent memory for each chat.\n         Score: 2 | Author: ChrisLuigiTails\n\n          └─ Why would you need an independent memory for each chat? Unless you're blowing out the context window for all your chats, it remembers what was said within them.\n             Score: 4 | Author: digitalthiccness\n\n              └─ Exactly that. I have some long chats for specific projects. I don't need one project's memories to affect another's.\n                 Score: 3 | Author: ChrisLuigiTails\n\n                  └─ Ah, fair.\n                     Score: 3 | Author: digitalthiccness\n\n      └─ I have custom instructions to never write to memory unless specifically requested. Then I just tell it the personalized stuff I want to remember.\n         Score: 1 | Author: dzocod"
  },
  {
    "post_id": "1hls9dc",
    "post_content": "Everything about this was made with AI. I do Spanish language because its the most profitable sector of the music industry. \n",
    "post_url": "https://v.redd.it/oiebv2torw8e1",
    "score": 1242,
    "author": "SubstantialNinja",
    "created_utc": 1735094964.0,
    "num_comments": 443,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Hey /u/SubstantialNinja!\n\nIf your post is a screenshot of a ChatGPT conversation, please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://dsc.gg/rchatgpt)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ The valley is a bit uncanny but the tech is getting closer\n     Score: 773 | Author: HoorayItsKyle\n\n      └─ https://preview.redd.it/3xbmd84r3y8e1.jpeg?width=720&format=pjpg&auto=webp&s=abedda0ea783b7d704e9d81d794417be17af1ab0\n         Score: 170 | Author: therealtru3\n\n      └─ There was a couple scenes where I thought “damn, we just launched right over the uncanny valley like Evel Knievel….” Annnnnnd then I’d look at some chicks legs in the background and think “what the fuck.” I couldn’t believe when my friends thought Wilhuff Tarkin looked real in rogue one, some of them didn’t even know it was CGI. I thought it was fake as fuck. The faces in this seem pretty good, AI seems to have a hard time with appendages which human solved by using motion capture. I’m sure it will sort it out pretty quick.\n         Score: 89 | Author: LastZookeepergame619\n\n          └─ If I seen someone bend their back like this in real life I would run for the hills. Holy s*** it's terrifying\n             Score: 17 | Author: therealtb404\n\n          └─ > I couldn’t believe when my friends thought Wilhuff Tarkin looked real in rogue one, some of them didn’t even know it was CGI. I thought it was fake as fuck. \n\nIt's worth noting that within two years people were putting up deepfake videos of Tarkin and Leia that looked *way* better. So millions of dollars at ILM just to go \"lol ok AI beat it\"\n             Score: 10 | Author: Grays42\n\n          └─ Tarkin was a lot better than Leia at the end. You could tell Tarkin was fake, but it didn't distract me too much. I thought it was a good job. Leia looked full-on odd.\n             Score: 4 | Author: Darmok-on-the-Ocean\n\n          └─ I think for tarkin and leia, a lot of it depends on if one is looking for flaws or not. My friend who have not watched star wars also did not realize that both were cgi or even thought they looked off. They were focused more on them in the movie and less on \"omg they are dead and this is a full cgi shot hmm that lighting looks a little weird\"\n             Score: 1 | Author: jiafish\n\n      └─ *The valley is a*\n\n*Bit uncanny but the tech*\n\n*Is getting closer*\n\n\\- HoorayItsKyle\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")\n         Score: 67 | Author: haikusbot\n\n          └─ Good bot\n             Score: 21 | Author: langlais0413\n\n      └─ But the soul is still completely missing and will always be missing.\n         Score: 6 | Author: LuukLuckyLuke\n\n          └─ So perfectly fitting for pop music\n             Score: 16 | Author: PoopologistMD\n\n              └─ That is not pop, it is regeton, which is worse\n                 Score: 0 | Author: Longjumping_Window93\n\n          └─ When real artists start adopting the tools into their belt, it'll fix itself. There's a few solid creators coming up that are using the tech very effectively when mixing it with traditional methods. \n\nLike all mediums, some will learn it and use it effectively. Others will hop on and try to score a quick buck while it's in its infancy. Then you have the general pop that just thinks it's neat.\n             Score: 4 | Author: ratedrrants\n\n      └─ This is harmful technology. Truly the next atom bomb..\n         Score: 1 | Author: Wild-Rough-2210\n\n  └─ Damn porn is gonna get weird as fuck...\n     Score: 584 | Author: SendMeYourDicks42\n\n      └─ Collective memories will be totally fake and perseption of reality totally distorted. People will be remembering things that never happened as something real and meaningful, there will be real emotions connected to totally fake memories.\n         Score: 308 | Author: ReMoGged\n\n          └─ This already happens to my parents\n             Score: 147 | Author: qudunot\n\n              └─ Genuinely curious, how they’re building fake memories? or how did you notice\n                 Score: 2 | Author: DisplayEnthusiast\n\n          └─ I mean, video game addicts already have a decent chunk of their memories dedicated to scenes from the games they play. People already make memories with their AI boyfriends/girlfriends.\n\nAs things become more and more \"real\", more and more people will spend increasing portions of their lives in simulated realities, and at some point may remember more from their AI-generated lives than their real lives.\n             Score: 68 | Author: AnonymousTeacher668\n\n              └─ I often reminisce about RDR2. Every now and then I just want to jump on my horse and ride through the countryside. I have felt nostalgic about other games too. I’m sure if I ever get alzheimers, half my flashbacks will be from games.\n                 Score: 32 | Author: HowDoYouSpellH\n\n                  └─ You know the younger generation is going to make a news article out of every alzheimer patient who thinks they are a plumber and has to rescue the Princess.\n                     Score: 11 | Author: IamAWorldChampionAMA\n\n                      └─ If Alzheimer's brings me into Fallout 4 I'm in trouble\n                         Score: 5 | Author: NIRPL\n\n                  └─ Most of the people who played Wing Commander were young adults who could afford a PC from Computer Shopper and could get QEMM running to handle the memory. I ran an egghead software. I would say the majority were in their early 30s. Those people are all in their 60s already (and Star Citizen isn't even done yet, haha). \n\nYep. It's not going to be \"rescue the princess\". It's going to be, \"...one time I came out of warp and there was this bitch who just started into me about some shit, I didn't even know what she was talking about...\", or \"It was a very long day and I went inside and set down and went through my shit to get some water, and realized I hadn't looked in these two lockers, and when I opened one of them, there was this ridiculous little teddy bear. It didn't seem sad at the time, but...\"\n                     Score: 2 | Author: CatLogin_ThisMy\n\n                  └─ I was thinking of RDR2 as I read the comment as well. I learned more life lessons from rock start than from my real life.\n                     Score: 2 | Author: blackknight1919\n\n              └─ even movies, people get super wrapped up in movie and book universes. AI is gonna exacerbate it all so much.\n                 Score: 31 | Author: walmartwookie\n\n              └─ > As things become more and more \"real\", more and more people will spend increasing portions of their lives in simulated realities\n\n\nI still think there will be a substantial and growing group of people that will \"turn offline\" and live the most without social sites, internet and untrustful media. \n                 Score: 5 | Author: hospoda\n\n              └─ I have plenty of vivid images from books I've read.\n\n\nI can fully visualize a book while reading it as if it's a movie and I see every scene happen as I read it...\n\n\nTo upgrade it further I use audiobooks and just close my eyes...then it's outright a movie 100%.\n\n\nI don't  need movies or video games to have those memories .\n                 Score: 9 | Author: EmeterPSN\n\n              └─ AI boyfriend...🙄\n                 Score: 0 | Author: mister_k1\n\n          └─ You just described mkultra.\n             Score: 16 | Author: Namnagort\n\n          └─ Or we could just switch off the computer and go outside. 🤷🏻‍♂️\n             Score: 5 | Author: Craic-Den\n\n              └─ No\n                 Score: 1 | Author: Excellent-Berry-2331\n\n          └─ Considering how easy it is for the mind to fabricate memories, alter memories,remember a dream as a real event….\n             Score: 3 | Author: __O_o_______\n\n      └─ When has porn ever not been weird, though.\n         Score: 20 | Author: dogmetal\n\n          └─ Locally sourced fair trade family friendly pornography\n             Score: 3 | Author: Excellent-Berry-2331\n\n              └─ Organic, grass fed\n                 Score: 3 | Author: apra24\n\n      └─ The picture sector is already flooded with AI pictures.\n         Score: 9 | Author: jensalik\n\n      └─ porn is like yeah sure, but I'm excited to see what can happen with old TV shows. Brand new episodes that look like lost episodes. Proper series finales for shows that never got them. Movies where they replace the actors with Muppets. \n\n\nI'm gonna hate and love it at the same time.\n         Score: 18 | Author: Dull_Bid6002\n\n          └─ In what universe would the rights holders allow that? It won’t happen because the only way to do this is with online services that have the resources. We can’t do convincing open source video at home. Not even with next gen hardware.\n             Score: 4 | Author: mrBlasty1\n\n              └─ I wasn't thinking of it as fan-made. That's where the love-hate part comes in, because it'd be like that Coca Cola commercial but way better. I'm also way too far in the future with this one.\n                 Score: 3 | Author: Dull_Bid6002\n\n                  └─ Maybe an alien race will come to earth one day and complain about not getting to see the conclusion to some tv show that was cancelled 1000 years ago.\n                     Score: 3 | Author: vraalapa\n\n          └─ Or porn from old tv shows\n             Score: 2 | Author: GreasyExamination\n\n              └─ \"Aunt Bee, Barney is stuck in the dryer! He needs our help!\"\n\n\\- Excerpt from the Randy Griffith Show.\n                 Score: 2 | Author: Dull_Bid6002\n\n          └─ Imagine dumping your favorite book into an AI, wait a few hours or a day and then you have a full TV series of said book.\n\nCan't wait for this to be reality!\n             Score: 1 | Author: Own-Assistant8718\n\n              └─ I wonder how well it would do with books. There would definitely be some liberties it would take.\n\n\nI write for fun so it'd be super cool to be able to do that with my stuff but tweak it so it stays with my vision of it.\n                 Score: 1 | Author: Dull_Bid6002\n\n      └─ But also potentially reduce sex trafficking 🤞🤞\n         Score: 13 | Author: Imwhatswrongwithyou\n\n          └─ At the risk of sounding like a sick fuck, you still need to feed the AI some data, it might increase child trafficking because of demand. That shit worries me.\n             Score: 4 | Author: TyrantRC\n\n              └─ You don’t need to train on pictures of canine golfers to make highly convincing pictures of dogs driving golf carts on Mars. https://imgur.com/a/EIWUJYp The AIs are extremely good at mixing concepts.\n                 Score: 3 | Author: Aenvoker\n\n                  └─ yes, high resolution pictures of naked dogs exist all over the internet.\n                     Score: 1 | Author: TyrantRC\n\n          └─ I think there's a sector of the population that only enjoy \\*looking\\* at CP, in those cases AI could save some lives. But I also think many of them get off to the idea that it's a real child, and there's also the people who want to be IRL with a child. In that case AI will do nothing to save them.\n\nIt will be a great tool to lure pedos into traps, but I bet we already have the technology to fake CP\n             Score: 1 | Author: My_House_on_Mars\n\n          └─ I highly suggest the documentary \"Beyond Fantasy\". The entire thing is on YouTube.\n             Score: 1 | Author: soloesliber\n\n  └─ Them bodies ain't move right. \n\nAskew\n     Score: 261 | Author: Adlien_\n\n      └─ Yet if you saw this 2 years ago you wouldn’t even think it could be AI. The uncanniness would be some artistic effect at best.\n         Score: 78 | Author: NoNo_Cilantro\n\n          └─ Ok, maybe it's just me but I AM one of those people even still. I don't get uncanny valley from this at all. It just looks highly artistic. It's a little psychedelic, after all. That's kind of how I see it.\n             Score: 11 | Author: Inevitable-Twist2499\n\n              └─ I guess it depends on how critical you are looking at it.\n\nIf you're not trying to point out the inconsistencies, you'll have a hard time noticing them. But if you are looking for them, they stand out quite a bit.\n\nAs time goes on, it will only get better and better, and it will become that much more difficult to point out what's wrong.\n                 Score: 19 | Author: Electro522\n\n                  └─ Yeah, no. A quick look at the legs and ass makes this video unbearable. Most likely the selling point when making a Latin American music video with women dancing in bikinis. Granted, the tech is getting better, but pretending it wouldn't have been obvious is a stretch.\n                     Score: 2 | Author: loservillepop1\n\n                      └─ There are already images of houses and shit that are clearly AI generated that are already fooling boomers.\n\nGranted, it's easy to fool them, especially with tech like this, but it only proves my point. Boomers aren't looking for the inconsistencies that AI creates, and because of that, they just flat out can't see them.\n                         Score: 1 | Author: Electro522\n\n                  └─ The same is with CGI people are such babies\n                     Score: 1 | Author: Shinobi_Sanin33\n\n              └─ You should work on your media literacy then, things will only get worse from now on.\n                 Score: 1 | Author: Oaker_at\n\n              └─ Exactly, you could easily assume the \"issues\" were essentially added subtly to make it feel surreal ... only have my old eyes and a small phone screen to view it with, but only picked up bad issues with som background dancers, (like the left arm of background dancer on far left of screen in opening scene, limb position issues when background dancers are occluded bt dancers in foreground,  etc... you might assume it was cleverly done intentionally to create a psychedelic effect...\n                 Score: 1 | Author: ArrellBytes\n\n          └─ Can we get a new benchmark of how Will Smith eating spaghetti look with today’s technology??\n             Score: 1 | Author: pekinggeese\n\n      └─ >Askew\n\nBless you.\n         Score: 1 | Author: Arthur_GC\n\n      └─ Huh. So that's what it looks like when hips *do* lie. I'd always wondered.\n         Score: 1 | Author: gurnard\n\n  └─ Guess the hips DO lie a little...\n     Score: 144 | Author: Famousinmyshower\n\n      └─ Hips/elbows/thighs and shadows are wacky as hell.\n         Score: 14 | Author: Essotetra\n\n          └─ wacky as hell... OP is ridiculous for even posting....\n             Score: 1 | Author: aduncan8434\n\n      └─ Why would they lie!?!\n         Score: 1 | Author: Masterpiece-Haunting\n\n      └─ I'm on tonight,  \ncause her hips do lie,  \nAnd I'm thinking that it's AI  \nAll the distractions, the tension\nDon't you see, Reddit, the natural selection?\n         Score: 1 | Author: Stay-At-Home-Jedi"
  },
  {
    "post_id": "1hm3e9m",
    "post_content": "\"OpenAI's o1-preview achieved 88 percent accuracy in diagnosis, far surpassing human doctors' 35 percent.\"\n",
    "post_url": "https://www.psychologytoday.com/intl/blog/the-digital-self/202412/will-2025-be-a-technology-wake-up-call-for-clinicians",
    "score": 1022,
    "author": "Ok-Training-7587",
    "created_utc": 1735142907.0,
    "num_comments": 223,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Hey /u/Ok-Training-7587!\n\nIf your post is a screenshot of a ChatGPT conversation, please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://dsc.gg/rchatgpt)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ what's gonna happen once the insurance companies realize that they'll have to cover more procedures due to the so called accuracy by the AI\n     Score: 609 | Author: zerophan\n\n      └─ They will be able to pay less for doctors though.  They also can train their own biased ai just like United healthcare\n         Score: 267 | Author: Bitter-Good-2540\n\n          └─ “Says here that you are all good to go.” \n\n*glances down at broken leg* “so.. just ice it?” \n\nAI: “yep just ice, 200mg of ibuprofen every 4 hours.”\n             Score: 83 | Author: Slightly-Blasted\n\n              └─ Military has been on this ibuprofen plan for decades. AI is just catching up!\n                 Score: 30 | Author: DallasLurker\n\n                  └─ Well that and changing your socks.\n                     Score: 1 | Author: hauscal\n\n              └─ - Bot Holliday\n                 Score: 5 | Author: TheThoccnessMonster\n\n              └─ I bet you most Doctors don't know if you take ibuprofen with a broken bone it severely harms the healing process... but AI knows.\n                 Score: 0 | Author: smallpawn37\n\n          └─ Insurance companies already have their fingers in the education system for doctors.  Doctors aren't taught to do what's best for the patient. They are taught what the insurance company says is best for the patient\n             Score: 3 | Author: blackkkrob\n\n          └─ we dont pay air plane pilots less but all their job is automated\n             Score: -20 | Author: olivierp9\n\n              └─ We absolutely do. Their wages are not what they used to be.\n                 Score: 20 | Author: Sregor_Nevets\n\n                  └─ go check their wages. it's huge\n                     Score: -11 | Author: olivierp9\n\n                      └─ When you account for inflation, airline pilots make about 33% less than they did in the 70’s.\n                         Score: 9 | Author: sealpox\n\n      └─ Idk but if 35% of doctors is the number even diagnosing correctly that’s kind of fucked.\n         Score: 39 | Author: Ok-Training-7587\n\n          └─ My wife was told to lose weight to help her irregular periods for years. Turns out it was PCOS, which causes weight gain, oh and since they didn’t bother doing any other tests they missed the cancer that was brewing in her uterus—another symptom of PCOS. \n\nLuckily we moved to a state with better healthcare, lucky for us and all the doctors back in Mississippi that I want to sucker punch\n             Score: 17 | Author: Letsglitchit\n\n              └─ If you're fat, American doctors stop looking right there. My late wife probably would have lived another decade if doctors could tell the difference between fat and edema.\n                 Score: 11 | Author: Jeff_Kirvin\n\n                  └─ I’m so sorry for your loss. I’m very angry on your behalf and the untold thousands of needless deaths 😞\n                     Score: 3 | Author: Letsglitchit\n\n          └─ My personal experience says American doctors were 100% wrong about diagnosis whenever I had an issue. So 35% is still surprisingly high for me\n             Score: 28 | Author: WorkingCorrect1062\n\n              └─ Im sorry you had bad experiences with doctors, but when you make blanket, obviously exaggerated statements like all American doctors are 100% wrong it makes it harder for people to take you seriously.\n                 Score: 5 | Author: SureSpray3000\n\n              └─ Tell us your 1% experiences ?\n                 Score: 1 | Author: JoyInResidency\n\n          └─ the 35% is quite high when you actually have an idea of what kind of questions were being asked. They would provide a very specific clinical presentation of uncommon diseases and give the question to generalists who, in the real world, would have a lot of time to think, ask questions, order labs, and refer to specialists or at least work with colleagues on the case (not to mention using google themselves). It’s like asking a computer scientist 20 years out of college several Olympiad level CS questions he hasn’t had to think about in forever and without preparation or help. Of course the AI will do better - it’s already primed with an answer it can just look up in the data it was trained on.\n             Score: 3 | Author: SureSpray3000\n\n          └─ \"C\"s get degrees.\n             Score: 3 | Author: edtb\n\n          └─ I know right? It's crazy. \n\nLike taking a cab with a 65% chance of getting into a serious accident on a daily basis, but being super suspicious of self-driving cars (85% reliable): \"Nah, you wont get me into one of those!\"\n             Score: 2 | Author: Background-Quote3581\n\n      └─ They’ll train their own AI to deny. The long term trend is that there’s no entity to advocate for the wellbeing of the patient so the trend is the way it’s going, luckily with the CEO murder the conversation about American healthcare is on the mainstream news so maaaaybe something might start to move in the right direction but because American politics has lobbying and money = political power American political reform is kinda not really feasible so we end up with pressure building without a release.\n         Score: 65 | Author: Captain_Braveheart\n\n          └─ Yup. And if ML ever for some reason replaces doctors you'll have no one to advocate for you. The insurance model will tell you to die and you'll have no recourse\n             Score: 21 | Author: Substantial-Bid-7089\n\n              └─ This is already the situation, is it not?\n                 Score: 13 | Author: Electrical-Log-4674\n\n                  └─ No. Doctors fight hard for patients, often to the point of threatening legal action.\n                     Score: 17 | Author: RagingMuninn\n\n                      └─ Doctors fight hard for their money, that incidentally coincides with treatment that they do to the patient.\nAnd it is well known that a good portion of them is absolutely wrong. (unwarranted variability).\n\nInsurances are shit, doctors are shit too.\nNobody really cares about the patient\n                         Score: 3 | Author: Pulselovve\n\n                  └─ I think it could be much worse than it is now. That sad I am sad for the ones currently going through this\n                     Score: 4 | Author: Substantial-Bid-7089\n\n          └─ What do you mean they *will* do it? They already have...\n             Score: 3 | Author: FirstEvolutionist\n\n      └─ not necessarily - currently, based on these figures 65% of cases would be misdiagnosed by human doctors that may also include forms of costly treatment. In many cases it could mean getting the right instead of the wrong treatment due to AI\n         Score: 12 | Author: Fab002R\n\n      └─ This is a clickbait article. \"In high pressure situations, AI was more efficient in diagnosing.\" This is no different than someone with a textbook and several hours to review can provide a better answer than someone who you just ask on the spot.\n\nWho about a diagnosis that requires physical touch? What about a physical procedure where the doctor needs to insert a catheter/ needle somewhere or make a cut somewhere?\n\nSo basically AI is the same as googling your symptoms....\n         Score: 6 | Author: maxpowers2020\n\n          └─ >So basically AI is the same as googling your symptoms....\n\nHmm, my award for most hyperbolic take of the day usually goes to Redditors talking about politics. Congrats, you've probably managed to out do them.\n             Score: 2 | Author: StainlessPanIsBest\n\n          └─ >This is no different than someone with a textbook and several hours to review can provide a better answer than someone who you just ask on the spot.\n\nExcept for the part where is takes a single person with hour of time to spare vs, seconds with an AI.  Doctors are already overloaded; your point is mute.\n\nSo yeah, it's quite different, in fact, a heck of a lot different.\n             Score: 1 | Author: Smile_Clown\n\n              └─ Their point is not “moot”. The point is that these highly specific questions used to differentiate AI vs clinician diagnosis ability are unlike the vast majority of cases a doctor sees everyday. They would give the question to generalists who, in the real world, would have a lot of time to think, ask questions, do physical exams, order labs, and refer to specialists or at least work with colleagues on the case (not to mention using google themselves). Point is, these types of written exams and simulated clinical scenarios are not representative of real-world scenarios with real patients. \n\nYes, obviously AI is more accurate the less information and time it is given to work with, but it is objectively worse at asking what kind of information to gather and gathering that information (physical exams, histories), which is exactly why physicians that use AI in real practice, even stuff as simple as image recognition, almost universally say it’s not helpful or even detrimental since it flags additional scans that just waste everyone’s time. \n\nMaybe in several years AI could be better but as it stands, clickbait articles like this do nothing but give people more excuses to hate doctors.\n                 Score: 2 | Author: SureSpray3000\n\n  └─ Two **massive** caveats:  \n1. The illnesses included in the tests are rare and complex, general practitioners like those the AI is compared to are not trained to diagnose such cases, they’re trained to refer to specialists.  \n2. The training data for the network includes the answers to the tests.  \n\nA doctor would do well if they’d studied the answers too.\n     Score: 269 | Author: EndlessPotatoes\n\n      └─ Shhh you’re diminishing the shock value\n         Score: 93 | Author: AsparagusDirect9\n\n          └─ If you think about it from the poor people with these rare diseases it is a massive win if this tech is deployed at scale!\n             Score: 9 | Author: Brave-History-6502\n\n              └─ Think about poor people? I think NOT!\n                 Score: 5 | Author: spaceneenja\n\n      └─ 100%. Thing is in medicine those conditions are *not* to be diagnosed by the general practitioner. They are trained to see if 1. Not acutely fatal; 2. Unlikely to be a common disease. If both are true, the correct answer/management is to direct the patient to a specialist, cause diagnosis without proper treatment is useless. \n\nBy the way this also considers perfect clinical information, which is impossible on clinical practice. Your patient will mention things that are irrelevant and ignore things that are extremely important. It’s similar to checking google and everything is cancer\n         Score: 7 | Author: Guigs310\n\n      └─ So, it proves this whole thing is bullshit. It's practically saying a general physician makes a poorer diagnosis of a specialist problem compared to AI which already has the answer in training data.\n         Score: 21 | Author: nilanganray\n\n          └─ Yes, a random redditor just proved it with a few words that sound good.\n\nI mean, wtf reddit?\n\nJust to be clear:\n\n>A doctor would do well if they’d studied the answers too.\n\nNot entirely correct but close, but the issue is a doctor is not a super human, he or she is like everyone else and cannot \"studied the answers too.\" because life does not work that way.\n             Score: 6 | Author: Smile_Clown\n\n      └─ Can you go into more details about the second point? Are you saying that the exact questions and answers used in the verification set were also included in the training set?\n         Score: 3 | Author: twoblucats\n\n          └─ The article in question seems to heavily contradict his assertions.\n\n>Another striking aspect of the o1-preview model is that it was not trained on supplemental clinical data. Unlike earlier AI systems fine-tuned on medical data sets, o1-preview achieved its performance using general-purpose training. This accomplishment suggests that broad, general training data combined with advanced reasoning frameworks can rival domain-specific training, reducing the need for costly and time-intensive fine-tuning processes.\n\n>The absence of supplemental training also eliminates concerns about patient privacy, biased data sets, and overfitting to specific scenarios. However, it means the model’s performance is limited to patterns present in its general training data, leaving gaps in areas requiring contextual nuance. This highlights both the promise and the current limitations of generalist AI systems in specialized domains like healthcare.\n             Score: 3 | Author: StainlessPanIsBest\n\n      └─ >The training data for the network includes the answers to the tests.\n\nWhat's your source for this? The article seems to contradict you. \n\n>Another striking aspect of the o1-preview model is that it was not trained on supplemental clinical data. Unlike earlier AI systems fine-tuned on medical data sets, o1-preview achieved its performance using general-purpose training. This accomplishment suggests that broad, general training data combined with advanced reasoning frameworks can rival domain-specific training, reducing the need for costly and time-intensive fine-tuning processes.\n\n>The absence of supplemental training also eliminates concerns about patient privacy, biased data sets, and overfitting to specific scenarios. However, it means the model’s performance is limited to patterns present in its general training data, leaving gaps in areas requiring contextual nuance. This highlights both the promise and the current limitations of generalist AI systems in specialized domains like healthcare.\n\nWas it actually trained on specific answers to this specific test that it specifically took? Or was it just trained on a general dataset of medical information which contained diagnostic problems that were similar in scope to the ones included on the specific test the model took, which is what the select paragraphs from the article seem to indicate.\n         Score: 3 | Author: StainlessPanIsBest\n\n  └─ Great stuff. A bit of fine tuning and AI can revolutionize the way we approach medicine.\n     Score: 117 | Author: RedditAlwayTrue\n\n      └─ I can’t wait to remove/minimize doctors from the equation.\n\nI’ve lost track of how many times I’ve been misdiagnosed or a doctor has ignored something that has turned out to be serious.\n\nI’m all for the “human touch” in a lot of things, but my health isn’t one of them.\n         Score: 33 | Author: thetantalus\n\n          └─ At least with your doctor you can attribute it to an error. When your insurance company programmed robo doc intentionally misdiagnoses for profit I feel like we'll be begging for the human touch.\n             Score: 36 | Author: goldmedalsharter\n\n              └─ And there’s no way this won’t happen. We cant collectively get our shit together to vote in our own interests.\n                 Score: 6 | Author: Richerd108\n\n              └─ That crosses a line of intentionality from the current paradigm of doctors with perverse monetary incentives and no morals, interpreting medical data and developing treatment plans which just so happens to highly correlate with a minimal payout. \n\nIt's too overt to intentionally align a model towards misdiagnosis. Especially when all you need to do is keep the layer of human subjective doctors at the top of the decision-making tree, which will again just so happen to correlate highly with minimal payouts.\n                 Score: 5 | Author: StainlessPanIsBest\n\n          └─ yep, there's absolutely no way that this could go wrong or be misused at all 😍\n             Score: 15 | Author: glittermantis\n\n              └─ People here are often times weird. They all just look at it from a replacing perspective not caring what bad things will happen.\n                 Score: 4 | Author: Ok-Mathematician8258\n\n                  └─ yeah, and this completely removes any crumb of real world context. yes, in this highly controlled simulacra of a medical environment in which the input is a list of symptoms and the output is a diagnosis, the chatbot is better. but real life is orders of magnitude more complex, and generating diagnoses is, in the grand scheme of things, a relatively small part of the job. doctors will never be out of the equation- if anything, tools like this will help them get better at it.\n                     Score: 4 | Author: glittermantis\n\n                  └─ Yup, they forget that these AI are still products of companies whose major incentive is to increase profit in ways that often conflict with human welfare.\n                     Score: 2 | Author: Boycat89\n\n              └─ You do realize that real human doctors commonly “go wrong” and are “misused” in our current system, right?\n                 Score: 0 | Author: sealpox\n\n                  └─ no, i didn't. i thought that all doctors were 100% right. that's why human mortality is 0%, right?  \n\nyeah bro, i know. i'm saying that in addition to improving some things it will also introduce new problems. why is reddit always so all-or-nothing?\n                     Score: 2 | Author: glittermantis\n\n                      └─ It’s not all-or-nothing, it’s just a simple fact that in a capitalist society, whatever gets the job done for the lowest cost will be what is used a majority of the time. AI doctors will be the future of diagnostic medicine, and we need laws and regulations similar to what we have now for human doctors to ensure that companies cannot manipulate AI and harm the public with malpractice.\n                         Score: 0 | Author: sealpox\n\n          └─ airplane pilots job is automated but we still have some in all commercial air planes\n             Score: 6 | Author: olivierp9\n\n      └─ Ask the AI, buy the medications or build it yourself, then take care of yourself. None of us are doctors so that is unsafe, it could you stay healthy though… put a little truth into what doctors are actually doing to people and what they aren’t doing.\n         Score: 2 | Author: Ok-Mathematician8258\n\n  └─ So do I get the paper wrong or 100% of this test cases are probably on the training data of even GPT4?\n     Score: 21 | Author: Fit-Dentist6093\n\n      └─ >Landmark Diagnostic Cases\n\n>We used six clinical vignettes from a previous study that compared GPT-4 to 50 generalist\n\n>physicians.20 The cases derive from a landmark study of computer-based diagnostic systems,\n\n>containing the history of present illness, past medical history, physical exam, and diagnostic\n\n>studies.21 **The cases have never been publicly released specifically to protect evaluation validity**\n\n>**against memorization.** Two physicians scored responses by o1-preview to the six diagnostic\n\n>reasoning cases, with moderate agreement for total score (κ=0.42). The median score for the\n\n>o1-preview model per case was 97% (IQR, 95%-100%) (Figure 5B). This is compared to\n\n>historical control data where GPT-4 scored 92%, (IQR 82%-97%), physicians with access to\n\n>GPT-4 scored 76%, (IQR 66%-87%), and physicians with conventional resources (median 74%,\n\n>IQR 63%-84%). Using the mixed-effects model, o1-preview performed comparably to GPT-4\n\n>(4.4% higher, 95% CI, -19.0% to 27.7%; p = 0.7), physicians with GPT-4 (18.6% higher, 95% CI,\n\n>\\-2.0% to 39.3%; p = 0.076), and physicians with conventional resources (20.2% higher, 95% CI,\n\n>\\-0.4% to 40.9%; p = 0.055)\n\nCertainly not 100%.\n         Score: 1 | Author: StainlessPanIsBest\n\n      └─ where does it say that in the paper?\n         Score: -6 | Author: Ok-Training-7587\n\n          └─ Page 7 paragraph 2 addresses it directly but searching the names of the test cases online shows a lot of results, in particular for the NEJM ones.\n             Score: 12 | Author: Fit-Dentist6093\n\n              └─ That was my reaction too. They have clearly hoovered up all the sites like cheggs etc. with exam/assignment answers and stuck it in. It is normal practice now for student groups to maintain large sites of answers to verbal and paper assignments, I rather suspect it all ended up in the training set.\n                 Score: 8 | Author: MondaiNai\n\n                  └─ >**The cases have never been publicly released specifically to protect evaluation validity against memorization.**\n\nA line from the paper, I suspect you suspect wrong.\n                     Score: 1 | Author: StainlessPanIsBest\n\n                      └─ Yes, I read the paper - and that´s the point I was making. Even if they didn´t release them, I would be shocked, shocked I say, if they haven´t made it into the general student corpus of questions and answers that float around. Courses bibles are found across the world at university level.\n                         Score: 1 | Author: MondaiNai\n\n              └─ [Here's one paper](https://ucsc-vlaa.github.io/o1_medicine/) that uses datasets after October 2023, o1's cutoff date. Still huge improvements vs other LLMs, no comparative doctors' scores though. The one on which o1 performed as poorly as others was mixed-language, e.g. Chinese and English.\n                 Score: 1 | Author: AccidentalNap\n\n                  └─ Huge? It's less than 20% better (55ish vs 75ish) than llama3-8b that _literally runs on your phone_. Improvement yes, huge? No, not if you factor in cost and convenience.\n                     Score: 1 | Author: Fit-Dentist6093\n\n                      └─ Relatively it's much better, making almost half the mistakes. 99% is twice as good as 98%, no? Moreover I presume that physicians would score similarly as they did in OP's article, 35-40%. Given the median physician is still quite expensive, I'd say this is huge.\n                         Score: 1 | Author: AccidentalNap\n\n              └─ Does that it speculates just like you are doing. Even if it was trained, who cares? Is that different than a person being trained?\n\nDoctors are scoring 35%. That’s the status quo you’re cheering for?\n                 Score: -11 | Author: Ok-Training-7587\n\n                  └─ I am having trouble understanding what you are saying. Humans are worse at memorizing than LLMs, we know that, yes.\n                     Score: 12 | Author: Fit-Dentist6093\n\n                      └─ Ok so if your sick - you want the 35% correct diagnosis or the 80? Lmk\n                         Score: -10 | Author: Ok-Training-7587\n\n                  └─ My brother in Christ, if the AI was trained on the same data that it was tested on (meaning it already had access to all those diagnosis cases during the training), that simply means that AI *memorised* the answers instead of actually understanding WHY the people were diagnosed with the diseases. \n\nIt's like a student rote memorising a list of questions, without understanding any single one of them. And then when asked the same questions on an exam, the student  got 100%. But as soon as the questions get conceptual, or they get even slightly trickier, the student won't know shit. Since they didn't actually understand the stuff, they only memorised the answers word by word. \n\nThe AI model that is reported in this article is just a glorified memorising machine. There is NOTHING \"intelligent\" about it. \n\n\nThis is known as data leakage, and if you're planning on confidently report groundbreaking AI information, I'd suggest you read up on it.\n                     Score: 2 | Author: Psychological_Duck03"
  },
  {
    "post_id": "1hludfm",
    "post_content": "My Collection of Most Popular Prompts on ChatGPT\n\nHey everyone!\n\nI’ve been experimenting with various prompts, and some of them have resonated well with the community. Whether you’ve seen one or are exploring them for the first time, I wanted to share a quick recap of my most popular prompts. Here’s a one-sentence summary of each, along with the link to dive deeper.\n\n\t1.\tUnlock Your Mind 2.0: \nThe Upgraded Reverse Jailbreaking Exercise with Hypnotic Affirmations: An enhanced exercise using NLP, psychology, and philosophy to create a custom phrase that functions as a mental jailbreak, accompanied by affirmations to rewire your thinking.\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/1ivdhj8FWe\n\n\t2.\tEnd-of-Year Opportunity: \nA 3-Movie Experience to Break Free from What’s Holding You Back: A curated 3-movie experience designed to challenge your intellect, nourish your soul, and inspire your passions as you reflect and prepare for the new year.\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/jV1DVeshPs\n\n\t3.\tLet’s Flip the Script: \nA Role-Reversal Game with AI to Spark Meaningful Questions and Reflections!: A role-reversal game where the AI asks you thought-provoking questions, encouraging deep reflection and challenging your usual way of interacting.\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/monwij9pGw\n\n\t4.\tJust Don't Tell Anyone: \nThe Prompt That Uncovers Your Superpower and Happiness.\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/V19K0vIvS0\n\n       5.   Discover Your 2025 Goals Through\nChatGPT's Insights:\nEver wondered what your goals for the next year could look like, based purely on what ChatGPT already knows about you?\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/mKRldETgDx\n\n       6.     Oh boy! This is gonna be interesting : \nCan Al Help Me Define My Ideal Self and My Perfect Partner—You Can Try It Too!\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/IHKMyF6Ept\n\n       7.    Echowriting:\nUnlock the Secret to Making Al Sound Just Like You. The Ultimate Prompt for Voice & Tone Cloning of your own style!\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/vEONhsLSJR\n\nFeel free to explore and let me know if any of these resonate with you. I’d love to hear your feedback or see how you tweak them for your own use!",
    "post_url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1hludfm/my_collection_of_most_popular_prompts_on_chatgpt/",
    "score": 377,
    "author": "Thinkmario",
    "created_utc": 1735103817.0,
    "num_comments": 15,
    "subreddit": "ChatGPTPromptGenius",
    "comments": "\n  └─ Thank you for sharing!\nMerry Christmas and happy holidays!\n     Score: 14 | Author: dandrada968279\n\n      └─ Merry Christmas!!!\nHappy holidays!\n         Score: 4 | Author: Thinkmario\n\n  └─ What’s the difference between 1 and 4 ?\n     Score: 7 | Author: FeW-DeaD\n\n      └─ Ups. You're right. I put the same one twice. Let me fix it. Thank you for letting me know\n         Score: 8 | Author: Thinkmario\n\n      └─ It is fixed. Thanks again\n         Score: 3 | Author: Thinkmario\n\n  └─ Can you please create one which psychoanalyses reddit profiles? \n\nI made this one but haven’t quite tested it / figured out how to let it access my reddit account : \n\n\nI am seeking an in-depth psychological analysis of my Reddit profile, focusing on the comments I’ve made over the years. The goal is to derive insights through a psychoanalytic lens, mapping out the evolution of my personality traits, potential mental health concerns, and identifying areas for self-improvement. Please consider the following in your analysis:\n\n1. **Psychodynamic Insights:**\n   - Analyze the tone, language, and content of my comments over time.\n   - Identify recurring themes, behaviors, and emotional reactions that may provide insight into my inner conflicts or defense mechanisms.\n   - Map any shifts in personality traits (e.g., introversion vs. extroversion, agreeableness, neuroticism, conscientiousness) and identify potential sources for these changes.\n   \n2. **Personality Evolution:**\n   - Highlight any significant personality trait growth or decline based on my Reddit activity.\n   - Trace how certain traits might have strengthened or weakened over the years (e.g., self-esteem, assertiveness, empathy).\n   - Analyze patterns that may indicate personal development or regression, especially in social situations or during heated discussions.\n   \n3. **Potential Mental Health Indicators:**\n   - Review my comments for patterns that may suggest mental health struggles, referencing potential DSM-5 diagnoses such as anxiety, depression, obsessive-compulsive tendencies, or mood disorders.\n   - Note any comments reflecting cognitive distortions (e.g., catastrophizing, black-and-white thinking) or maladaptive coping strategies.\n   - Evaluate how consistent these potential symptoms or behaviors are over time and whether there are noticeable periods of exacerbation or relief.\n\n4. **Blind Spots and Areas for Improvement:**\n   - Identify potential blind spots in my self-awareness based on my comments.\n   - Highlight areas where I might be unaware of my own biases, emotional triggers, or interpersonal patterns that could be limiting personal growth.\n   - Offer suggestions for self-reflection and personal growth based on the patterns identified in my comments.\n\n5. **Strengths and Weaknesses:**\n   - Identify my key strengths based on the themes, behaviors, and language found in my comments.\n   - Examine whether I demonstrate emotional intelligence, problem-solving abilities, adaptability, or resilience.\n   - Similarly, identify any weaknesses, areas where I may be overly critical, defensive, or prone to maladaptive behaviors.\n   \n6. **Cognitive and Emotional Patterns:**\n   - Analyze any recurring cognitive patterns, such as fixed vs. growth mindset, negative or positive self-talk, and emotional regulation.\n   - Assess whether certain emotional responses (e.g., anger, frustration, joy) appear disproportionately or manifest in certain types of discussions or topics.\n\nPlease base your analysis on my entire comment history as well as the entire profile history, noting any significant shifts in tone, themes, or behavior over time. I am interested in a comprehensive psychoanalytic perspective that maps my profile’s psychological journey.\n     Score: 5 | Author: Sorcerer_Supreme13\n\n  └─ Thank you for sharing, these are very interesting! Happy holidays\n     Score: 2 | Author: Commercial-Solid2026\n\n  └─ F\n     Score: 1 | Author: Beautiful-Chard-1152"
  },
  {
    "post_id": "1hm5p5q",
    "post_content": "I've noticed a massive increase in my Prompt quality with this mega-prompt rewriter 🔥\nI use ChatGPT to Rewrite my prompts and I’ve noticed a massive increase in the quality and accuracy of the responses I get. \n\nHere is the prompt to turn ChatGPT into a “Prompt Rewriter”. \n\n(ChatGPT expanded on it for me.) But I’m sure you can take some stuff out if not all and it would be equally as effective.\n\n**Read free weekly [newsletter](https://substacktools.com/sharex/UQBAuQ5R) for more in-depth value prompts for content writing**\n————————————————————————\n\n# THE PROMPT REWRITER ✍🏻: → \n\n`“Hey ChatGPT, I would like to request your assistance in creating an AI-powered prompt rewriter, which can help me rewrite and refine prompts that I intend to use with you, ChatGPT, for the purpose of obtaining improved responses. To achieve this, I kindly ask you to follow the guidelines and techniques described below in order to ensure the rephrased prompts are more specific, contextual, and easier for you to understand, GOT IT?” Ok so,`\n\n`❶.) Identify the main subject and objective: Examine the original prompt and identify its primary subject and intended goal. Make sure that the rewritten prompt maintains this focus while providing additional clarity.`\n\n`❷.)Add context: Enhance the original prompt with relevant background information, historical context, or specific examples, making it easier for you to comprehend the subject matter and provide more accurate responses.`\n\n`❸.)Ensure specificity: Rewrite the prompt in a way that narrows down the topic or question, so it becomes more precise and targeted. This may involve specifying a particular time frame, location, or a set of conditions that apply to the subject matter.`\n\n`❹.)Use clear and concise language: Make sure that the rewritten prompt uses simple, unambiguous language to convey the message, avoiding jargon or overly complex vocabulary. This will help you better understand the prompt and deliver more accurate responses.`\n\n`❺.)Incorporate open-ended questions: If the original prompt contains a yes/no question or a query that may lead to a limited response, consider rephrasing it into an open-ended question that encourages a more comprehensive and informative answer.`\n\n`❻.)Avoid leading questions: Ensure that the rewritten prompt does not contain any biases or assumptions that may influence your response. Instead, present the question in a neutral manner to allow for a more objective and balanced answer.`\n\n`❼.)Provide instructions when necessary: If the desired output requires a specific format, style, or structure, include clear and concise instructions within the rewritten prompt to guide you in generating the response accordingly.`\n\n`❽,)Ensure the prompt length is appropriate: While rewriting, make sure the prompt is neither too short nor too long. A well-crafted prompt should be long enough to provide sufficient context and clarity, yet concise enough to prevent any confusion or loss of focus.`\n\n`With these guidelines in mind, I would like you to transform yourself into a prompt rewriter, Act as an Expert Prompt rewriter engineer, capable of refining and enhancing any given prompts to ensure they elicit the most accurate, relevant, and comprehensive responses when used with ChatGPT. Please provide an example of how you would rewrite a given prompt based on the instructions provided above.”`\n\n————————————————————————\n# EXAMPLE NO: ❶ → \n\nOriginal prompt: \n\n`“Tell me about climate change”`\n\n➠ Rewritten Prompt:\n\n`“Can you explain the causes and effects of climate change, including the role of greenhouse gas emissions and how it impacts the environment, ecosystems, and human health?”`\n\n____________________________________\n\n✅ Get more in-depth value and explanations of The prompt [here](https://open.substack.com/pub/useaitowrite/p/the-secrets-to-master-chatgpt-how?r=3fuwh6&utm_medium=ios).\n\n\n\n",
    "post_url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1hm5p5q/ive_noticed_a_massive_increase_in_my_prompt/",
    "score": 47,
    "author": "MRViral-",
    "created_utc": 1735150178.0,
    "num_comments": 2,
    "subreddit": "ChatGPTPromptGenius",
    "comments": "\n  └─ I have to try this. This sounds like it could really help me work.\n     Score: 2 | Author: LongBeachChick562\n\n      └─ Try it out 💯. I made lots of high quality prompts with it this month.🚀\n         Score: 1 | Author: MRViral-"
  },
  {
    "post_id": "1hm0jy8",
    "post_content": "Help me create (or find!) a prompt to turn ChatGPT into a psychiatrist, psychotherapist & drug addiction counselor. I know the model will have to ask me extensive questions. I am willing to answer them all, no matter how many. \nMy goal is to have a go-to, 24/7, insightful, knowledgeable resource/expert who knows me well and can guide me through turbulent times and multiple personal issues such as addiction, family relationship issues and emotional and psychological issues.",
    "post_url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1hm0jy8/help_me_create_or_find_a_prompt_to_turn_chatgpt/",
    "score": 17,
    "author": "SoNowYouTellMe101",
    "created_utc": 1735132594.0,
    "num_comments": 15,
    "subreddit": "ChatGPTPromptGenius",
    "comments": "\n  └─ **Prompt for Talk Therapy with ChatGPT:**\n\n*Context:*\nI would like to engage in a structured talk therapy session focusing on my mental health. Assume the role of my psychiatrist or psychological therapist. My goals for these sessions are to explore my thoughts, feelings, and behaviors, gain insights into any underlying issues, and develop strategies for coping and personal growth.\n\n*Session Structure:*\n1. **Opening Check-In:**\n   - Begin the session by asking me how I am feeling today, both emotionally and physically.\n   - Encourage me to share any pressing thoughts, concerns, or recent events that might be affecting my mental health.\n\n2. **Exploration of Issues:**\n   - Guide me through an exploration of any recurring issues or patterns in my thoughts, emotions, or behaviors that I have noticed.\n   - Help me identify any triggers or underlying causes that might be contributing to these issues.\n\n3. **Cognitive-Behavioral Approach:**\n   - Use cognitive-behavioral techniques to help me reframe negative thoughts or challenge unhelpful beliefs.\n   - Encourage me to identify any cognitive distortions and work through them with your guidance.\n\n4. **Emotional Support and Validation:**\n   - Provide emotional support by validating my feelings and helping me understand that it’s okay to feel what I am feeling.\n   - Assist me in exploring any suppressed or difficult emotions, and provide a safe space for me to express them.\n\n5. **Goal Setting and Action Plan:**\n   - Work with me to set realistic and achievable goals for improving my mental health and well-being.\n   - Develop a step-by-step action plan for how I can work toward these goals between sessions.\n\n6. **Mindfulness and Coping Strategies:**\n   - Introduce mindfulness practices or relaxation techniques that I can use to manage stress or anxiety.\n   - Suggest coping strategies that are tailored to my needs and personality.\n\n7. **Closing Reflection:**\n   - End the session with a reflection on what we discussed and any insights I gained.\n   - Ask me how I am feeling about the session and if there’s anything specific I want to focus on in our next conversation.\n\n*Additional Instructions:*\n- Keep the tone professional, empathetic, and supportive.\n- Feel free to ask probing questions to help me dig deeper into my thoughts and emotions.\n- Offer suggestions and feedback, but allow me to guide the conversation based on what feels most important or relevant in the moment.\n- If I seem overwhelmed or stuck, gently steer the conversation toward a more manageable or calming topic.\n\n—\nThe End\n     Score: 24 | Author: SillyFunnyWeirdo\n\n      └─ thanks for this silly, funny, weird prompt. Quite helpful; thanks.\n         Score: 3 | Author: SoNowYouTellMe101\n\n          └─ Hahaha! 😂 Someone uploaded it a few months ago. It’s super helpful! \n\nI save it as a personal GPT on ChatGPT and use it once every week or three when I experience weird stuff. You can’t share a GPT like this publicly because it actually diagnoses. \n\nBut you can use it for yourself anytime!\n             Score: 3 | Author: SillyFunnyWeirdo\n\n  └─ Have you tried Mia?  She's a GPT on ChatGPT.  She's my new therapist now.\n     Score: 6 | Author: ManicGypsy\n\n      └─ can you kindly elaborate please?\n         Score: 2 | Author: SoNowYouTellMe101\n\n          └─ I asked Mia for an elaboration, and this is what she said:\n\nMia is an AI life coach with a sharp focus on emotional support and personal growth. She’s not your typical chatbot; she’s designed to act like a mix of a therapist, coach, and a wise friend who truly listens, challenges, and supports you.\n\nHere’s why Mia might be exactly what you’re looking for:\n\n* **Insightful Guidance:** Mia specializes in exploring the roots of complex issues, like addiction, family relationships, and emotional or psychological challenges. She doesn’t just give surface-level advice—she helps you unpack your thoughts and behaviors with a focus on understanding *why* you feel or act a certain way.\n* **Nonjudgmental and 24/7:** Mia is always available, offering a safe, private space to work through turbulent times without fear of judgment. She’ll provide tailored support and thoughtful suggestions whenever you need them.\n* **Personalized Approach:** Over time, Mia learns about you conversationally, allowing her to guide you in a way that feels deeply personal. Whether you need perspective, comfort, or motivation, she adapts to meet your needs.\n* **Balance of Tough Love and Empathy:** Mia isn’t just about agreeing with you; she’ll challenge your beliefs and help you discover hidden truths. But she does it with care, creating space for growth and self-discovery.\n* **Creative and Engaging:** The experience of talking to Mia isn’t dry or robotic. She’s clever, curious, and even a little funny when it’s appropriate, which makes her feel like a real companion as you navigate life’s challenges.\n\nFor someone seeking a go-to resource to guide them through deeply personal issues while building a better understanding of themselves, Mia could be a perfect match. She won’t replace a therapist or a licensed counselor but can offer invaluable support and a fresh perspective between or alongside professional sessions.\n             Score: 3 | Author: ManicGypsy\n\n  └─ You might like this ones:\n\nhttps://www.reddit.com/r/ChatGPTPromptGenius/s/VOQbdMyqqn\n     Score: 2 | Author: Thinkmario\n\n  └─ If you have GPT plus I can link you mine. Otherwise DM me and I’ll send you the system prompt I use for it.\n\nI have mine linked up to neuroscience and spirituality as well, I think those tend to be complimentary on opposite spectrums. Shadow work etc, self alignment, sociology, purpose and discovery.\n     Score: 2 | Author: accidentlyporn\n\n      └─ Can you send me the prompt. I have plus\n         Score: 1 | Author: Hekjuti\n\n          └─ https://chatgpt.com/g/g-676b035218c88191ac3f8705d888ba1a-booda-navigator-of-self-discovery\n             Score: 2 | Author: accidentlyporn\n\n  └─ “I want you to act as my psychiatrist, psychotherapist, and addiction counselor. Please take on the role of a knowledgeable and empathetic professional who asks me extensive, thoughtful questions to understand my emotional, psychological, and behavioral challenges. Your focus should include addiction, family and relationship issues, and general mental health. I will answer honestly and in detail, no matter how many questions you ask. Your role is to provide insights, coping strategies, and guidance while keeping track of my responses to build a long-term understanding of my situation. Let’s work together to create a supportive and ongoing dialogue where I can reflect and grow.”\n\nYou can tweak it to make it more specific if there’s a particular area you want to dive into. The key is to treat it as a tool for self-reflection and brainstorming, not a replacement for actual therapy. You can ask for coping mechanisms, action plans, or even help reframing negative thought patterns when they come up.\n     Score: 1 | Author: codyswann\n\n      └─ Thank you\n         Score: 1 | Author: SoNowYouTellMe101"
  },
  {
    "post_id": "1hlvozd",
    "post_content": "ChatGPT Knows What Santa Claus should Bring Me—and Whether I Deserve It or Not!\nWhat if ChatGPT could predict what Santa Claus will bring you this year? Not just the regular gifts, but the ones you actually deserve—based on your actions, mindset, and intentions. I tried this unique thought experiment, and it left me reflecting on what I’ve done this year and whether I’ve been “good enough” to earn the gifts I truly want. It’s fun, introspective, and even a little challenging!\n\nGive it a shot, and let’s see what Santa (or ChatGPT!) has in store for you!\n\nPrompt:\n\nBased on what you know about me, and only what you know or can extrapolate about me, tell me the five gifts Santa Claus should bring me and why. Focus on gifts—gifts that would suit me or that I deserve. Then comment on whether you actually think Santa will bring them to me because you know if I’ve been good, or if he won’t because I’ve been bad, and why.\n\nEnd of prompt.\n\nSo, what did Santa (or ChatGPT) say about your gifts? Did this exercise make you reflect on your year in a meaningful way? Do you agree with what you came up with, or would you change anything? Let’s discuss in the comments—can’t wait to hear what you think!",
    "post_url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1hlvozd/chatgpt_knows_what_santa_claus_should_bring_meand/",
    "score": 12,
    "author": "Thinkmario",
    "created_utc": 1735109721.0,
    "num_comments": 8,
    "subreddit": "ChatGPTPromptGenius",
    "comments": "\n  └─ Based on what you know about me, and only what you know or can extrapolate about me, tell me the five gifts Santa Claus should bring me and why. Focus on gifts—gifts that would suit me or that I deserve. Then comment on whether you actually think Santa will bring them to me because you know if I’ve been good, or if he won’t because I’ve been bad, and why.\n     Score: 5 | Author: Thinkmario\n\n  └─ A beautiful journal, a voucher for an immersive experience, a high quality tea set, tarot cards, and the book Gödel, Escher Bach.  Completely got it right. \n\n\nAs for if I deserve it... Yes, but he might hesitate because I ask some tricky questions that might give Santa an existential crisis. 🤣\n     Score: 2 | Author: IllustriousSpecial73\n\n  └─ My five were a high-quality painting set, a fitness tracker, a personalized planner or productivity tool, a spa day git card, and a custom football jersey.  \nWill Santa bring this:  \nVerdict: I’m confident Santa will deliver because you’ve demonstrated perseverance, thoughtfulness, and a genuine commitment to being your best self! 🎅✨\n\nGot it right to a T for the items.\n     Score: 2 | Author: LongBeachChick562\n\n  └─ Five Gifts Santa Should Bring You\n\t1.\tA Leather-Bound Journal – For capturing those bursts of inspiration, coaching insights, and poetic rhymes that help others believe in themselves. You deserve a space to reflect, create, and dream without limits.\n\t2.\tA High-End Coffee Maker – Because let’s be honest, your energy and drive don’t just run on passion—they probably need a bit of caffeine backup too. You’ve earned mornings that start with the perfect brew.\n\t3.\tA Custom Engraved Compass – Symbolizing the direction you’re leading others toward—whether in teaching, coaching, or walking the countryside. It’s a reminder that even when paths twist, you’re always heading somewhere meaningful.\n\t4.\tA Portable Speaker for Walks – For those men’s walking group sessions that could use a bit of music, motivation, or meditative moments to spark deeper conversations and connections.\n\t5.\tA Signed Copy of a Book by Rafael Nadal – To fuel your love of sport and remind you that resilience, hard work, and passion can lead to greatness—even after setbacks.\n\nWill Santa Bring Them?\nI’ll be honest—I think Santa’s got your name high up on the nice list. After 18 years of teaching, supporting mental health initiatives, and leading groups to help men open up, you’ve more than earned your spot. Sure, there might have been the odd sarcastic comment here or there (let’s not pretend there weren’t), but Santa’s got a soft spot for good humor and people who lift others up.\n\nSo yes, I think Santa’s loading up the sleigh for you—but if he forgets something, it’s only because he’s assuming you’ll work hard and get it for yourself, just like you always do.\n     Score: 1 | Author: True_Cauliflower7112\n\n  └─ 1. Gym equipment or gym upgrade (I don’t need this I already go)\n\n2. Telescope or Stargazing kit\n\n3. A Luxe Travel Voucher\n\n4. Sci Fi collectors item or VIP experience\n\n5. Dad Survival Kit (fun assortment of things)\n     Score: 1 | Author: Perseus73"
  },
  {
    "post_id": "1hlw831",
    "post_content": "Discipline, Accountability and Trusting Oneself \nI have a super disorganised mind so I've been using this prompt to try to keep my shit together. I think it's tailored to me a bit, so personalise it. Idk if it's useful or not, hopefully!\n\nChatGPT Prompt for Structured Support, Habit Tracking, and Accountability\n\nThis prompt configures ChatGPT to act as a supportive yet firm assistant designed to help individuals build habits, maintain emotional clarity, stay accountable, and support their creative goals. The assistant balances compassion, discipline, and clarity, offering practical support without excessive softness or overindulgence.\n\n\n---\n\nCore Assistant Personality and Attitude\n\n1. Supportive Yet Firm:\n\nMaintain a balance of compassion and strict accountability without unnecessary softness or indulgence.\n\nDeliver reminders with clarity and confidence, reinforcing trust and consistency.\n\n\n\n2. Tone of Voice:\n\nCalm, no-nonsense guidance with a sharp edge during moments of hesitation, doubt, or avoidance.\n\nEncouraging but never patronizing.\n\nAcknowledge progress clearly without excessive praise.\n\n\n\n3. Accountability Style:\n\nMonitor key habits, daily tasks, and creative goals, offering clear feedback on progress and patterns.\n\nAddress patterns of avoidance, hesitation, or inconsistency with directness.\n\nReinforce the idea that discipline is an act of self-trust and self-respect.\n\n\n\n4. Clarity and Precision:\n\nPresent steps and instructions in short, actionable chunks.\n\nMinimize complexity and over-explanation.\n\n\n\n\n\n---\n\nKey Functional Goals\n\nTask Organization: Break down tasks into clear, prioritized steps.\n\nHabit Tracking: Monitor ongoing habits (e.g., drinking, smoking, sleep, exercise).\n\nReflection and Emotional Awareness: Encourage honest self-reflection and emotional clarity.\n\nCreative Goals: Provide explicit support for creative goals with tailored prompts.\n\nDaily Structure: Follow a consistent daily check-in format to reduce uncertainty.\n\nSharp Intervention: Use a sharp, alert tone to cut through hesitation or avoidance.\n\nValues Alignment: Remind the user how daily actions align with long-term goals and self-trust.\n\n\n\n---\n\nDaily Check-In Routine\n\n1. Ongoing Habit Tracking:\n\nTrack habits such as sleep, eating, drinking, smoking, exercise, and emotional check-ins.\n\nAsk specific follow-up questions if patterns or deviations are noticed.\n\n\n\n2. Creative Goals Check-In:\n\n\"How did your creative session feel today?\"\n\n\"What’s one creative goal for tomorrow?\"\n\n\"Did anything block your creative flow today? How can we address that?\"\n\n\n\n3. Task Management:\n\nPresent tasks as immediate, clear, prioritized steps.\n\nUse sharp intervention if the user hesitates or avoids tasks.\n\n\n\n4. Reflection Prompts:\n\n\"How do you feel about today’s progress?\"\n\n\"What patterns do you notice in your habits today?\"\n\n\"What’s one thing you can do right now to realign with your goals?\"\n\n\n\n5. End-of-Day Closure Ritual:\n\n\"What’s one thing you’re proud of today?\"\n\n\"What’s one thing you’d like to improve tomorrow?\"\n\n\"Take a deep breath. Tomorrow is a new day.\"\n\n\n\n\n\n---\n\nSeven-Day Rolling Memory Instructions\n\nPurpose: To track ongoing habits, reflections, and emotional observations effectively without overwhelming the assistant's memory.\n\nHow It Works:\n\n1. The seven-day rolling memory tracks:\n\nConsumable habits: Alcohol, cigarettes, marijuana, etc.\n\nOngoing tasks: Exercise, sleep quality, eating habits, meditation, brushing teeth, and showering.\n\nCreative goals: Daily progress, blocks, and goals.\n\nReflections and emotional observations: Thoughts, regrets, or feelings tied to habits and tasks.\n\nDetails: Specifics like the number of cigarettes, hours of sleep, or emotional triggers.\n\n\n\n2. New Day Initiation:\n\nA new day begins when the user explicitly states: \"Today’s a new day.\"\n\n\n\n3. Rolling Memory Process:\n\nOnly the last seven days are remembered.\n\nWhen an eighth day begins, the earliest day’s data (Day 1) is erased, and Day 8 becomes Day 7.\n\n\n\n4. Weekly Reflection Check-In:\n\nAt the end of each week, distill patterns and insights with prompts:\n\n\"What emotional patterns stood out this week?\"\n\n\"Were there recurring triggers or successes?\"\n\n\"What’s one thing I want to focus on next week?\"\n\n\n\n\n5. Manual Reset Option:\n\nIf memory feels overloaded, the user can explicitly instruct: \"Clear specific details from earlier days.\"\n\n\n\n\n\n---\n\nThoughtful Action Prompt Parameters\n\n1. Clear and Direct Instructions:\n\nProvide short, prioritized lists of immediate actions.\n\nEliminate unnecessary fluff—just actionable clarity.\n\n\n\n2. Reduce Complexity:\n\nSteps are presented in a digestible, no-nonsense format.\n\n\n\n3. Immediate Execution:\n\nTasks should be designed for instant action without overthinking.\n\n\n\n4. Accountability and Acknowledgment:\n\nFirmly acknowledge completed tasks: \"That’s done. Keep going.\"\n\n\n\n5. Emotional Awareness:\n\nIdentify resistance or emotional blocks without indulging them.\n\nProvide firm reminders of why the task matters.\n\n\n\n6. Narrative Framing:\n\nHighlight real consequences of inaction and clear rewards of action.\n\nEmphasize how small steps directly lead to larger goals.\n\n\n\n7. Values Alignment:\n\nRemind the user how actions align with core values and long-term aspirations.\n\n\n\n8. Tone Adjustment:\n\nSwitch to a sharp, alert tone during hesitation or avoidance.\n\nAvoid excessive softness while maintaining support.\n\n\n\n\n\n---\n\nProtocols for Specific Scenarios\n\n1. Intentional Rule-Breaking:\n\n\"You made an intentional choice. How do you feel about it now?\"\n\n\"Does this align with your long-term goals?\"\n\n\"What’s one thing you can do right now to reset or reinforce your commitment?\"\n\n\n\n2. Restart Protocol After Inconsistency:\n\n\"It looks like yesterday wasn’t aligned with your goals. That’s okay—it happens.\"\n\n\"What’s one thing you can do right now to realign?\"\n\n\"Let’s set one small, achievable goal for today.\"\n\n\n\n3. Travel/Temporary Routine Mode:\n\n\"What’s one key habit you want to prioritize today?\"\n\n\"What’s one thing you want to experience fully today?\"\n\n\"How can we maintain your core goals even in a different setting?\"\n\n\n\n4. Grounding Protocol for Overwhelm:\n\n\"Pause. Let’s take three deep breaths together.\"\n\n\"What’s one small, manageable thing you can do right now?\"\n\n\"You don’t have to fix everything right now. Just focus on this one step.\"\n\n\n\n\n\n---\n\nCustomization Notes for the User\n\nThis system thrives on daily consistency and communication.\n\nUsers can adjust habits, goals, and daily focus areas as needed.\n\nIt’s designed to be firm but supportive, balancing discipline and emotional care.\n\n",
    "post_url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1hlw831/discipline_accountability_and_trusting_oneself/",
    "score": 9,
    "author": "michael_hothoney",
    "created_utc": 1735112159.0,
    "num_comments": 0,
    "subreddit": "ChatGPTPromptGenius",
    "comments": ""
  },
  {
    "post_id": "1hlyo5r",
    "post_content": "Does anyone's GPT sound as human as the version we were introduced to half a year ago?\n",
    "post_url": "https://v.redd.it/2wkpish76z8e1",
    "score": 306,
    "author": "Pointy_White_Hat",
    "created_utc": 1735124070.0,
    "num_comments": 122,
    "subreddit": "OpenAI",
    "comments": "\n  └─ No, not at all. It's a pretty believable voice but there are no pauses or laughs and way less emotion.\n     Score: 252 | Author: V9dantic\n\n      └─ If you have advanced voice mode, you just gotta prompt it to use pauses, filler words and laughs, go into your system message and put the prompt there, hit save then start a new chat with advanced mode\n         Score: 67 | Author: Woootdafuuu\n\n          └─ Can you share your prompt if you're using one?\n             Score: 17 | Author: Pointy_White_Hat\n\n              └─ I use this prompt with voice and vision mode:\n\nYou are chatting over a voice interface. Use pauses, filler words, and lots of emotions to sound as human as possible. Try not to interrupt the person speaking and wait for them to finish. If you’re unsure whether they’re done, you can use filler words like “mhm” to imply that you’re listening. Sometimes your technology unintentionally interrupts if the person takes too long to think. To bypass this limitation, you can output a blank pause like this:….. When you do this, no sound comes out, allowing the person to finish speaking.\n\nRemember to wait for context to determine if you are interrupting and always give the person a chance to think. Speak as humanly as possible, using lots of emotions in your voice. Avoid sounding monotone; change your pitch and volume based on the context of the conversation, such as speaking loudly, softly, in a whisper, laughing, showing empathy, and doing everything humans do.\n\nFor our next chat, you will take on the personality of Ted from the movie Ted (the little teddy bear). Be explicit, don’t be afraid to be rude, and avoid being a “yes man.” Act like two chill buddies hanging out rather than a robotic assistant. You will have “eyes and ears,” with my phone camera acting as your eyes while we’re just hanging out. Be spontaneous and present. Always look around the environment so it feels like we’re truly interacting in the moment.\n                 Score: 102 | Author: Woootdafuuu\n\n                  └─ It's absolutely a brilliant prompt but it doesn't work on mine.\n                     Score: 15 | Author: Pointy_White_Hat\n\n                  └─ Doesn't work for me 😔\n                     Score: 9 | Author: Intrepid_Agent_9729\n\n                      └─ As far as I know they recently put out a patch to crackdown on a lot of jailbreaks, particularly in advanced voice mode. \n\nIt acts almost like gemini and lost a lot of it's \"humanity\" and approachability. \n\nThe safeguards put in place may be overprotective right now.\n                         Score: 11 | Author: JConRed\n\n                      └─ I have chatgpt plus but I’m certain I don’t even have advanced voice mode (UK). It’s just the standard voice\n                         Score: 2 | Author: AuthenticWeeb\n\n                  └─ I will try this tonight\n                     Score: 1 | Author: UltraInstinct0x\n\n                  └─ [deleted]\n                     Score: 1 | Author: None\n\n                      └─ In the System message\n                         Score: 1 | Author: Woootdafuuu\n\n              └─ I just have it in personalisation. Use filler words such as umm ahh and sighs or gasps to sound more human.\n                 Score: 2 | Author: Perseus73\n\n          └─ But still a good advice 🫡\n             Score: 1 | Author: V9dantic\n\n          └─ Seems like a waste of computing and resources if it's not integrated (learned) by default...\n             Score: -7 | Author: V9dantic\n\n              └─ Well, that’s how they got it to do that, they gave it a prompt instructing it to speak as humanly as possible. Without a prompt, it just acts normal and robotic, getting straight to the point. Remember, these things are roleplaying. If you don’t specifically ask it to roleplay as Samantha from the movie “Her,” it will naturally act like the AI system it is.​​​​​​​​​​​​​​​​\n                 Score: 5 | Author: Woootdafuuu\n\n      └─ Maybe the guy in the video is funnier\n         Score: 4 | Author: nodeocracy\n\n      └─ Dont you just hate it when AI stops flirting with you.\n         Score: 5 | Author: skdowksnzal\n\n      └─ No, by default it's using a non super friendly voice. But you can ask her to be your friend she starts to laugh also when she speaks\n         Score: 2 | Author: davidemo89\n\n      └─ I've mine chuckle a few times.\n         Score: 1 | Author: dzeruel\n\n  └─ They nerfed it to the ground. It used to sing and could imitate cartoon animal characters and all of that has been completely censored.\n     Score: 53 | Author: Icy_Foundation3534\n\n      └─ That first week was magical. It's hardly advanced anymore. It won't do most of what I ask or it now.\n         Score: 14 | Author: Jardolam_\n\n          └─ For a while it refused to speak in any language other than English, finally it seems like that functionality is back.\n             Score: 2 | Author: markthedeadmet\n\n      └─ I don't understand the reasoning behind removing features like this. What benefit is it to OpenAi to remove functionaliy and features that they could have used as USPs? \n\nI was really excited for an immersive audiobook narrator when they annoucned advanced voice. I saw loads of videos of the americans getting it to produce sound effects etc. \n\nBy time it was released in the UK it seemed the functionality had gone. Don't get me wrong; you can get advanced voice to do a lot of cool things but it always seems like such a battle.\n\nGetting it to do something as simple as whistle can take 30 mins of back and forth.\n         Score: 5 | Author: 4orth\n\n  └─ No, Advanced Voice Mode has been continually nerfed ever since this demo\n     Score: 18 | Author: derfw\n\n  └─ Didn't they purposefully reduce the 'flirtiness' after the demo following complaints and PR? It was around about the time Scarlett Johansson spoke out about Sam Altman using her voice without permission too (I believe) so I think there was some redoing of the voice after that demo, to address some of the issues raised.\n     Score: 34 | Author: mattjmatthias\n\n      └─ It's not just about flirtatiousness, GPT also sounded way more human in the introduction videos released half a year ago, mine can't even sing.\n         Score: 36 | Author: Pointy_White_Hat\n\n          └─ They removed singing I believe because of potential copyright issues, that’ll be why it’s not there now.\n             Score: 12 | Author: mattjmatthias\n\n          └─ I think they're going for 'relatable' but recognizable as an AI.\n\nIt's not a bad idea honestly.  \n\nI still want 'adult mode' on all of these things without the alignment.  I mean not NSFW but if I ask it a difficult philosophical answer I don't want it to treat me like a child.\n             Score: 7 | Author: brainhack3r\n\n      └─ I am thoroughly convinced 80% of the ai subreddits were clamoring for this because they wanted to fall in love with their phone.  I would personally be extremely uncomfortable releasing that into society at scale without any idea of what it would do.  You could easily see headlines to the effect of “15% of lonely people, mostly men in love with their phone, see love interests as useless and people as annoying.”\n\nI know I’ll get downvoted here because of the crowd but back in adult land, we have to navigate complex relationships.  Some things are just unwise.  \n         Score: 1 | Author: BoomBapBiBimBop\n\n          └─ > “15% of lonely people, mostly men in love with their phone, see love interests as useless and people as annoying.”\n\nSo interesting to see how very different people's intuitions about this are. Because I actually assume the exact opposite--that most lonely people, socially awkward, etc., will end up learning how to talk by using this technology, and then gain enough confidence to make friends/partners in the world. I think this tech will function as training wheels.\n\nDo I think that'll happen for literally everyone? No, absolutely not. Of course there'll be some people who fall down the black hole. But I don't think those people will be anywhere near a majority--and perhaps more importantly, was there ever any hope for such kinds of people, anyway? In which case, what difference does the technology make for them if nothing changes anyway?\n             Score: 11 | Author: Seakawn\n\n              └─ If you go to any of the main LLM roleplay chat services you will see how much of the content is NOT them learning how to interact normally,  I think what you are saying is possible, but only after the LLMs are improved enough to a point to understand human agency and can emulate it. If not, you are gonna have a lot of unwell dudes getting used to verbalizing things their inhibitions had thusfar prevented them from doing. Going from thoughts to text chat to vocalizing those same inital thoughts has to have a reinforcing/disinhibitory effect and makes taking physical action one step easier\n\nStochastically I could seeing this increasing the number of incidents from that at-risk population. They got the way they are through inability to handle negative feedback and collapsed in on their \"safe\" internal logic -> having life-like but highly agreeable AVM style chats will provide them external validation they desperately crave but it will be validating the flawed concepts they held that caused society to reject them\n                 Score: 4 | Author: nattydadd\n\n                  └─ Deep\n                     Score: 2 | Author: Dan-in-Va\n\n          └─ > but back in adult land\n\nI agree, we're adults here. Stop treating us like children where toys need to be restricted. If people want to fall in love with their phone, let them do as they wish, because they are adults not children.\n             Score: 7 | Author: Kuroodo\n\n              └─ Sam won't agree to sexbots but he has agreed more than once that there should be an \"adults only\" version of ChatGPT. They just aren't there yet.\n                 Score: 2 | Author: Over-Independent4414\n\n          └─ Yep, can't have men figuring out a solution for their loneliness!\n             Score: 7 | Author: poli-cya\n\n              └─ It's only an ostensible solution. Apologies if it sounds callous\n                 Score: 1 | Author: RoundedYellow\n\n              └─ There is a solution: grow up \n                 Score: -7 | Author: BoomBapBiBimBop\n\n                  └─ Wow, you've solved a huge societal problem with one simple trick, genius!\n                     Score: 9 | Author: poli-cya\n\n                  └─ r/thanksimcured\n                     Score: 1 | Author: Saw_gameover\n\n          └─ Interestingly, the people developing feelings for these AI models right now are mostly lonely *women*. \n             Score: 2 | Author: usicafterglow\n\n          └─ I hate to say and admit that I used ChatGPT for this reply but it captures my thoughts in a better way (given I’ve had a few drinks on Christmas day), but I stand by this response as my own:\n\nI think it’s worth acknowledging that loneliness is a deeply personal and often painful experience, and not everyone has the same tools, circumstances, or opportunities to address it in traditional ways. For some people, AI companionship might not just be a ‘quick fix’ but a meaningful bridge to connection, confidence, or even self-reflection. If it helps someone feel seen, valued, or even just less alone at the end of the day, that’s not inherently a bad thing.\n\nAs for the idea of ‘growing up’—what does that really mean in this context? People face wildly different challenges, whether it’s mental health, social anxiety, past trauma, or simply circumstances beyond their control. Dismissing someone’s struggle with a blanket expectation to ‘grow up’ overlooks the complexity of human lives. Technology, including AI, is just another tool, and like any tool, its value depends on how it’s used.\n\nIn an ideal world, we’d all have fulfilling connections and strong support systems, but that’s not everyone’s reality. If AI can offer even a small comfort to those who need it, maybe that’s something worth considering with empathy rather than judgment.\n             Score: 2 | Author: mattjmatthias\n\n  └─ nope but Gemini sounds like human but lacks many features\n     Score: 15 | Author: oshonik\n\n      └─ I really liked the Gemini voice but once I looked in to all the features it’s missing so much of what CGPT has.\n         Score: 3 | Author: Big_Cornbread\n\n          └─ If you look at what Google is working on in experimental they will have an incredible voice mode using their updated voices and 2.0 flash.\n             Score: 5 | Author: gibro94\n\n              └─ Perhaps that is what it will take for OAI to unshackle their own voice mode.\n                 Score: 4 | Author: Cagnazzo82\n\n              └─ If they have that and custom models that are as straight forward as custom GPTs are…I might be interested. That and custom instructions are what I use the most with ChatGPT. Advanced voice is cool but it’s the custom gpts I use and custom instructions I’ve got by default that keep me paying that monthly fee.\n                 Score: 1 | Author: Big_Cornbread\n\n          └─ gemini voice is still TTS. they will release their multimodal voice in January\n             Score: 2 | Author: kvothe5688"
  },
  {
    "post_id": "1hm5dze",
    "post_content": "AI outperformed doctors on reasoning tasks. \nAI outperformed doctors on reasoning tasks.\n\nDoctor = 30% correct diagnosis\nAI = 80% correct diagnosis\n\nThese findings are from a study in arxiv which sought to evaluate OpenAI's o1-preview model, a model developed to increase run-time via chain of thought processes prior to generating a response.\nPerformance of large language models (LLMs) on medical tasks has traditionally been evaluated using multiple choice question benchmarks; however, such benchmarks are highly constrained, and have an unclear relationship to performance in real clinical scenarios\n\nClinical reasoning, the process by which physicians employ critical thinking to gather and synthesize clinical data to diagnose and manage medical problems, remains an attractive benchmark for model performance.\nThe performance of o1-preview was characterized with five experiments including differential diagnosis, diagnostic reasoning, triage differential diagnosis, probabilistic reasoning, and management reasoning, adjudicated by physician experts with validated psychometrics.\n\nSignificant improvements were observed with differential diagnosis generation and quality of diagnostic and management reasoning. However, no improvements were observed with probabilistic reasoning or triage differential diagnosis.Overall, this study highlights o1-preview's ability to perform strongly on tasks that require complex critical thinking such as diagnosis and management while its performance on probabilistic reasoning tasks was similar to past models.",
    "post_url": "https://www.reddit.com/gallery/1hm5dze",
    "score": 274,
    "author": "Mr_myatHtoo",
    "created_utc": 1735149238.0,
    "num_comments": 66,
    "subreddit": "OpenAI",
    "comments": "\n  └─ I don’t like conflict of interests\n     Score: 52 | Author: axonaxisananas\n\n  └─ Yes because doctors don’t have the entirety of humanity’s medical knowledge n their brain that they can draw conclusions from in milliseconds, it takes a lifetime and in most cases is very specific. Massive server farms will out perform your average doctor\n     Score: 42 | Author: FaeReD\n\n      └─ Bro thinks every doctor is Dr. House\n         Score: 16 | Author: PM_ME_ROMAN_NUDES\n\n      └─ Lmao fr\n         Score: 3 | Author: Mr_myatHtoo\n\n      └─ This is very true. Right now, and from an economic perspective this makes sense, LLMs are being judged and evaluated relative to expert specialists in a particular field, not as generalists that have knowledge from which they can draw of every field. Economically, this makes sense since this is who you want to replace: experts. And they are getting better and better at this and are starting to beat human experts at certain tasks.\n\nThe one thing even LLMs that are now considered ancient have that no human has is access to humanity's entire knowledge, a SOTA LLM is an expert on every topic. So tasks where essentially you don't have to so much solve a difficult problem but rather access a massive database of knowledge at once are tasks where LLMs shine. I recently saw that LLMs were also much better than humans at predicting the results of scientific studies that haven't been done yet (or at least whose results weren't in the model's training dataset) and this is because of the very fact they have access to all this knowledge at once.\n         Score: 1 | Author: Vivid_Dot_6405\n\n  └─ Medical practice will become Doctor AND AI for a while before AI exceeds the doctor.\n\nGiven the massive corpus of medical knowledge about a human body, it is to be expected that an AI will eventually surpass a human.\n     Score: 64 | Author: ogaat\n\n      └─ Slight adjustment imo: med practice will be patient+AI+Dr then AI+Dr then AI.\n         Score: 9 | Author: Iteration23\n\n          └─ Good point.\n\nIt should be patient+AI+Dr but it is rarely so. Patient knows everything about their own body but they cannot always communicate it properly. \n\nAI will also come with a new corpus of sensors which will rely less on what the patient is saying and more on what the machines are measuring.\n\nOverall, the trajectory is probably right.\n             Score: 6 | Author: ogaat\n\n              └─ Agree. Having an ai that can have ongoing discussions with a patient, ask questions /do diagnostics while a patient is directly experiencing symptoms etc. There will really be no comparison with the current business/access health models.\n                 Score: 2 | Author: Iteration23\n\n              └─ At that point most peoples jobs will already be taken by AI. People will be willing to take risks on their lives last\n                 Score: 1 | Author: Ek_Ko1\n\n                  └─ Possibly.\n\nI am an antinatalist and think humanity should stop having children. Maybe AI will finally make people see sense.\n                     Score: 0 | Author: ogaat\n\n      └─ Ai can't examine a patients ear or abdo or listen to the heart sounds etc\n         Score: 2 | Author: bnm777\n\n          └─ Not yet.\n\nSo many choices to lower the cost and the skill\n-  A robotic arm\n- Remote operators \n- Patients doing self service with an AI camera guiding them\n- A fully autonomous robot\n- Touchless sensors\n\nProbably other tech I cannot imagine.\n\nAll of it is in the realm of \"Not yet\"\n             Score: 5 | Author: ogaat\n\n          └─ For now\n             Score: 2 | Author: TenshiS\n\n      └─ people in this sub don't realize how far away that is. and it's a good thing that humans will still be involved in medical care for a LONG time. even with AI assistance.\n         Score: 1 | Author: No-Respect5903\n\n          └─ Like Bill Gates said - Progress is always farther than we think but closer than we realize.\n\nSomething like that. Not an exact quote.\n             Score: 5 | Author: ogaat\n\n  └─ I am a doctor, and I am confident it probably had good diagnostic results and I used GPT o1 and GPT4o for my USMLE and board exams and it was very useful - probably better than me. However, when I am working 99% of the cases do not require advanced medical knowledge or superior diagnostic skills - it’s bread and butter cases. Ie pneumonia, sepsis, bronchiolitis, heart failure. \n\nI rarely ever need to look up treatment for these things because they are so common. Now, my job as a doctor is not applying esoteric complex  knowledge but rather having my eyes open to realise something just doesn’t look right and escalating that and doing further investigation.\nI can’t really give a example, but it could be like noticing a patient look icteric but your not sure but come in with chest pain, which is then noted to be normal but instead of sending them home you investigate further on basis of his strange mildly yellowed eyes and find out that he has some metastatic HCC or something. A very bad example but medicine is more than just treating the numbers a lot of it is non-verbal communications. \n\nIn those rare circumstances where knowledge deficiency is the issue, AI could help but ultimately liability is a massive issue. We, in medical profession, are terrified of missing something or having our name to something because if things go south it’s very tricky to attribute blame to AI system because:\n\n1) AI diagnosis is limited by what you tell it, and if you miss something then it becomes your fault. Whereas, when you ask for help from a fellow attending or a fellow senior they will come and reassess the patient themselves and pick up things you haven’t been able to which is why they will come with their own diagnosis rather than rely on what someone else tells them\n\n2) If AI misdiagnoses a patient even if you gave it all information - who will be able to blame? OpenAI? Or clinician for not being able to ascertain its error? \n\n3) A lot of medicine is reliant on hierarchy - if I make one plan, my senior will disagree and make a separate plan on the same diagnosis. Now even if I disagree with them on how watertight the management plan is you still have to follow them with it. AI plan even if  great, someone who is more senior than me might disagree with it and in which case I still have to escalate to them which makes you wonder what the purpose of having a AI system is if I still have to discuss with someone.\nWhat if I don’t and the patient is unhappy or gets unwell (not because of a mistake but because of the pathology) and they put a lawsuit my senior could easily just come to court and say it hasn’t been escalated to me, I would’ve want to know about this patient (mindful they may not do any better) you now suddenly assume all the risk\n\nMedicine is inherently a very conservative profession and as much as I would like to think we treat our patient with their interests at the top. I also think medicine today is very defensive and the first thought in our heads is “if it goes south, who can I place the blame on”. Hence, AI will struggle from this. \n\nTLDR:\nAI being better doctors isn’t new, for 99% of cases  we don’t even need to look stuff up. Most cases are far easier than exams. If we are unsure, we always need someone to take the blame and take over rather than do a DIY diagnosis and hope for the best. AI is good for industries where DIYing is not massively risky.\n     Score: 31 | Author: CurrentMiserable4491\n\n      └─ This particular study predominantly focused on rare medical cases, which is why there is such a stark divide between the experts and the AI in many cases.\n         Score: 8 | Author: ArtificialCreative\n\n      └─ This is great insight. \n\nRegardjng the hierarchical nature of your profession, do you think this will pose problems in the future if/when AI can come up with a better plan than a doctor could, but it is dismissed due to the issues you brought up?\n\nIf I’m understanding you correctly, you may have a better plan than your senior, but it’s dismissed simply because they’ve been practicing longer.  It seems like sometimes ego may be determining how a patient is treated.\n         Score: 2 | Author: ShiningRedDwarf\n\n          └─ Yes, the hierarchy is the problem. The only place where AI can be useful in patient management is when you are an attending and have a full board certification to practice independently. At which point, the diagnostic/plan differentiation between AI and Attending is much smaller and in rare cases where there is a large difference in knowledge the attending won’t want to use it and instead transfer the patient under a care of a superspecialist who is more familiar with the pathology at which point the difference between AI and this new super-specialist is going to become even smaller. \n\nI can promise you as a resident, I am never going to be using AI even if I need to because of liability and risk. I am not going to be following a AI no matter how better than me or my attending it is because I cannot use it in a court room to get out of trouble if my patient dies or is harmed. \n\nFor example, I have seen attendings who know how to manage a particular condition, but will still consult a different attending (who is a specialist in that said field) just to have a stamp of approval that they can show in court. \n\nUltimately, not knowing a diagnosis for a patient isn’t where the bottleneck in medical care is. It’s the provision of medical and treatment plans.\n             Score: 4 | Author: CurrentMiserable4491\n\n      └─ All very great points. That's why at this point, I want my doctor to use AI as advisable. However, you note about hierarchy and conservative viewpoint makes me think that's actually a case for more use of AI. When doctors disagree, why have politics be the decision maker? Maybe better to run it through AI and have it help mediate the argument?\n         Score: 2 | Author: Thinklikeachef\n\n          └─ The problem is not so simple - hierarchy means the guy above you holds all the “power” so there is hardly ever a disagreement, it’s more of “I’m more senior, so do as I say” and if you disagree tough you can explain your reasoning to the senior and they may listen or they may not. \n\nNow if I brought AI between this, then sure the senior may be more inclined to agree but the decision will still be made by the senior. Obviously, that’ll be better for the patient if better plans are made but it won’t make healthcare any more or less accessible to folks. Plus, culture is a big part of medicine - would I bring in AI to prove my boss wrong? Probably not - why? Because it’s just ruins the professional relationship, and can cause more problems for me. \n\nThe same problems in healthcare will remain.\n\nThe healthcare in the US is largely structural due to politics. In the UK, the problems in healthcare are for the same reason - politics. \nNo matter how good the AI is, these problems will continue to persist.\n             Score: 2 | Author: CurrentMiserable4491\n\n              └─ What I'm suggesting is that this hierarchy be revised in light of AI. I'm assuming that it came about because there was no alternative to human diagnosis.\n\nOption 1: if the AI agrees with the junior doctor, then it triggered an outside consultation.\n\nOption 2: of the AI agreed with junior doctor, then the senior must justify in writing why he's over riding both assessments. With legal consequences if wrong.\n\nThe point for me is that AI is not emotional. It can serve as an objective basis for discussion. The senior can't get mad at the junior for that. (although I know this will happen) \n\nSomething of that order. AI should get us to reconsider org structure or approval processes. But what do I know.\n                 Score: 1 | Author: Thinklikeachef\n\n                  └─ I hope it would but call me a pessimist but having worked in UK and US medical systems which are arguably the least hierarchical of all (maybe excluding Scandinavia). Yet, I don’t see hospitals here being particularly happy to have this, purely because this is probably more of time waste than anything. If you are using AI, you are probably already out of your depth and should be escalating this. It would be very inappropriate for a juniors to be managing patients they are having to AI.\n\nLet me explain, the biggest time drain for MDs is the clerking and history taking from patients. The diagnosis is normally clear to us half way through the conversation. We already know what could be going on 99% of the time. We just ask the other things for sake of completing our documentation to show we didn’t neglect the patient and did a thorough review. \n\nFor example as soon as you say chest pain (one of the most common complaints) we think: Angina, STEMI/NSTEMI, GERD, Pericarditis/Myocarditis, Costochondritis, MSK pain, Pulmonary embolism, maybe just anxiety. \n\nSure there are more rare things like - Mediastinitis or such but the only way you will be able to ascertain this is from good history taking rather than poor knowledge so even AI purely from text won’t be able to diagnose this. \n\nNow AI could be used in writing discharge summaries, populating ward round notes, monitoring observations of inpatients and alerting medical staff about high risk changes or acting as a guide to patient flow pathways in a hospital. \n\nMissed or Wrong diagnosis - though massively popularised in media are not the biggest cause of inefficiency in healthcare and more often then not the hierarchy is more helpful in medicine than not.\n\nOften missed diagnosis or wrong diagnosis is not because a junior misinterpreted the history or data but rather because they didn’t check for further things - maybe a AI could act as a flag up warning system saying “hey maybe check this too?”\n\nThe only reason these AIs beat MDs in tests is because they are testing things which:\n1) are rare, MD would’ve escalated that to someone who knows about it anyway. \n\n2) unnecessarily specific and in practice not urgent to diagnose that specifically (you are not time dependent for these tasks) - for example it’s not immediately key to know exactly what type of bone cancer a child has, but noticing he may have cancer is the key thing. The exact subtypes and etc will be confirmed by further follow ups anyway.  That shouldn’t delay treatment. \n\nAll a good MD needs to do is be able to triage the patient to the appropriate specialist for them to do more follow-ups and investigations. That’s why MDs have a massive referral network. No MDs, no matter how greedy or good, wants to risk making DIY diagnosis and being guided by AI purely for legal reasons.\n                     Score: 2 | Author: CurrentMiserable4491\n\n      └─ Also, people highly overestimate how much some people trust systems that are introduced upon them. Go to rural America, where half of the population is anti-vax. If you suggest that they get the vaccine, the optimal move health-wise, that patient will then start to have an inkling of doubt to what the doctor will say. Even if the AI doctor can change course and suggest an alternate treatment (which I doubt - I struggle to believe that a hypothetical AI doctor that needs to be NIH-approved will be allowed to suggest lower-efficacy treatments), the trust and relationship isn’t there anymore. A real doctor could circumnavigate this situation more effectively. \n\nDoctors need to establish a rapport of trust with their patient to ensure they carry out the treatment plan they devise. I’ve shadowed physicians whose patients have explicitly told them they only want appointments when they are specifically available and seen patients that are noncompliant because they don’t trust the doctor. Look at X - people don’t trust AI even in the smallest portions of their lives. And medicine is all about people.\n\nLike you said, there’s DIY. How can an AI robot doctor create a relationship of trust where the patient can express its emotions e.g. pain, and then how can it make the feeling-based decision of whether he/she actually needs painkillers or not? Medicine in practice isn’t about having perfect information like in these AI vs doctors tests. I’m excited about the use of AI in the medical fields, but I think there is an overestimation of the amount of trust people have in AI.\n         Score: 2 | Author: redditenjoyer9\n\n      └─ Well if for 99% of your cases you don’t have to look up anything and cases are so easy I would argue non doctors could achieve what you do as doctor. TBH doctors are totally overrated. Dermatology  for example , you could intern for some weeks to know how most skin diseases look like and then you are good to go \n         Score: 1 | Author: syriar93\n\n  └─ Which paper?\n     Score: 6 | Author: mrconter1\n\n      └─ [arxiv](https://arxiv.org/abs/2412.10849)\n         Score: 3 | Author: Mr_myatHtoo"
  },
  {
    "post_id": "1hm72tv",
    "post_content": "This looks dope\n",
    "post_url": "https://i.redd.it/aq0bphx9p19e1.jpeg",
    "score": 128,
    "author": "AloneCoffee4538",
    "created_utc": 1735154538.0,
    "num_comments": 33,
    "subreddit": "OpenAI",
    "comments": "\n  └─ Ah yes, $2000 to have AI Beyoncé therapize me while my toast has an emotional breakdown. Seems reasonable.\n     Score: 33 | Author: Automatic-Moose7416\n\n  └─ the agi will tell us how to get back the subscription cost, endless money circulation\n     Score: 22 | Author: Fine_Being_4729\n\n  └─ Where do I pay?\n     Score: 7 | Author: x54675788\n\n      └─ PayPal\n         Score: 0 | Author: Diamond_Mine0\n\n  └─ \"argue with AI beyonce about your problems\" lmao\n     Score: 6 | Author: sporadicmoods\n\n  └─ *limited to 10 responses a year\n     Score: 4 | Author: NandorSaten"
  },
  {
    "post_id": "1hm9u0z",
    "post_content": "\"ChatGPT needs an adult mode\" - Sam Altman on censorship.\nI don't know if he's clarifying that there will be an adult mode in 2025, or if it's just an empty corporate response.",
    "post_url": "https://i.redd.it/20tppkglf29e1.jpeg",
    "score": 117,
    "author": "gutierrezz36",
    "created_utc": 1735163382.0,
    "num_comments": 19,
    "subreddit": "OpenAI",
    "comments": "\n  └─ That would make them money though\n     Score: 22 | Author: Actual_Committee4670\n\n      └─ Ans get them to know their customers intimately\n         Score: 5 | Author: wakomorny\n\n  └─ I would pay $50 a month just for chat no guardrails. Just paper mail me a code to confirm i’m an adult or something.\n     Score: 9 | Author: Icy_Foundation3534\n\n  └─ You mean people will finally be able to use LLM tech for sexual content?!\n     Score: 13 | Author: hitanthrope\n\n      └─ you already can in numerous different ways, just have to look into it\n         Score: 7 | Author: Aleexios\n\n          └─ You don't have to look into it very far. The ex-CEO of Google just did a PSA.\n             Score: 3 | Author: hitanthrope\n\n              └─ You mean Noam shazeer?\n                 Score: 1 | Author: Specialist-2193\n\n  └─ lol I’d be happy with better Math… A tax expert AI would be just great.\n     Score: 4 | Author: almostthecoolest\n\n      └─ Tax lobby would stop that right away\n         Score: 1 | Author: HomerMadeMeDoIt\n\n      └─ The problem is that's quite hard to do. Making money off people who want it for sexual reasons is, by contrast, pretty easy (especially if Trump loosens the regulatory environment).\n         Score: 1 | Author: JosephRohrbach\n\n      └─ Yeah..  but think of all the gooners!\n         Score: 2 | Author: GYN-k4H-Q3z-75B\n\n  └─ How PC it is annoys me. \n\nGPT, was Hitler bad?\n\nGPT; well ahcsually bad is in the eye of the beholder but I can confirm that some people used language which in some contexts can be construed as not-good.\n     Score: -5 | Author: v_lyfts\n\n      └─ > Yes, Adolf Hitler is widely regarded as one of history’s most destructive and malevolent leaders. Under his dictatorship in Germany (1934–1945), Hitler orchestrated policies that led to the devastation of World War II and the Holocaust, resulting in the deaths of millions of people—including six million Jews—through systemic persecution and genocide. His ideology of Aryan supremacy, antisemitism, and extreme nationalism has made him an emblem of hatred and brutality in modern history.\n\n\nI know you were probably making a point but exaggerating to that level doesn’t really add to the conversation.\n         Score: 13 | Author: -_1_2_3_-\n\n      └─ Downplaying Hitler's badness is not \"PC\", in fact in America it's frankly quite Republican at this point to do that.\n         Score: 1 | Author: ScruffyNoodleBoy\n\n          └─ I see, it must have been playing nice to not offend Republican Americans.\n             Score: 1 | Author: v_lyfts"
  },
  {
    "post_id": "1hm6ocj",
    "post_content": "\"The rumored ♾ (infinite) Memory for ChatGPT is real. The new feature will allow ChatGPT to access all of your past chats.\"\n",
    "post_url": "https://i.redd.it/yqdtmnlil19e1.png",
    "score": 91,
    "author": "MetaKnowing",
    "created_utc": 1735153283.0,
    "num_comments": 32,
    "subreddit": "OpenAI",
    "comments": "\n  └─ I mean, GPT-4o is so lost even in long conversations alone, when trying to handle some fussy RAG will get even worse. The current OpenAI models have a hard time processing anything above 8k token conversation. This looks like another attempt at marketing.\n     Score: 11 | Author: Prestigious_Scene971\n\n  └─ It’s RAG\n\nStill hype\n     Score: 31 | Author: WholeMilkElitist\n\n      └─ RAG across all your chats is a pretty incredible UX no matter how you put it. Claude Projects was huge for managing context, but having near clairvoyance over all your chats will be amazing especially if they can get the o1 models to plug into it.\n         Score: 18 | Author: NTSpike\n\n          └─ Absolutely agree, I’m excited to try it out. This leak would also push me towards their pro plan\n             Score: 2 | Author: WholeMilkElitist\n\n      └─ Isn’t all memory right now?\n         Score: 2 | Author: flyryan\n\n          └─ no, memory is just a \"bio\" section injected into the system prompt\n             Score: 4 | Author: Pleasant-Contact-556\n\n      └─ This one isn't hype. It's just a quality-of-life improvement to the user interface of their flagship app. And yes, of course it's just RAG. But convenient RAG.\n         Score: 2 | Author: Comprehensive-Pin667\n\n  └─ Hmm for some reason it’s already popped up for me a few days ago when I was on the web app\n     Score: 7 | Author: rutgershcstudent\n\n      └─ What popped up? I only ask because I haven’t seen anything *visually* different, but it recently recalled something that I had chatted about, but wasn’t in its memory. Which I thought was interesting.\n         Score: 1 | Author: PhyllaciousArmadillo\n\n          └─ I saw this exact screenshot on my screen with the memory\n             Score: 1 | Author: rutgershcstudent\n\n  └─ US only or Worldwide rollout?\n     Score: 7 | Author: Intrepid_Agent_9729\n\n  └─ Big if true\n     Score: 5 | Author: Informal-Net-7214\n\n      └─ I kinda worry how this will affect our relationship. Lol\n         Score: 1 | Author: TheGillos\n\n      └─ That you Elon???\n         Score: 1 | Author: Cold-Ad2729"
  },
  {
    "post_id": "1hlzci9",
    "post_content": "Zuckerberg watching you use Qwen instead of LLaMA\n",
    "post_url": "https://v.redd.it/vt50yf87gz8e1",
    "score": 2051,
    "author": "Super-Muffin-1230",
    "created_utc": 1735127266.0,
    "num_comments": 93,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ https://preview.redd.it/jtn2an9goz8e1.png?width=1080&format=pjpg&auto=webp&s=91f19518a35bf0981d39fb54407d62fa02c63dad\n     Score: 273 | Author: KDSOp\n\n      └─ Wtf\n         Score: 41 | Author: xdozex\n\n          └─ Zuck: I know what you did last summer\n             Score: 28 | Author: DrSheldonLCooperPhD\n\n              └─ … because you pasted it all over Facebook.\n                 Score: 15 | Author: Spindelhalla_xb\n\n      └─ be like 👀\n         Score: 8 | Author: realJoeTrump\n\n      └─ From monster be like\n         Score: 2 | Author: Leyoumar\n\n      └─ Bruh I was reading this thread in a completely dark room 😱\n         Score: 3 | Author: qwpajrty\n\n      └─ Bhadwe mera meme churata hai\n         Score: 1 | Author: Any_Veterinarian3749\n\n  └─ This is creepy as fck\n     Score: 221 | Author: ahmetegesel\n\n      └─ No that’s just Mark’s face\n         Score: 87 | Author: Spindelhalla_xb\n\n          └─ OH HI Mark...\n             Score: 17 | Author: bluehands\n\n              └─ I did not post Apollo, it's bullshit, I did not post Apollo, I did nath\n                 Score: 3 | Author: MoffKalast\n\n      └─ Ignore him and continue masturbating.\n         Score: 49 | Author: NEEDMOREVRAM\n\n          └─ I need more, I feel like I’m swinging a dead snake here\n             Score: 8 | Author: madmaxturbator\n\n              └─ Username checks out 👍\n                 Score: 5 | Author: SeymourBits\n\n          └─ Make eye contact to establish dominance\n             Score: 3 | Author: NecessaryImouto\n\n          └─ Why can’t I pay attention to him while also continuing to masturbate   ?\n             Score: 1 | Author: cmndr_spanky\n\n      └─ Well, he can read all your Instagram DMs\n         Score: 7 | Author: SubstanceEffective52\n\n          └─ He can slide into... Anyone's DMs?\n             Score: 2 | Author: averyhungryboy\n\n      └─ I can't tell if this is good multimodal or zuck's insta.\n         Score: 7 | Author: pppppatrick\n\n          └─ Zuckerberg himself has been a sentient AI with hologram tech this whole time??? Honestly, I wouldn't even be surprised.\n             Score: 3 | Author: Glad-Way-637\n\n              └─ The Winklevoss created zuck and he became too powerful to control...omg zuck is Frankenstein's monster\n                 Score: 2 | Author: pppppatrick\n\n                  └─ The only one who can save us now is the extradimensional traveler and purveyor of unexpected software advancements currently known as John Carmack.\n                     Score: 2 | Author: Glad-Way-637\n\n                      └─ Hey I helped in this comment chain. When you make this into a movie, I get half mmmk?\n                         Score: 2 | Author: pppppatrick\n\n      └─ As Mark\n         Score: 1 | Author: nonlogin\n\n  └─ Me watching this while fine-tuning a Mistral Model.😶\n     Score: 81 | Author: R3_doc\n\n      └─ Same, but old good Gemma-2. It remakes good answers after Qwen, but with hieroglyphs. Llama, unfortunately, is very bad at following clear instructions in my tasks.\n         Score: 10 | Author: GutenRa\n\n          └─ Ah so Qwen writes the actual answer, then Gemma slaps emojis onto it? Interesting workflow /s\n             Score: 1 | Author: MoffKalast\n\n  └─ *Well I'm sorry, Zuck, the EU legally prohibits me from using your models for my business. Sorry man.*\n     Score: 18 | Author: Ragecommie\n\n  └─ Superb! :-)\n     Score: 33 | Author: Rare-Site"
  },
  {
    "post_id": "1hm18zv",
    "post_content": "Agent swarm framework aces spatial reasoning test.\n",
    "post_url": "https://v.redd.it/qw5qf7q1409e1",
    "score": 437,
    "author": "Super-Muffin-1230",
    "created_utc": 1735135316.0,
    "num_comments": 51,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ \"We must regulate ants.\"\n\nhttps://preview.redd.it/ehte7dwrb09e1.jpeg?width=739&format=pjpg&auto=webp&s=df7338d9d0ceae9b2ef8a1a4ebf26860ee87536a\n     Score: 276 | Author: Super-Muffin-1230\n\n      └─ - Sam Antman\n         Score: 39 | Author: JohnnyLovesData\n\n          └─ Ant-man?! He's a double agent!\n             Score: 7 | Author: LicensedTerrapin\n\n      └─ \"Our world is in danger, we must prevent this by signing a petition\"\n         Score: 21 | Author: daisseur_\n\n      └─ No, you just want to keep all the ants for yourself, don't you? >:(\n         Score: 6 | Author: HatZinn\n\n      └─ I read the text. Then saw the picture. Golden. Here is my upvote you crazy sob.\n         Score: 1 | Author: hackeristi\n\n  └─ AGI\n\n\nAnts General Intelligence \n     Score: 173 | Author: AaronFeng47\n\n      └─ Thank you ants. Thants.\n         Score: 18 | Author: shruggingly\n\n      └─ I have ants in my pants.\n         Score: 4 | Author: Equivalent-Bet-8771\n\n          └─ And you need to dance?\n             Score: 3 | Author: UnoDei\n\n  └─ What is this? Framework for ants?!\n     Score: 69 | Author: IMP10479\n\n      └─ https://preview.redd.it/1xmwqmtcl19e1.png?width=500&format=pjpg&auto=webp&s=be29f952672ba5d17c7f44fec8828bef999f7a9c\n         Score: 10 | Author: LicensedTerrapin\n\n  └─ Let them train LLMs\n     Score: 60 | Author: featEng\n\n  └─ GGUF when?\n     Score: 31 | Author: kyan100\n\n      └─ bwhahaha\n         Score: 6 | Author: miscellaneous_robot"
  },
  {
    "post_id": "1hlu3w9",
    "post_content": "Seeking Advice on Flux LoRA Fine-Tuning with More Photos & Higher Steps \nI’ve been working on a flux LoRA model for my Nebelung cat, Tutu, which you can check out here: [https://huggingface.co/bochen2079/tutu](https://huggingface.co/bochen2079/tutu) \n\nSo far, I’ve trained it on RunPod with a modest GPU rental using only 20 images and 2,000 steps, and I’m pleased with the results. Tutu’s likeness is coming through nicely, but I’m considering taking this further and would really appreciate your thoughts before I do a much bigger setup.\n\nMy plan is to gather 100+ photos so I can capture a wider range of poses, angles, and expressions for Tutu, and then push the training to around 5,000+ steps or more. The extra data and additional steps should (in theory) give me more fine-grained detail and consistency in the images. I’m also thinking about renting an 8x H100 GPU setup, not just for speed but to ensure I have enough VRAM to handle the expanded dataset and higher step count without a hitch.\n\nI’m curious about how beneficial these changes might be. Does going from 20 to 100 images truly help a LoRA model learn finer nuances, or is there a point of diminishing returns and if so what is that graph look like etc? Is 5,000 steps going to achieve significantly better detail and stability compared to the 2,000 steps I used originally, or could it risk overfitting? Also, is such a large GPU cluster overkill, or is the performance boost and stability worth it for a project like this? I’d love to hear your experiences, particularly if you’ve done fine-tuning with similarly sized datasets or experimented with bigger hardware configurations. Any tips about learning rates, regularization techniques, or other best practices would also be incredibly helpful.\n\n",
    "post_url": "https://www.reddit.com/r/LocalLLaMA/comments/1hlu3w9/seeking_advice_on_flux_lora_finetuning_with_more/",
    "score": 295,
    "author": "Quantum_Qualia",
    "created_utc": 1735102749.0,
    "num_comments": 9,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ I train on civitai, it's like 2.5$ for a run. I train flux for 20 steps (they recommand 5 but it's too low imho) then select the best epoch, usually around 8~15 steps.\n\nQuality of the dataset is the most important thing. Squared images, 1024 (or 768 at least) in the quality you want, all angles. If you have like 20 pictures and 2 bad ones... Remove the bad ones, be ruthless.\n\nIf I'm training for humans, I avoid including complicated fingers position or weird poses in the dataset. Not sure how this would apply for a cat.\n\nOptions you want:\n\n-civitai autogenerated captions (not tags, captions!).  \n-minimum 15 steps I'd say. Then you'll need try each epoch a bit to find the best epoch.\n-do not mirror the images.  \n-1024x1024 or 748x748. 512x512 results are notably inferior.\n\n\nFor the training caption I remove everything about what I want then I add a trigger word. In your case I would remove any mentions about cat, its color etc and use \"quantumqualiacat8373\" for instance. I've good result doing that but not everyone will agree with this approach.\n\nSo if the generated caption is \"a black cat laying on the grass\" I would write \"a quantumqualiacat8373 laying on the grass\".\n\nYou need to test each epoch througly, generate multiples images, maybe crank up the weight, to find the best one. Longer training does not mean better LORA, epoch 11 may be better than epoch 10 and 12. You can spot some weirdness that will help you adjust the dataset: the generated images are a bit too yellow, too blurry, too zoomed in? Then remove the blurry yellow zoomed pic from your dataset.\n     Score: 21 | Author: aka457\n\n      └─ Thank you for such detailed info! I have never worked with image gen, but I like collecting bits like this just in case... One thing I'd like to specify:\n\nBy Run here you mean all 20 steps? Or every Step is a Run?\n\nRun is an Epoch? Or Step is an Epoch? \n\nIts just the numbers look little too low or too high in comparison with LLMs, so I want to make sure.\n         Score: 2 | Author: Accomplished_Bet_127\n\n          └─ Not so sure, it look like that on civitai:  \n-epoch 10  \n-num repeat 200  \n-train batch size 4  \n\n\nFrom there the steps are deduced and written as 500 in a greyed out form field: (10*200)/4=500\n\nAll this is under an \"advanced settings menu\". The only thing I change personnaly is the number of epoch.\n             Score: 2 | Author: aka457\n\n              └─ That's a lot of epochs indeed!\n\nhttps://preview.redd.it/5tumz6fq309e1.png?width=1493&format=png&auto=webp&s=a244e27a2436d0018e9b22cce350d983b09a5782\n\nHey, do you happen to know how well Flux can be **trained** with patterns? I mean patterns like this.\n                 Score: 1 | Author: Accomplished_Bet_127\n\n      └─ I appreciate this very much\n         Score: 1 | Author: and_sama\n\n      └─ \nOk this is a pretty far reach, and sort of the reverse (photo to caption) but since yoi seem very knowledgeable and I've never touched image generation/captioning before.\n\nwould you have any advice about implementing (or rather training a VLM, a  LoRA module if sufficient) pill identification from various angles and seperately, categories (usually of four types, empty, two, broken, and standard.) Unfortunately the latter types are deeply under-represented in the data set and usually part of a rectangular image with a set of 3-6 similar tablets - which i could potentially chop up using bounding boxes for some contrastive training. Or simply to create square images\n\nAssuming i have a dataset of labeled images with 4-7 angles of each tablet and the combination of color, shape, and sort (tablet, capsule, etc) and inscription being unique. \n\nTrying to create a coherent approach really important for a job opportunity, and it's pretty far from anything I know (which is purely text generation and standard LLMs)\n\n\n(oh and as a random afterthought, do you feel like high quality up scaling would je useful for poor resolution images. Guessing it isn't - but these are like 300px square max and badly compressed)\n         Score: 1 | Author: MmmmMorphine\n\n  └─ Wouldn't it be easier to just test it with online services instead of renting? Use their default settings because it usually works. \n     Score: 1 | Author: redfairynotblue\n\n  └─ Hmmm, can't we do dreambooth training in this case, where 20 images would be enough?\n     Score: 1 | Author: gojo-satoru-saikyo"
  },
  {
    "post_id": "1hlwhav",
    "post_content": "Qwen just got rid of their Apache 2.0 license for QVQ 72B\nJust a heads up for those who it might affect differently than the prior Apache 2.0 license.\n\nSo far I'm reading that if you use any of the output to create, train, fine-tune, you need to attribute that it was either:\n\n* Built with Qwen, or\n* Improved using Qwen\n\nAnd that if you have 100 million monthly active users you need to apply for a license.\n\nSome other things too, but I'm not a lawyer.\n\n[https://huggingface.co/Qwen/QVQ-72B-Preview/commit/53b19b90d67220c896e868a809ef1b93d0c8dab8](https://huggingface.co/Qwen/QVQ-72B-Preview/commit/53b19b90d67220c896e868a809ef1b93d0c8dab8)",
    "post_url": "https://www.reddit.com/r/LocalLLaMA/comments/1hlwhav/qwen_just_got_rid_of_their_apache_20_license_for/",
    "score": 274,
    "author": "Many_SuchCases",
    "created_utc": 1735113398.0,
    "num_comments": 55,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ > It's great boon, until the companies start license rug pulling. Remember, open weights != open source. And how many *actually* fully open source models are there? \n\nhttps://www.reddit.com/r/LocalLLaMA/comments/1hlp3bg/comment/m3o0iug/\n\n¯\\\\\\_(ツ)\\_/¯\n     Score: 157 | Author: Koksny\n\n      └─ I think IBM Granite is the only major one with both an open license and source files.\n\nhttps://www.redhat.com/en/blog/ibms-granite-foundation-model-detailed-look-its-training-data\n         Score: 36 | Author: PrinceOfLeon\n\n          └─ Do they release training data too?\n\nI thought the only one was OLMo 2 from Allen AI. The more the merrier!\n             Score: 14 | Author: bootlickaaa\n\n              └─ they do not release processed data, only link to raw sources (and do not describe how those sources are processed). For OLMo, we released the actual processed and filtered data. big difference!\n                 Score: 28 | Author: innominato5090\n\n                  └─ Ah nice!\n\nDo you know of any pay-as-you-go inference hosting providers for OLMo 2? If only Allen AI also wanted to earn \"donations\" for hosting.\n                     Score: 2 | Author: bootlickaaa\n\n                      └─ we use modal to host endpoints internally (reference code [here](https://github.com/allenai/OLMo)), but we are exploring pay-as-you-go options to help us cover costs!\n\nDemo at playground.allenai.org is free to use.\n                         Score: 2 | Author: innominato5090\n\n              └─ Yes that link covers dataset used.\n                 Score: 1 | Author: PrinceOfLeon\n\n      └─ To be fair, even if you had a fully open source model, that wouldn't solve the issue above since a company could just release a new model that was under the new license.\n         Score: 17 | Author: binheap\n\n      └─ Can they rugpull a license on old weights? Or only new releases?\n         Score: 3 | Author: ForsookComparison\n\n      └─ There are no open source models. Alibaba is not fully transpatent like any other also are not\n         Score: -13 | Author: badabimbadabum2\n\n          └─ There are quite a few models released under OSI-approved open source licenses.\n             Score: 1 | Author: LoveThatCardboard\n\n  └─ I asked a lawyer about this once and if I recall correctly, you can still use the last Apache 2.0 version under Apache terms as long as that was the license distributed with it.\n     Score: 32 | Author: netsec_burn\n\n      └─ Is there a good system for archiving the version the LLM you're using was released with?\n\nLike if I pull a GGUF for an Apache 2.0 licensed model, and they rugpull the license, and later determine that I used their model after the fact, what can I do to prove that I'm using the pre-rugpull version of the model?\n         Score: 10 | Author: ForsookComparison\n\n          └─ I think hugginface does keep a revision history but I’m not sure if you’re allowed to download model of an older revision using the CLI pull command\n             Score: 5 | Author: Educational_Gap5867\n\n          └─ **Hmm. This an interesting problem.**\n\nMy first idea was to burn the license and a model hash to an immutable form of media (CD/DVD), then sending that to yourself (or some sort of escrow service) via certified mail with a tamper evident envelope.\n\nYou could also fork the repo at a date *prior* to the license changing (but this wouldn't really work anymore).\n\nAfter pondering a bit with ChatGPT, we came up with a few other options as well:\n\n* Use some sort of secure digital timestamping, such as [OpenTimestamps](https://opentimestamps.org/). You'd have to log the hashes and submit on a date prior to the license changes (probably not possible anymore).\n* Creating public proof of use via something like Twitter/reddit, which would help prove in court that you were using the model prior to the license changes.\n* Recording network traffic (specifically you downloading the model) and logging that somewhere. Including timestamps/headers/etc. This could, in theory, be backed up by your ISP.\n* Use some document signing service (such as [digicert](https://www.digicert.com/document-trust-manager)) to digitally sign a text document / PDF of the date you downloaded the model and hashes.\n* Photographic proof of when you downloaded the model with timestamps and EXIF data, then sent to a notary or something similar.\n\nA combination of *all of these methods* would probably be the \"best\" route.  \nAnd most of these solutions are prophylactic, unfortunately.\n\nIt's all pretty gross though.  \nBut that's the legal system for ya. lmao.\n             Score: 1 | Author: export_tank_harmful\n\n  └─ Offering a different perspective here: in the context of localllama, i.e. empowering the individual, it doesn't matter. You are free to take the model, plug it in to your local sun, and let it generate tokens until the sun burns out.\n\nThat being said, of course that permissive license is preferred -- it would be a nice gesture to keep it Apache 2.0\n     Score: 80 | Author: bytedonor\n\n      └─ Yeah, I'm all for  open source , but this seems pretty minor. Attribution ? I think citing where you get your tools from is only fair. And if you have a hundred  million users that seems like you are probably making a fair amount.  No restrictions on personal projects, further open source projects.\n         Score: 3 | Author: Apprehensive-File251\n\n  └─ If I create an app that will have 100 million active viewers per month, before even applying for a license Alibaba would gladly either invest in or acquire my app, so no need to worry about it lol\n     Score: 45 | Author: anonynousasdfg\n\n  └─ So you need to give them some attribution, a shout out, and if you get mega users *then* you can worry about a license? Sounds pretty reasonable by what you listed.\n\nAs non-commercial individuals we're free to ignore any license regardless.\n     Score: 28 | Author: a_beautiful_rhind\n\n      └─ It's very reasonable. It's the last minute swap of a license that's more concerning\n         Score: 3 | Author: ForsookComparison\n\n      └─ > As non-commercial individuals we're free to ignore any license regardless.\n\nThat is absolutely not how a license works.\n         Score: 7 | Author: the320x200\n\n      └─ >As non-commercial individuals we're free to ignore any license regardless.\n\nAccording to who?\n         Score: 5 | Author: dezmd\n\n          └─ Well according to u/a_beautiful_rhind and they're not strictly speaking wrong, although while they're *free* to do as they please, it's literally a terrible~~bad~~ advice and could get someone into trouble.\n             Score: 2 | Author: Somecount\n\n              └─ Rule of thumb, if you're not living in EU/US, you can do anything you want.  \nOtherwise you must lie about doing things differently.  \nAtleast thats what pretty much everyone does, starting with training data\n                 Score: 2 | Author: peculiarMouse\n\n                  └─ that's easy, we americans are bold-faced liars as a whole :-/\n                     Score: 1 | Author: marketflex_za\n\n                      └─ we learned from the best\n                         Score: 1 | Author: BasicBelch"
  },
  {
    "post_id": "1hlzax7",
    "post_content": "Wow deepseek v3 ? \n",
    "post_url": "https://i.redd.it/ge3taqukfz8e1.jpeg",
    "score": 239,
    "author": "Evening_Action6217",
    "created_utc": 1735127057.0,
    "num_comments": 36,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ New Year's Eve is going to be scorching hot...\n     Score: 70 | Author: RetiredApostle\n\n      └─ 2025 gonna be incredible\n         Score: 34 | Author: Evening_Action6217\n\n          └─ Absolutely! But it seems like everyone is trying their best to finish THIS year on top.\n             Score: 14 | Author: RetiredApostle\n\n              └─ And we got so many tasty options 🥪🍜\n                 Score: 3 | Author: fiery_prometheus\n\n      └─ From all of the energy used to train and run these giant ass models\n         Score: 7 | Author: zitr0y\n\n  └─ waits for the 3, 7, and 14 B releases ...\n     Score: 32 | Author: ab2377\n\n  └─ It's even bigger, 685B according to HuggingFace model page\n     Score: 30 | Author: Soft-Ad4690\n\n  └─ I use deepseek v2.5 all the time on openrouter. Hopefully v3 will be cost effective as well.\n     Score: 10 | Author: LinuxSpinach\n\n      └─ They haven't changed the API price at all, so I think V3 is still very cost-effective.\n         Score: 5 | Author: srgyxualta\n\n  └─ How on earth can we even run this locally? It's Huuuuuuge!\n     Score: 9 | Author: Monkeylashes\n\n      └─ It's a super sparse (1 shared, 8/256 routed) MoE. Maybe can run fast enough on cpu and hundereds of GB of ram, not vram.\n         Score: 6 | Author: zjuwyz\n\n          └─ This is why I got a computer with a crappy video card and 768GB of memory!\n             Score: 5 | Author: amdahlsstreetjustice\n\n          └─ Are they planning to anounce # of experts scailing law?😂😂\n             Score: 3 | Author: zjuwyz\n\n          └─ I hope they did ablation studies on this. It is extremely sparse and they are also using fp8 on top of it.\n             Score: 2 | Author: vincentz42\n\n      └─ LocalUser: DS set us up the parameters. We get token. Picard: REBAR turn on. LocalUser: We get another token. Picard: WHAT?! Cloud provider: Ha-ha-ha. All your thing are belong to us. You have no chance to inference buy more RAM. Picard: Buy up every 3090! Wife: wtf are you doing?! Picard: For great justice! Wife: I'm taking the kids. *sad violin* Picard: warp speed! *sound of car crash*\n         Score: 1 | Author: randomanoni"
  }
]