[
  {
    "post_id": "1hh5rqk",
    "post_content": "Are block chain developers in demand ? \nWanting to become a blockchain dev any resources and suggestions would be appreciated",
    "post_url": "https://www.reddit.com/r/BlockchainStartups/comments/1hh5rqk/are_block_chain_developers_in_demand/",
    "score": 10,
    "author": "meowkitty129",
    "created_utc": 1734540451.0,
    "num_comments": 9,
    "subreddit": "BlockchainStartups",
    "comments": "\n  └─ Thanks for posting on r/BlockchainStartups!\n\nCheck the TOP posts of the WEEK. [CLICK HERE](https://www.reddit.com/r/BlockchainStartups/top/?t=week)\n\n*Moderators* *of* *r/BlockchainStartups*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BlockchainStartups) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ Im curious too\n     Score: 3 | Author: lucc66\n\n      └─ Are you Blockchain developer?\n         Score: 1 | Author: Fun_Patient1492"
  },
  {
    "post_id": "1hi6s8i",
    "post_content": "We seek enthusiasts for our blockchain\nWe are live with a special solution for real estate investors.\n\nNow we seek enthusiasts to help us drive this, gladly pay in our tokens.\n\nIf you like startups we would love to chat more with you.",
    "post_url": "https://www.reddit.com/r/BlockchainStartups/comments/1hi6s8i/we_seek_enthusiasts_for_our_blockchain/",
    "score": 6,
    "author": "WorldlyBell6624",
    "created_utc": 1734652579.0,
    "num_comments": 6,
    "subreddit": "BlockchainStartups",
    "comments": "\n  └─ Thanks for posting on r/BlockchainStartups!\n\nCheck the TOP posts of the WEEK. [CLICK HERE](https://www.reddit.com/r/BlockchainStartups/top/?t=week)\n\n*Moderators* *of* *r/BlockchainStartups*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BlockchainStartups) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ Dm\n     Score: 1 | Author: devgirl0"
  },
  {
    "post_id": "1hi59z7",
    "post_content": "Hawk Tuah girl, Hailey Welch, sued over the memecoin collapse\n",
    "post_url": "https://www.cryptopolitan.com/hawk-tuah-sued-over-the-memecoin-collapse/",
    "score": 10041,
    "author": "CragBawz",
    "created_utc": 1734648186.0,
    "num_comments": 951,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ It comes full circle. She had nothing, then everything, and then nothing again. The whole time, she was still spitting on it.\n     Score: 2081 | Author: Invelious\n\n      └─ In July 2024, I was just a 21-year-old from Buttfuck, Nowhere, who worked the day shift at Tennessee Spring & Metal.\n\nI'd never have thought that today I'd have a shell company in the Cayman Islands and a 6-figure lawsuit.\n         Score: 668 | Author: strolls\n\n      └─ I need to know how the hell did she got famous in first place. Is America really that stupid?\n         Score: 73 | Author: AkumaLilly\n\n  └─ Add the Paul brothers to the sue list, she definitely had her role in this but she isn't the only person to blame\n     Score: 242 | Author: CriticalCobraz\n\n      └─ The Paul brothers are not only scammers of their fans now they have become world class in scamming their own partners !\n         Score: 65 | Author: Every_Hunt_160"
  },
  {
    "post_id": "1hkraa3",
    "post_content": "Make it make sense\n",
    "post_url": "https://i.redd.it/8z4nn51fjm8e1.png",
    "score": 9391,
    "author": "InclineDumbbellPress",
    "created_utc": 1734970990.0,
    "num_comments": 533,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ At the end of the day everyone just wants their bags pumped\n     Score: 1489 | Author: goldyluckinblokchain\n\n      └─ Except in the bear, then we here for the tech.\n         Score: 377 | Author: Abysskitten\n\n      └─ Bingo.  \n  \n\"Adopt bitcoin, its the future.\"  \n  \n\"Then why does it's valuation in USD matter so much?\"  \n  \n\">:(\"\n         Score: 45 | Author: Fleeetch\n\n  └─ It makes sense. The government cant control bitcoin, but they can own it like everyone else. Them buying it has nothing to do with “trusting the government”\n\nThey cannot seize everyones bitcoins like they did with gold in 1929, they cannot “remove the gold standard” like they did in 1971, and they cannot print more bitcoin like they do with dollarso today\n     Score: 630 | Author: SapphireSpear\n\n      └─ Right.  The government can't mint more Bitcoin and cause inflation whenever it's convenient, and I think that's the primary argument for decentralization.\n\nBut you know.  Let's suck all the detail and nuance out of it so everything looks the same.  You can call anyone a hypocrite if you do that.\n         Score: 185 | Author: throwaway92715\n\n      └─ > They cannot seize everyones bitcoins like they did with gold in 1929\n\nthey did not seize everyone's gold. that's not how it went.\n\nthe attack vector is possible again because 6 out of 7 bitcoin \"owners\" don't own bitcoin, they use some kind of custodian. the network architecture right now is doing a really bad job of making _self custody_ more scalable. fees are low this cycle entirely because of the massive growth of custodial services. in anticipation of custodial seizure, you would see people attempting a bank run, and fees would shoot up so high that tons of addresses would become unspendable dust.\n\nright now there are a small group of super cool hacker mans who think that everything is okay because they know how to use a trezor or maintain a couple lightning channels. what they don't seem to realize is that the number of people who can do that sort of thing _at the same time_ without fees shooting up is very small. bitcoin has been scaling via custodians this whole time. a seizure would happen at the custodians and it would affect almost everybody. scaling via custodians is a very bad idea.\n         Score: 28 | Author: frozengrandmatetris"
  },
  {
    "post_id": "1hhh0u0",
    "post_content": "Deutsche Bank builds L2 Blockchain on Ethereum\n",
    "post_url": "https://watcher.guru/news/deutsche-bank-to-build-a-l2-blockchain-on-ethereum",
    "score": 278,
    "author": "StockGuy12347",
    "created_utc": 1734570433.0,
    "num_comments": 48,
    "subreddit": "ethereum",
    "comments": "\n  └─ WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ethereum) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator\n\n  └─ A German bank will never use any form of crypto. We still use fax here…\n     Score: 57 | Author: Familiar_Elevator\n\n      └─ Blockchain can be used to store data, which provides accountability to any financial system, be it traditional or not, they might use Ethereum and never touch crypto, besides paying transactions, ofc.\n         Score: 10 | Author: nyonix\n\n      └─ Let's buidl a faxidator then!\n         Score: 5 | Author: albasili"
  },
  {
    "post_id": "1hhn89r",
    "post_content": "Daily General Discussion - December 19, 2024\nWelcome to today’s **Daily General Discussion!**\n\nPlease use this thread to discuss Ethereum topics, news, events, and even *price*!\n\nYes, we are trying something new and will allow price discussion, **but only in this thread!** Price discussion posted elsewhere in the subreddit will **continue to be removed.**\n\nAs always, keep it friendly and follow the sub’s rules.\n\nThe ticker is ETH.",
    "post_url": "https://www.reddit.com/r/ethereum/comments/1hhn89r/daily_general_discussion_december_19_2024/",
    "score": 125,
    "author": "AutoModerator",
    "created_utc": 1734591671.0,
    "num_comments": 113,
    "subreddit": "ethereum",
    "comments": "\n  └─ Messaging on /r/ethfinance and on X regarding the M.E.R.G.E.!\n\nSome information for /r/ethereum natives about what's coming down the pipe.\n\n[https://www.reddit.com/r/ethfinance/comments/1hhucz3/merge\\_make\\_ethereum\\_reddit\\_genuinely\\_excellent/](https://www.reddit.com/r/ethfinance/comments/1hhucz3/merge_make_ethereum_reddit_genuinely_excellent/)\n\n[https://x.com/ProDJKC/status/1869759695235531147](https://x.com/ProDJKC/status/1869759695235531147)\n     Score: 1 | Author: jtnichol\n\n  └─ Hello there! Coming from r/ethfinance\n     Score: 31 | Author: Fredzoor\n\n      └─ Glad to see you here.  \n\nFew.\n         Score: 9 | Author: jtnichol"
  },
  {
    "post_id": "1hklvuc",
    "post_content": "The NFT Hype Is Over – But the Innovation Is Just Beginning\nYou remember when NFTs were “the” thing? What happened? A couple of things: \n\nSpeculation Over Substance: Mainly, people were into the game of buying NFTs, functioning on an investment thesis of flipping them at more extraordinary returns, not for any other value. When the bubble burst, so did all the hype. \n\nScams and Fraud: Fake collections, rug pulls, and Ponzi schemes began to hurt trust in the market.\n\nEnvironmental Concerns: Many early NFTs are dependent on energy-intensive blockchains, drawing criticism from climate advocates.\n\nBut here's the thing: the fall of JPEGs doesn't mean NFTs are dead; this could be the start of something better.\n\nNFTs now move into real-world tools, from overly priced digital art into practical uses across industries: real estate and tokenized properties, in-game assets in gaming, and proving authenticity within supply chains. Think of loyalty programs where NFTs unlock special rewards or AI-powered collectibles that actually evolve over time.\n\nThe lesson? Focus on utility, not hype. What the NFT space needs are transparency, sustainability, and real-world use cases that can help rebuild trust. Meanwhile, the shift is gradually happening toward meaningful applications.\n\nThe JPEG economy is well and truly over, but the NFT evolution has only just begun. What do you think: is the real comeback of NFTs possible, or are they just the relic of a speculative past? Let's discuss.\n\n",
    "post_url": "https://www.reddit.com/r/blockchaindeveloper/comments/1hklvuc/the_nft_hype_is_over_but_the_innovation_is_just/",
    "score": 7,
    "author": "Rough_Play_4288",
    "created_utc": 1734953545.0,
    "num_comments": 3,
    "subreddit": "blockchaindeveloper",
    "comments": "\n  └─ Good comments. Blockchain, NFTs and other smart contracts have great social utility if they can provide for example transparency in government financial transactions, transparent public auctions, proofs of knowledge, etc.\n     Score: 1 | Author: Pyglot\n\n  └─ I know one day, all my legal documents will be NFTs. Degree, Passport, Driver license and so on. The tech is only getting started, and has just so many real life applications!\n     Score: 1 | Author: Shahnaseebbabar"
  },
  {
    "post_id": "1hid3z2",
    "post_content": "Decentralization: Is This the Future of Digital Freedom? Let me break it down.\n\nEverything has changed in this modern information age: the way we communicate, the way business is done, and the way we define ourselves. But here's a catch: most of our digitized world is at the mercy of a few strong hands. They will ultimately decide what you can say, how you will interact, and the quantum of privacy you're \"allowed\" to enjoy. Think about it:\n\nThe banks and platforms like PayPal control your money, the social giants decide what you see and what goes unseen, e-commerce sites dictate who can sell and what they profit from it. It is a system where all power is being concentrated in the hands of a few, giving users little or no control at all. In this system, you are not in outright ownership of your data, your account, or even your online identity.\n\nThat's where decentralization steps in. Through the use of technologies such as blockchain, peer-to-peer networks, and cryptography, decentralization gives it back to \\*you\\*. Here's what that looks like:\n\n1. Data Ownership: Nobody owns your information but you.  \n\n2. Freedom to Participate: Nobody gets to decide who gets in.  \n\n3. Global Access: DeFi cuts out the middlemen, making services available to all.\n\n4. Transparency: Open systems reduce corruption and build trust.\n\nBut let's be real, there are challenges with decentralization, and just because something is decentralized doesn't mean it can't be misused or inefficient.\n\n Decentralization is at its very core reimagining the Internet in service of people, not corporations. All that will take so much more than just tech-it needs awareness, strong communities, and ethical leadership. So, is decentralization a panacea? Probably, a better question would be, Are we ready to fight for a world where it has any chance of succeeding? What do you think?\n\n",
    "post_url": "https://www.reddit.com/r/blockchaindeveloper/comments/1hid3z2/decentralization_is_this_the_future_of_digital/",
    "score": 7,
    "author": "Rough_Play_4288",
    "created_utc": 1734673494.0,
    "num_comments": 2,
    "subreddit": "blockchaindeveloper",
    "comments": "\n  └─ I agree, I believe that the future is in the hands of users of what will be created and implemented on blockchain networks, I would really like to be part of this blockchain development community, if you have tips on where to seek knowledge and where to start it will be of great help! Merry Christmas and a great new year! And of course friends, don't forget to buy your $atoshis!!!\n     Score: 1 | Author: oanjo_\n\n  └─ That is the vision behind NEAR and NEAR.AI\n\nhttps://youtu.be/Q4_YTXhq7no?si=l1NyJ3GsEvoi9dPV\n     Score: 1 | Author: frolvlad"
  }
]