[
  {
    "post_id": "1hnpg40",
    "post_content": "It’s like a sixth sense now, I just know somehow. \n",
    "post_url": "https://i.redd.it/53fompsllg9e1.jpeg",
    "score": 333,
    "author": "Porespellar",
    "created_utc": 1735334899.0,
    "num_comments": 45,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ MUST. DOWLOAD.\n     Score: 56 | Author: NickNau\n\n      └─ MUST. DOWLOAD.\n         Score: 0 | Author: Ok-Protection-6612"
  },
  {
    "post_id": "1hncfhc",
    "post_content": "New model from qwen of sonnet level soon ? \n",
    "post_url": "https://i.redd.it/d38tr8vsfd9e1.jpeg",
    "score": 315,
    "author": "Evening_Action6217",
    "created_utc": 1735296628.0,
    "num_comments": 40,
    "subreddit": "LocalLLaMA",
    "comments": "\n  └─ i wait you then\n     Score: 97 | Author: 330d\n\n      └─ Wait us\n         Score: 18 | Author: ThenExtension9196"
  },
  {
    "post_id": "1hnxu3c",
    "post_content": "Parents of OpenAI Whistleblower Don't Believe He Died By Suicide, Order Second Autopsy\n",
    "post_url": "https://sfist.com/2024/12/26/parents-of-openai-whistleblower-dont-believe-he-died-by-suicide-order-second-autopsy/",
    "score": 32,
    "author": "MetaKnowing",
    "created_utc": 1735360106.0,
    "num_comments": 6,
    "subreddit": "artificial",
    "comments": "\n  └─ Watching America turn into a second world country sucks balls.\n     Score: 3 | Author: _meaty_ochre_\n\n      └─ We’re being upgraded??\n         Score: 1 | Author: The_Shryk"
  },
  {
    "post_id": "1hnbnmo",
    "post_content": "Won't there a point in time when AI figures out financial markets ?\nit seems so easy to analyse millions of data point, why won't they be able to predict markets ?\n\nand who would not use it and break the world ? nobody\n\nwon't that hapen in the coming years ?",
    "post_url": "https://www.reddit.com/r/artificial/comments/1hnbnmo/wont_there_a_point_in_time_when_ai_figures_out/",
    "score": 15,
    "author": "Tyaigan",
    "created_utc": 1735293273.0,
    "num_comments": 92,
    "subreddit": "artificial",
    "comments": "\n  └─ The market prediction challenge isn't just about processing data - it's about dealing with human behavior, policy changes, and countless external factors that can instantly shift markets. Even with perfect data analysis, you can't predict unexpected events like geopolitical crises or natural disasters.\n\n\n\nI've been working with various AI models at jenova ai, and while they're incredibly powerful at analyzing patterns, they still can't reliably predict complex dynamic systems like markets. They're tools that enhance decision-making, not crystal balls.\n\n\n\nThink of it like weather forecasting - we can process massive amounts of atmospheric data, but accuracy still drops significantly beyond a few days because of the system's complexity.\n     Score: 65 | Author: DependentPark7975\n\n      └─ Brownian, by definition. You can predict, just not very far until the future due to the chaotic nature of the stock market.\n         Score: 8 | Author: randomrealname"
  },
  {
    "post_id": "1hnlshs",
    "post_content": "Best advice \n",
    "post_url": "https://i.redd.it/opd2j2uqsf9e1.jpeg",
    "score": 743,
    "author": "IlustriousTea",
    "created_utc": 1735325193.0,
    "num_comments": 264,
    "subreddit": "singularity",
    "comments": "\n  └─ Best advice is to keep stockpiling your money, you may need it later.\n     Score: 128 | Author: w1zzypooh\n\n      └─ Building savings is always a good idea.\n         Score: 60 | Author: Ignate"
  },
  {
    "post_id": "1hnhmpm",
    "post_content": "Quantum teleportation achieved over existing internet cable\n[https://thequantuminsider.com/2024/12/27/northwestern-engineers-achieve-quantum-teleportation-over-existing-internet-cable/](https://thequantuminsider.com/2024/12/27/northwestern-engineers-achieve-quantum-teleportation-over-existing-internet-cable/)\n\nNo ping deathmatch?",
    "post_url": "https://www.reddit.com/r/singularity/comments/1hnhmpm/quantum_teleportation_achieved_over_existing/",
    "score": 398,
    "author": "Skumball404",
    "created_utc": 1735314290.0,
    "num_comments": 202,
    "subreddit": "singularity",
    "comments": "\n  └─ “the team successfully transmitted quantum information alongside high-speed Internet signals over a 30-kilometer cable”\n\nIs this a distance limit for the technique?\n     Score: 122 | Author: hellolaco\n\n      └─ No, it's incidental. Their next aim is to test on existing infrastructure.\n         Score: 81 | Author: AuodWinter"
  },
  {
    "post_id": "1hnejza",
    "post_content": "Instantly visualize any codebase as an interactive diagram using Claude 3.5 Sonnet - GitDiagram\n",
    "post_url": "https://v.redd.it/pxd1exhs4e9e1",
    "score": 261,
    "author": "DiamondsWorker",
    "created_utc": 1735305065.0,
    "num_comments": 45,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ After trying to contribute to some open source projects, I realized their codebases are way too massive for me to dig through manually, so I built this to help me understand where to start! I decided to use Claude 3.5 Sonnet since this uses only the file tree and readme for context and Claude seems to be the most technical LLM. Try it for free at [https://gitdiagram.com/](https://gitdiagram.com/)\n     Score: 35 | Author: DiamondsWorker\n\n      └─ Wow I was actually searching for something like this.\n         Score: 3 | Author: mihir_42"
  },
  {
    "post_id": "1hnu5hi",
    "post_content": "I’m sure the people that have no idea what Claude is will definitely understand this 🙄\nTheir marketing absolutely sucks\n",
    "post_url": "https://i.redd.it/cn8bphzxoh9e1.jpeg",
    "score": 214,
    "author": "DDrizzle420",
    "created_utc": 1735348143.0,
    "num_comments": 60,
    "subreddit": "ClaudeAI",
    "comments": "\n  └─ It’s part of an awareness campaign. I saw a couple in NYC when I was up there a few months ago. I think it’s fine. The problem with where we are on adoption curve for consumers re the frontier models pro plans is that while ChatGPT dominated early adopter mindshare through explosive consumer growth, Anthropic took a different path focusing first on enterprise, capabilities, safety. \n\nNow as the market matures beyond early adopters into practical business use, these awareness campaigns are about positioning Claude as a serious, proven option as more users are ready to move from AI hype to actual implementation. The “Do, not doubt” messaging fits this moment - it’s less about convincing people AI is amazing and more about telling a broader audience it’s time to actually start using these tools.​​​​​​​​​​​​​​.. and here’s the one to give real consideration to.\n\nIt also looks like it’s in DC so might be working on another level in that context as well.\n     Score: 53 | Author: decorrect\n\n      └─ Well said. This is in the windy city\n         Score: 1 | Author: DDrizzle420"
  },
  {
    "post_id": "1hnf7mt",
    "post_content": "OpenAI says it needs 'more capital than we’d imagined' as it lays out for-profit plan - I mean, he did say $7 Trillion... \n",
    "post_url": "https://www.cnbc.com/2024/12/27/openai-needs-more-capital-than-wed-imagined-moves-to-for-profit.html",
    "score": 530,
    "author": "Xtianus21",
    "created_utc": 1735307223.0,
    "num_comments": 101,
    "subreddit": "OpenAI",
    "comments": "\n  └─ Has Sam Altman asked ChatGPT on how to become profitable?\n     Score: 191 | Author: planet_janett\n\n      └─ o3 is still thinking on this one\n         Score: 103 | Author: OrangeESP32x99"
  },
  {
    "post_id": "1hnjn3r",
    "post_content": "Parents of OpenAI Whistleblower Don't Believe He Died By Suicide, Order Second Autopsy\n",
    "post_url": "https://sfist.com/2024/12/26/parents-of-openai-whistleblower-dont-believe-he-died-by-suicide-order-second-autopsy/",
    "score": 317,
    "author": "MetaKnowing",
    "created_utc": 1735319596.0,
    "num_comments": 51,
    "subreddit": "OpenAI",
    "comments": "\n  └─ I don't think this is necessarily good grounds for suspicion. Parents whose child has just committed suicide are going to be in shock and disbelief. It's very rare for parents in this scenario even to have been aware of their child's mental health issues. So often, deeply depressed people hide their pain and sadness from their family the most of all. So, of course they're shocked! Their child, their beloved child, is dead out of nowhere, because in all likelihood he was specifically hiding it from them. What parent wouldn't want a second autopsy?\n\nYou know, maybe I'm wrong. I just think that it's important to inject this note of caution. Parents being sad and shocked when their son commits suicide, wanting answers to questions too difficult to ask, isn't suspicious or interesting. It's just sad.\n     Score: 59 | Author: JosephRohrbach\n\n      └─ > Their child, their beloved child, is dead out of nowhere, because in all likelihood he was specifically hiding it from them. What parent wouldn't want a second autopsy?\n\nIt's not that they're hiding it willfully.\n\nThere's just no societal support/understanding for mental health issues.\n\nI'm 48 and STILL coming to terms with my mental health.\n\nI suffer from depression and for the most part it's mild but it can be triggered by the environment.\n\nIt also doesn't just hit me all at once like an illness. It slowly manifests itself.\n\nI've come to realize that, if at the end of the day, I feel a \"fuck it\" or cynical attitude then I'm probably depressed.\n\nIt's taken me DECADES to realize this though.\n\nAlso, unlike a physical disability, like lost fingers, corporations are NOT willing to give you any help with depression.\n\nI asked my previous employer for support and they basically scoffed at me and told me that I either just 'deal with it' or that I should find a new job.\n\nThe ADA just doesn't work for people with mental health illness.\n\nIt makes me angry because the tech industry in the bay area pretends to be very liberal and open minded but in reality they're not. Not unless you're gay, black, trans, etc.\n\nIf you're just a guy with a mental health issue you're dead weight.\n         Score: 12 | Author: brainhack3r"
  },
  {
    "post_id": "1hnnl6s",
    "post_content": "[D] The Parallelism Tradeoff: Understanding Transformer Expressivity Through Circuit Complexity\nTalk: https://www.youtube.com/watch?v=7GVesfXD6_Q\n\nPaper: https://aclanthology.org/2023.tacl-1.31/\n\nTL;DR the author (Will Merrill) looks at transformers from a circuit complexity perspective and places them in the TC^0 complexity class - threshold circuits of constant depth. This is a relatively restricted complexity class that cannot solve many inherently sequential problems.\n\nTheir main point is that the expressive limitations of transformers come from their parallel nature, rather details of their architecture. Adding chain of thought allows transformers to solve problems from additional complexity classes, but at the cost of sacrificing parallelism and efficient training.\n\nThey suggest that this tradeoff between parallel and sequential computation cannot be avoided, and future architectures should be designed with the tradeoff in mind. They also look at an extension to state space models that makes the tradeoff more efficiently than transformers+CoT.",
    "post_url": "https://www.reddit.com/r/MachineLearning/comments/1hnnl6s/d_the_parallelism_tradeoff_understanding/",
    "score": 82,
    "author": "currentscurrents",
    "created_utc": 1735329915.0,
    "num_comments": 11,
    "subreddit": "MachineLearning",
    "comments": "\n  └─ Awesome paper--thanks for sharing.\n     Score: 10 | Author: Mbando"
  },
  {
    "post_id": "1hna801",
    "post_content": "[P] REINFORCE++: A Simple and Efficient Approach for Aligning Large Language Models\nRLHF (Reinforcement Learning from Human Feedback) is rapidly evolving, with algorithms such as PPO, DPO, RLOO, ReMax and GRPO emerging one after another. **By integrating various optimization techniques from Proximal Policy Optimization (PPO) into the traditional REINFORCE algorithm**, we “proposed” **REINFORCE++,** which aims to enhance performance and stability in RLHF while reducing computational resource requirements without the critic network.\n\n**The key feature of REINFORCE++ is that it is more stable than GRPO and faster than PPO.**\n\n**REINFORCE++'s** technical details are in:\n\n[https://hijkzzz.notion.site/reinforce-plus-plus](https://hijkzzz.notion.site/reinforce-plus-plus)\n\nand (technical report)\n\n[https://github.com/hijkzzz/Awesome-LLM-Strawberry/blob/main/resources/REINFORCE%2B%2B.pdf](https://github.com/hijkzzz/Awesome-LLM-Strawberry/blob/main/resources/REINFORCE%2B%2B.pdf)",
    "post_url": "https://www.reddit.com/r/MachineLearning/comments/1hna801/p_reinforce_a_simple_and_efficient_approach_for/",
    "score": 41,
    "author": "seventh_day123",
    "created_utc": 1735286725.0,
    "num_comments": 5,
    "subreddit": "MachineLearning",
    "comments": "\n  └─ Really interested how the application of RL to LLMs is going to improve RL itself. Maybe someone could try REINFORCE++ on some classic RL benchmarks. I'm too lazy lol. Every time I've done RL I've ended up needing to do everything from scratch because the libraries seem to always be outdated and incompatible.\n     Score: 6 | Author: Dangerous-Goat-3500"
  },
  {
    "post_id": "1hnts31",
    "post_content": "Asked Chat for its hottest take… \n",
    "post_url": "https://www.reddit.com/gallery/1hnts31",
    "score": 1615,
    "author": "maxcoffie",
    "created_utc": 1735347013.0,
    "num_comments": 158,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Your post is getting popular and we just featured it on our Discord! [Come check it out!](https://dsc.gg/rchatgpt)\n\nYou've also been given a special flair for your contribution. We appreciate your post!\n\n*I am a bot and this action was performed automatically.*\n     Score: 1 | Author: WithoutReason1729"
  },
  {
    "post_id": "1hnhp69",
    "post_content": "I asked Chat to generate a cursed image of a snowman with human skin. Help\n",
    "post_url": "https://i.redd.it/vdi5a3owwe9e1.jpeg",
    "score": 537,
    "author": "Maneaterx",
    "created_utc": 1735314487.0,
    "num_comments": 63,
    "subreddit": "ChatGPT",
    "comments": "\n  └─ Hey /u/Maneaterx!\n\nIf your post is a screenshot of a ChatGPT conversation, please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://dsc.gg/rchatgpt)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*\n     Score: 1 | Author: AutoModerator"
  }
]