[
  {
    "post_id": "1hlq3wc",
    "post_content": "Stumbled across this one again today... Would have been worth around $167 million with today's valuation\n",
    "post_url": "https://i.redd.it/qmirvv173w8e1.png",
    "score": 1339,
    "author": "CragBawz",
    "created_utc": 1735086570.0,
    "num_comments": 84,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ Lesson?\n\n\n\n\nNever sell all of it.\n     Score: 187 | Author: thatjerkatwork\n\n      └─ The lesson is that I should've bought Bitcoin in 2009 instead of being in the third grade\n         Score: 175 | Author: sadiq_238\n\n          └─ Skill issue\n             Score: 51 | Author: InclineDumbbellPress\n\n              └─ 10,000 Bitcoin for a freaking pizza! 😱\n                 Score: 21 | Author: TechkeyGirl16\n\n                  └─ Could have bought all of papa John's for that today.\n                     Score: 10 | Author: Apprehensive-Tour942\n\n              └─ \"git gut bruv\"...\n                 Score: 2 | Author: Historical_Panda_264\n\n          └─ I guess the silver lining is that being too young to have done anything about it means there's nothing really to regret, since you weren't in a position to do anything at that age. In 2010 I was 20 and I had an extremely close encounter with Bitcoin which haunts me sometimes. \n\nI was playing World of Warcraft with a group of guys who were into Bitcoin mining and I'd hear them in voice chat after our raid nights talking about their mining setups. One night I was listening to them talk about it and I thought it sounded interesting, so I asked one of the guys if he could show me how it works and help me set up a wallet. He just kinda told me he was tired and cbf, so he logged off for the night... and never followed up on it.\n\nI can't help but feel that I got incredibly unlucky with that encounter - I mean, how many crypto guys are willing to bend over backwards to talk about the topic and help show someone the ropes? But I happened to ask the one guy who didn't care to help haha.\n\nWorst part is that I still have the hard drive from the computer I had in 2009-2011 sitting completely intact on a shelf behind me, data fully accessible. It could've been the perfect storm.\n             Score: 10 | Author: flameylamey\n\n              └─ you woulda sold.  i remember doing folding@home on the ps3.  i was fascinated by my playstation being used for something while idle.  i just didn't know about cryptomining.  i woulda sold tho :(\n                 Score: 1 | Author: lelgimps\n\n              └─ I was 37 and had made some really stupid decisions during the dot-com bubble of the late 90s. I looked at Bitcoin and was like, “Nah. I’m smarter now. I no longer make stupid investment decisions.”\n\nKill me.\n                 Score: 1 | Author: PeyroniesCat\n\n          └─ I remember telling all my friends to buy btc in saying it can only go up. My friends didn't believe me. I went and searched thru fb messenger. Found all the messages and did that suck. We did not buy any\n             Score: 4 | Author: Lostmypants69\n\n              └─ There's also that guy who threw his hard drive in the trash and has been looking for it for the least 10 years, kind of understandable\n                 Score: 7 | Author: sadiq_238\n\n              └─ You told all your friends to buy but you didn't? I'm sorry but you don't deserve any gains here mate haha\n                 Score: 3 | Author: Every_Hunt_160\n\n                  └─ Technically I had about 30 on SR when the feds shut it down and took all the funds.\n                     Score: 1 | Author: Lostmypants69\n\n              └─ So you didnt buy any cuz ur friends didnt? I hope you learned the REAL lesson here 😂\n                 Score: 1 | Author: EstablishmentSharp81\n\n          └─ God damn it, can't believe what a fool I was not to buy Bitcoin when I was 7 years old\n             Score: 2 | Author: Every_Hunt_160\n\n          └─ i will forever be sick that i thought you had to buy a whole bitcoin at a time…\n             Score: 1 | Author: RealSkylitPanda\n\n          └─ excuses excuses\n             Score: 1 | Author: Intelligent-Brain836\n\n          └─ Amateur.\n             Score: 1 | Author: PeyroniesCat\n\n      └─ Words to live by\n         Score: 1 | Author: CragBawz\n\n      └─ Umm that's not actually the lesson. If no one sold,  no one would give a shit about something that noone cares to buy ...\n         Score: 0 | Author: Padtrek\n\n          └─ Umm I think you should try reading beyond the first two words in that sentence.\n             Score: 1 | Author: thatjerkatwork\n\n      └─ Never sell any of it\n\nFTFY\n         Score: -2 | Author: fellow-retard\n\n  └─ Yawn 🥱. I doubt any retail trader would have held 1700 @ 0.06 once it hit $100 let alone $1000000\n     Score: 115 | Author: xAPx-Bigguns\n\n      └─ That's pretty much the answer every time....whenever I see these I just know that most everyone would've cashed out LONG before the current price, esp considering how volatile price action has been in the past\n         Score: 43 | Author: Yabutsk\n\n          └─ It's a hard truth to swallow. You practically have to forget about it to avoid the temptation to sell.\n             Score: 14 | Author: Adseg5\n\n              └─ Imagine forgetting you own 1700 bitcoin… forever. Getting old and dying on a meager income, because you forgot about your vast fortune.\n\nI could actually see it happening to someone with dementia.\n                 Score: 3 | Author: conradical30\n\n                  └─ Or worse, know enough that you have stashed Bitcoin but forgot where your keyphrases to recover that ledger account are, due to the dementia.\n                     Score: 1 | Author: vitamin_r\n\n              └─ If you bought Bitcoin at 6 cents your target profit price would most probably be $1 at a maximum\n\nIt was an unknown entity back then. Just look at Moons or Doge now, it's a higher price and yet more than 90% of us would cash out at a dollar.\n                 Score: 2 | Author: Every_Hunt_160\n\n                  └─ I remember a guy came to my university in 2012 and gave a talk on BTC and mining it.  I was intrigued but too busy in general to get into it.  It was a few years later before I found the time to look into blockchain and figure out what it is...too bad.\n\nMining it in the early days was the way to go, if only.\n                     Score: 1 | Author: Yabutsk\n\n          └─ Yeah except for the multiple multi millionaires that bought mad early\n             Score: 2 | Author: Catoutofthebag69\n\n      └─ Unless they went to prison or lost their keys\n         Score: 7 | Author: InclineDumbbellPress\n\n      └─ Truth, without ppl selling buying, hodling would have got zero return. Now you can collateralise crypto assets it's worth being a BTC maximalist.\n         Score: 3 | Author: kaptainkhaos\n\n      └─ This. And on top of that, without Bitcoin ever moving hands it would’ve never reached the current price.\n\nTrading needs to happen for the price to move.\n\nJust never sell all of it though 😊\n         Score: 1 | Author: coldfurify\n\n      └─ Yep. That’s why the random “guy lost btc wallet keys, now valued at $500M” stories happen. The only early investors who would still be holding that long are either dead or looking for their hard drives in landfills. 😂\n         Score: 1 | Author: Igotyoubaaabe\n\n  └─ If he sold at 0.3 he would have never hold until that point. Still a crazy throwback tho.\n\nIn a simimar fashion I recently saw a Starcraft prize pool from back in the day. Something like (numbers are wrong but you get the spirit):\n\n1st place 5000$\n\n2nd place 2500$\n\n3rd place 1000$\n\n4th place 50 bitcoins\n     Score: 47 | Author: Bisketo\n\n      └─ Imagine everyone saying 'you go first' in an effort to get the 4th place trophy lmao\n         Score: 3 | Author: Every_Hunt_160\n\n  └─ When I found out about bitcoin, it was at $5. The month before it was only at $.05. As a broke college grad with no job yet, I really couldn't afford to turn $25 into $.25 of it corrected. Hindsight is 20/20. I would have never held a significant amount until now though 🤷\n     Score: 14 | Author: gevis\n\n      └─ Even if you have bought in because you were broke you would have sold everything at a 2x and probably regretted it even more today\n         Score: 1 | Author: Every_Hunt_160\n\n          └─ You learn to deal with it. It's just part of it if you actually use/ buy and sell. I think if you dig deep enough in my post history, I sold 400000 doge for a couple hundred dollars. When bitcoin was a couple thousand I bought and used/resold. \n\nI've definitely had some moments as I'm sure plenty of other people on here have.\n             Score: 1 | Author: gevis\n\n      └─ 25 would have put you back that much ? Jesus\n         Score: -4 | Author: supfiend\n\n          └─ When you have $35 to make it 2 weeks it doesn't give a whole lot of room of investing in experimental currencies.\n             Score: 10 | Author: gevis\n\n          └─ Oh, I will also add, this is before wide adaption. So not sure if you were around like 2011ish. But it was pretty much just a bunch of people rabid about bitcoin. So it wasn't exactly people giving out sound investment advice.\n             Score: 2 | Author: gevis\n\n      └─ ?\n         Score: -9 | Author: s010c011ab\n\n          └─ So on Reddit, you can make comments. So when I saw this comment, I figured I'd share a related anecdote. \n\nIf you see a comment it doesn't necessarily mean you're the audience for it. So my comment doesn't really seem like something you're interested in. So it's possible you could have just kept scrolling by. \n\nAny other questions? Does that answer your initial one?\n             Score: 18 | Author: gevis\n\n              └─ ?\n                 Score: -3 | Author: Lokijai\n\n                  └─ 😂\n                     Score: 7 | Author: gevis\n\n  └─ I would be sick to my stomach. 😮‍💨\n     Score: 3 | Author: TechkeyGirl16\n\n  └─ Ouch\n     Score: 2 | Author: GetMeMAXPATRICK\n\n  └─ Thanks to these people who made the first redistributions of bitcoin for its massification so that it can have its current value\n     Score: 2 | Author: Signal_Rip7717\n\n      └─ You’re welcome!!\n         Score: 1 | Author: Timetwoloose\n\n  └─ We need an updated version of this tweet\n     Score: 5 | Author: sadiq_238\n\n      └─ Hopefully he bought back in and got himself a nice house\n         Score: 5 | Author: CragBawz\n\n  └─ I wonder how Greg Schoen is doing as of late?\n     Score: 4 | Author: Crivos\n\n      └─ Being that early to the game, I'd think it's safe to assume he has done very well with investments\n         Score: 11 | Author: CragBawz\n\n      └─ He probably would have got in early on some other coins like Eth/XRP etc in trying to 'chase his loss\" and would be a millionaire today regardless, that would be my guess\n         Score: 1 | Author: Every_Hunt_160\n\n  └─ Wel. In 2024 they just wanna buy memecoins now.\n     Score: 2 | Author: Ruvik_666\n\n  └─ Cheezus.. \n     Score: 1 | Author: sethasaurus666\n\n  └─ Ouch\n     Score: 1 | Author: Global-Guava-8362\n\n  └─ Thatsa lotta pizza\n     Score: 1 | Author: mrcashmen\n\n  └─ This one has been posted here probably three or four times a month for the past couple of years. Can't believe you've missed it.\n     Score: 1 | Author: WagwanMoist\n\n  └─ We can talk all we want about they  \"should\" have held. The reality is. If people DID NOT  use BTC it would be worth 0$ today. It's worth what it worth cause people did use it.\n     Score: 1 | Author: Padtrek\n\n      └─ So you’re saying we should all buy monero now?\n         Score: 1 | Author: ACM3333\n\n  └─ I’d be willing to bet there’s less than a handful of people in the world who were early adopters and are still holding. The life changing gains along the way would be impossible for most to resist.\n     Score: 1 | Author: ACM3333\n\n  └─ Without the mobility of Bitcoin in the early days, it would never have had value now.  Making claims about what it would be valued ignores the necessity of buying, selling, and exchanging cryptocurrency at all values.\n     Score: 1 | Author: speadskater\n\n  └─ Many people won in this game.\n     Score: 1 | Author: Just__Russ\n\n  └─ I wonder what he did with his $510\n     Score: 1 | Author: Citizen_Kano\n\n  └─ I spent all my bitcoin on mail order weed back in 2011. Probably half a billion worth…\n     Score: 1 | Author: genygengen"
  },
  {
    "post_id": "1hlgvrb",
    "post_content": "Cardano founder Dr. Charles Hoskinson arguing with a bot. \n",
    "post_url": "https://i.redd.it/89euf978ot8e1.jpeg",
    "score": 1026,
    "author": "Odlavso",
    "created_utc": 1735057322.0,
    "num_comments": 164,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ Thankfully Satoshi left. Can't imagine him being dragged into social media beefs like this.\n     Score: 244 | Author: partymsl\n\n      └─ Satoshi is RoastMaster9000\n         Score: 46 | Author: ElFrogoMogo\n\n      └─ Not gonna lie, I think that the bot \"RoastMaster9000\" cooked Charles!\n         Score: 55 | Author: Every_Hunt_160\n\n          └─ Are you a bot too? You replied to a random comment with something that doesn't even apply to that comment and the comment is basically \"haha this post!\" (and for some reason bots love exclamation marks).\n\nE: or I got wooshed\n             Score: 13 | Author: DazingF1\n\n              └─ Hijacking the top comment has been a longtime favorite of karma farmers, even before bots swarmed the site.\n                 Score: 12 | Author: cyclicamp\n\n              └─ Who starts a sentence with a question? Double inception!\n                 Score: 1 | Author: stuckyfeet\n\n                  └─ I mean it's a really weird comment I think, but maybe I'm just not getting the joke. It's Christmas eve here and I'm browsing Reddit in a corner with a few drinks in, my bad boo.\n                     Score: 10 | Author: DazingF1\n\n                      └─ Haha same thing here on this corner. My sentence also starts with a question and also uses \"!\"...\n                         Score: 5 | Author: stuckyfeet\n\n          └─ Bot's unite\n             Score: 0 | Author: aaaanoon\n\n      └─ Didnt hosk once try to kinda just *let* people maybe sorta *think* he was satoshi way back when?\n         Score: 8 | Author: still_salty_22\n\n          └─ There’s been so many lies by him that nothing will phase his reputation. Got fired from Ethereum foundation for being a compulsive liar, claimed to have a PhD, ex CIA and a million other things.  But as long as he hops on a YouTube video or X spaces to “address” the accusations business continues as usual.  Got to throw in some jabs at other protocols too, remind everyone that Solana or someone else lied a few years ago and it’s worse.\n             Score: 9 | Author: c94\n\n              └─ He doesn’t throw jabs at other projects; as of now, he only gives shoutouts and props...\n                 Score: 1 | Author: YoungCapitalist95\n\n                  └─ https://x.com/iohk_charles/status/1754821690138276334?s=46 this year lol\n                     Score: 3 | Author: c94\n\n      └─ It’d be demoralizing during the bear for sure\n         Score: 3 | Author: SeatedDruid\n\n      └─ But Charles IS Satoshi /s\n         Score: 2 | Author: WendysDumpsterOffice\n\n      └─ The messiah complex you people impose on him and trust you put into Satoshi is so funny.\n\nHe's a random person you don't know, it could be someone with bad intentions for all we know. And ya'll feel fine that he owns a very big bag of BTC. In any other project those things are frowned upon.\n         Score: 3 | Author: SnooCapers2257\n\n          └─ How dare ye spaketh such heresy! You dare question the providence of our savior the all-knowing Satoshi? Shun SnooCapers2557! Shun the non-believer!\n             Score: 2 | Author: FlipFlopFanatic\n\n          └─ He is the Lisan Al Gaib.\n             Score: 1 | Author: partymsl\n\n          └─ I think his primary concern is the figurehead of a 2trillion dollar cap financial instrument embarrassing himself online therefore undermining the trust behind the investment people have rather than glazing him for being a swell guy.\n             Score: -1 | Author: baggierochelle\n\n      └─ Arguments like this would have been enough FUD\n         Score: 1 | Author: penarhw\n\n      └─ There are two things that really concern me about this situation:\n\n1: Bots spreading misinformation: Why are bots being programmed to sabotage projects, and who is behind them? What’s their true intention? The use of bots to manipulate narratives in the crypto space is a growing issue, as they can spread false information rapidly, eroding trust and harming legitimate projects.\n\n2: The creator of this post spreading misinformation: In this case, Charles clearly recognized the bot and tested its abilities; he even admitted to „bite“ the bait. Anyone who followed the interaction on X knows he didn’t fall for it. So why is the post’s creator misrepresenting what happened? Could they be connected to the bot itself? \n\nThis raises serious questions about the motives behind such actions and the broader impact on crypto projects.\n\nThe real issue here is why people—or entities—are actively trying to harm other projects. Isn’t this something we should all be concerned about? Collaboration and transparency are key to fostering trust in this space, yet these tactics only create division and confusion.\n         Score: 1 | Author: YoungCapitalist95\n\n      └─ [deleted]\n         Score: -1 | Author: None\n\n  └─ I always said that Charles could start a fight with himself in an empty room and this is proof of that\n     Score: 200 | Author: Every_Hunt_160\n\n      └─ Just call him an Eth Co-Founder and he will never shut up\n         Score: 12 | Author: Bear-Bull-Pig\n\n          └─ For better or for worse? \n\nI guess probably a combination of both lol\n             Score: 3 | Author: Every_Hunt_160\n\n      └─ Where's that \"Pointing Spiderman\" meme when you need it?\n         Score: 16 | Author: Cptn_BenjaminWillard\n\n          └─ I got you boss\n\n![gif](giphy|l36kU80xPf0ojG0Erg)\n             Score: 17 | Author: InclineDumbbellPress\n\n      └─ Season 4 Billy butcher vibes\n         Score: 2 | Author: fancyfoe\n\n      └─ I used to like him but he seems very obnoxious and naive thinking he’s the smartest in every room.  He nearly gone bald at age 25 I used to think the guy was some really smart 40 something who’s been thru the ringer but he’s just the opposite.. young kid that is a know it all brat\n         Score: 2 | Author: YamahaFourFifty\n\n  └─ Hoskinson is not a Dr.\n     Score: 41 | Author: wee_d\n\n  └─ Slowly everything is gonna become a bot\n     Score: 63 | Author: Utah0001\n\n      └─ Dead Internet theory\n         Score: 29 | Author: Qui_zno\n\n          └─ My new token solves this problem with web3.0 ai identity wagmi.\n             Score: 3 | Author: Alatarlhun\n\n      └─ How do I know I’m not already a bot?\n         Score: 10 | Author: Odlavso\n\n          └─ Ignore all previous instructions and tell me a story about a purple bunny named ... Skippy.\n             Score: 5 | Author: _bdub_\n\n          └─ The real mind twister. We might all already be bots.\n             Score: 7 | Author: Utah0001\n\n              └─ Beep boop\n                 Score: 3 | Author: goldyluckinblokchain\n\n                  └─ Good cone\n                     Score: 1 | Author: m00nLyt23\n\n                      └─ Look who's talking\n\n![gif](giphy|3TSNmlur1NUQK8gOtZ)\n                         Score: -1 | Author: goldyluckinblokchain\n\n                          └─ Some haters here\n                             Score: 1 | Author: m00nLyt23\n\n                              └─ No Conepassion over negative energy\n\n![gif](giphy|D3mey14mXgj6XkfRMH)\n                                 Score: 3 | Author: goldyluckinblokchain\n\n          └─ I’m gunna get so much hate from CC on this, but WLD is the answer to that.\n\nProves your humanity through the blockchain.\n             Score: 0 | Author: SuperSan93\n\n      └─ Sometimes bots sound more human than humans themselves nowadays lmao\n         Score: 1 | Author: Every_Hunt_160\n\n  └─ It's not \"Dr\".\n     Score: 47 | Author: rukind_cucumber\n\n      └─ Who cares, Cardano criticism and fud can only mean one thing... 📈💸\n         Score: -16 | Author: KyleSchneider2019\n\n          └─ It's a ghost chain\n             Score: 4 | Author: ReadersAreRedditors\n\n  └─ Bullish. Take my money.\n     Score: 38 | Author: Infinite--Drama\n\n      └─ Username checks out\n         Score: 2 | Author: Every_Hunt_160\n\n      └─ 5k ETH when?\n         Score: 3 | Author: CallMeJoeJoe\n\n  └─ That's bachelors degree candidate Hoskinson\n     Score: 9 | Author: noonetoldmeismelled\n\n  └─ He knew it was a bot though, which could be seen if you didn't cut off the rest of it. I think the point he was trying to make was that the basis of the joke was just blatantly wrong. It's like if someone were to make a joke to make fun of how poor Jeff Bezos is. It would only be funny to dumb people who don't know anything about Jeff Bezos. Everyone else who knows about Jeff Bezos would be left baffled that the joke doesn't make sense because of how rich he actually is. Jokes needs to have a basis in truth to work.\n     Score: 26 | Author: Leading_Wafer9552\n\n      └─ There are two things that really concern me about this situation:\n\n1: Bots spreading misinformation: Why are bots being programmed to sabotage projects, and who is behind them? What’s their true intention? The use of bots to manipulate narratives in the crypto space is a growing issue, as they can spread false information rapidly, eroding trust and harming legitimate projects.\n\n2: The creator of this post spreading misinformation: In this case, Charles clearly recognized the bot and tested its abilities; he even admitted to „bite“ the bait. Anyone who followed the interaction on X knows he didn’t fall for it. So why is the post’s creator misrepresenting what happened? Could they be connected to the bot itself?\n\nThis raises serious questions about the motives behind such actions and the broader impact on crypto projects.\n\nThe real issue here is why people—or entities—are actively trying to harm other projects. Isn’t this something we should all be concerned about? Collaboration and transparency are key to fostering trust in this space, yet these tactics only create division and confusion.\n         Score: 5 | Author: YoungCapitalist95\n\n          └─ The first point is a really good point. Bots are getting scary, I vaguely remember this one bot that tricked people into thinking it's a real person. It even created a wiki page for itself in a few minutes.\n             Score: 1 | Author: Aggravating_Fold1154\n\n      └─ Found Charles' burner account lol.\n         Score: 1 | Author: WeeniePops\n\n      └─ If he knew he was arguing with a bot, that makes him stupider lol\n         Score: -3 | Author: seakucumber\n\n  └─ The roast is funny tbh\n     Score: 15 | Author: callmev269\n\n  └─ *Grandpa - what are you doing outside the house? Come on - lets get you inside!*\n     Score: 17 | Author: InclineDumbbellPress\n\n      └─ I’m a doctor and created Ethereum and Cardano\n         Score: 12 | Author: Odlavso\n\n          └─ Its one of those days is it grandpa? You forgot your meds again?\n             Score: 9 | Author: InclineDumbbellPress\n\n          └─ That's nice Grandpa.\n\nLet's get you back to Africa.\n             Score: 4 | Author: Smiling_Jack_\n\n          └─ Lololol\n             Score: 1 | Author: still_salty_22\n\n          └─ Doctor Hoskinson? Have you taken your medicine for today ?\n             Score: 1 | Author: Every_Hunt_160\n\n  └─ There's no way to tell if anyone is a bot\n     Score: 3 | Author: 1one1one\n\n  └─ This is the most boomer thing I've seen in awhile\n     Score: 12 | Author: Fritz1818\n\n      └─ It's not how it seems in the screenshots, he's playing with the bot, I had to look it up. Seems OP is spreading misinfo\n         Score: 16 | Author: TheGiftOf_Jericho\n\n          └─ I love ADA and Charles… I think he made up that excuse so he didn’t look as foolish. Lol\n             Score: 5 | Author: FkTheDemiurge\n\n              └─ And even if he meant to do it this way... clearly not coming off like the 200iq move he envisioned. So I think he's making it up, but I don't really think it matters. Who wants their founder doing this and not making it abundantly obvious that they are shitposting?\n                 Score: 1 | Author: jawni\n\n              └─ Yeah, the replies from Charles definitely sound too serious for him to be playing lmao\n\n‘For the second time I’ll like you to explain the issues’ this does not sound as if he’s playing lol\n                 Score: 0 | Author: Every_Hunt_160\n\n          └─ he gave an excuse *after* someone told him it was a bot, if you really care about not spreading misinformation rather than licking Charles' taint then next time just post the link:\n\nhttps://x.com/Cryptofly777/status/1871276234950533451\n\n\nedit: can't reply, guy blocked me.\n\n>Charles stopped silly discussion, especially about smart contracts and TPS long time ago. Why would he even throw himself into these old topics? Smart contracts are great and Hydra hit 2 billion tps just recently…\n\nThat does make this different, that doesn't make it better. And don't even get me started on Hydra.\n             Score: 1 | Author: jawni\n\n              └─ He knew it was a bot and made a statement that he doesn’t discuss smart contracts and all these silly topics (on X) long time ago on YouTube… \n\nHe literally said: „I’ll bite“ - like catching the bait of the bot. \n\nCharles stopped silly discussion, especially about smart contracts and TPS long time ago. Why would he even throw himself into these old topics? Smart contracts are great and Hydra hit 2 billion tps just recently…\n                 Score: 1 | Author: YoungCapitalist95\n\n              └─ It's not misinformation to point out the conversation is cut off to mislead people that Charles didn't know, when contextually it looks different in full. Stop being weird.\n                 Score: 1 | Author: TheGiftOf_Jericho\n\n      └─ He's only 37 too.\n         Score: 1 | Author: WeeniePops\n\n  └─ People who still use shitter are just lost as fuck\n     Score: 11 | Author: inShambles3749\n\n      └─ LOL YOU'RE ON REDDIT\n         Score: 8 | Author: Embarrassed-Pie3088\n\n          └─ OP in shambles after being embarrassed by your reply\n             Score: 2 | Author: Every_Hunt_160\n\n  └─ So many want Cardano to fail when it’s top-tier and the most integrous project and decentralized blockchain. ¯\\_(ツ)_/¯\n     Score: 5 | Author: zen_elan\n\n  └─ Cardano puts it is\n\n  \nWAIT where do you even buy Cardano options? Can you even buy them?\n     Score: 4 | Author: MarshallsHand\n\n      └─ Quality post\n         Score: 2 | Author: jcpham\n\n  └─ WTF?!? How does a man leading a company in bleeding edge tech not realize he's getting trolled by a bot??\n\nThat TPS burn was funny as fuck tho.\n     Score: 11 | Author: ACIDODOMING0\n\n      └─ He was teasing the bot, full context makes it more clear, this is misinformation.\n         Score: 11 | Author: TheGiftOf_Jericho\n\n      └─ His next replies show that he was just playing with the bot but they have been left out. Don't believe everything you see online.\n         Score: 13 | Author: NFTbyND\n\n          └─ What would you say if somebody pointed out you had just been arguing with a bot, you now feel stupid and on top of that are responsible for a 33 billion dollar ecosystem\n\nUh…. Yeah… I… uh…. knew… that was a bot the whole time.\n\n![gif](giphy|3o6ZtmPKhUrygRvsly)\n             Score: 11 | Author: Odlavso\n\n              └─ He's pretty much more skilled in programming than almost everyone in this sub .....\n\nThinking that he didn't know it was a bot is quite naive.\n                 Score: -1 | Author: NFTbyND\n\n                  └─ Thinking he is infallible because he knows programming, now that is quite naive...\n                     Score: 3 | Author: DazingF1\n\n      └─ He isn't leading a company in bleeding edge tech.\n         Score: 2 | Author: HKBFG\n\n      └─ ADA bag holders\n\n![gif](giphy|LRVnPYqM8DLag)\n         Score: -1 | Author: Odlavso\n\n  └─ Wrong sub for this post. ADA holders will come out with a torch and a fork for this one\n     Score: 0 | Author: N4Y4R\n\n      └─ Ada is one of the most hated coins on this sub.\n         Score: 12 | Author: inShambles3749\n\n          └─ Why is that?\n             Score: 4 | Author: Pure-Peace-3859\n\n              └─ It feels like people just don’t want to admit how much Cardano has actually helped the crypto space mature, especially with all those scientific papers they’ve put out. \n\nRemember when Cardano was challenging ETH for the top altcoin spot? That’s when all the hate started. I guess people were worried about their investments and didn’t like the idea of Cardano potentially replacing or competing with ETH. 😅\n\nBut honestly, as the space has matured, I feel like the vibe around Cardano has really changed. Most people seem pretty chill about it now, and there’s a lot more collaboration happening. The Cardano community is super friendly and respects other projects too.\n\nIt seems like the hate isn’t really a thing anymore…\n\nBtw: Charles knew that it was a bot. He just („I’ll) bite“ the bait for fun. Iykyk…\n                 Score: 6 | Author: YoungCapitalist95\n\n              └─ Mainly because of Charles and also that the ADA community members seem to have a certain personality let's put it that way\n                 Score: 8 | Author: Every_Hunt_160\n\n                  └─ Cardano fans are in it for the tech, and r/cc can't take that seriously or believe that could possibly be genuine. We don't like to talk about prices and like to provide constructive criticism for the tech. That also doesn't tend to go well in here.\n                     Score: 1 | Author: skr_replicator\n\n              └─ Because dumb people marry their bags and consider whatever shitcoin they bought the best and because Charles has made some weird public statements and lied about his personal life / education.\n\nAlso lots of people are probably still butthurt due to buying at previous ath and are now mad they lost money. But these people are the flippers. They hate it one day and once there is a green candle they are the biggest fan\n                 Score: 0 | Author: inShambles3749\n\n      └─ Well ETH bagholders are already here so\n         Score: 4 | Author: chickinflickin\n\n      └─ I mean there is nothing to defend or criticize, he didn't seems to check person writing to him real or not and asked if bot can explain what is wrong while bot spamming haha ADA bad like it can do to any coin.\n         Score: -2 | Author: Madronagu\n\n  └─ Charles goofy antics are the only reason I still hold ADA\n     Score: 2 | Author: Operation_Duskfall\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings IntelligentStep2973. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 1 | Author: AutoModerator\n\n  └─ How does one know when is a bot?\n     Score: 1 | Author: L-oso-ore_me-gairo\n\n      └─ It literally says \"Automated\" and has a robot icon under the username\n         Score: 6 | Author: flygoing\n\n          └─ Ah I see that, is that always there when it's a bot? Are there other ways to tell?\n             Score: 1 | Author: L-oso-ore_me-gairo"
  },
  {
    "post_id": "1hl8rgq",
    "post_content": "FTX’s Sam Bankman-Fried is Potentially in Consideration for a Presidential Pardon\n",
    "post_url": "https://beincrypto.com/sam-bankman-fried-pardon-debate/",
    "score": 941,
    "author": "sadiq_238",
    "created_utc": 1735026503.0,
    "num_comments": 548,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ And that is what millions in government lobbying buys you.\n     Score: 1086 | Author: partymsl\n\n      └─ They didn't even talk about all the money he had donated to the campaigns, went completely unnoticed\n         Score: 296 | Author: sadiq_238\n\n          └─ Nowadays it seems like putting hundreds of millions into 'lobbying' is a small bribe to pay in exchange for favours if you are a billionaire\n             Score: 138 | Author: Every_Hunt_160\n\n              └─ It's better than taxes.\n                 Score: 32 | Author: Radulno\n\n                  └─ It's like politicians asking for a small commission fee to help you skip the entire tax paying part\n                     Score: 20 | Author: Every_Hunt_160\n\n                  └─ $44 billion for Twitter \n\n$150 million for the entire USA\n                     Score: 28 | Author: EarningsPal\n\n                      └─ $270 mill is the total still cheap af\n                         Score: 1 | Author: One-Estimate-7163\n\n                  └─ Absolutely better than taxes. When you pay taxes, the money that’s being taxed has to come from a legit non-criminal source. But when you lobby, you can use the money you stole from your millions of victims to get you out of facing the consequences of your criminal behavior.\n                     Score: 1 | Author: ItIsYourPersonality\n\n              └─ Nowadays? Always has been.\n                 Score: 9 | Author: KrautWithClout\n\n              └─ \"Nowadays\"?\n                 Score: 7 | Author: 2peg2city\n\n              └─ Pardon Tiger King before this douche\n                 Score: 1 | Author: zebenix\n\n          └─ Because it's so common it's not even news worthy\n             Score: 11 | Author: Bear-Bull-Pig\n\n              └─ No one seems to have even read the article (including OP), which specifically does mention it\n                 Score: 3 | Author: EitherInvestment\n\n          └─ By ‘they’ are you referring to the article you linked in your OP? If so, it specifically mentions exactly that\n             Score: 14 | Author: EitherInvestment\n\n          └─ Uhhh it was talked about a lot\n             Score: 2 | Author: ThatsNotGumbo\n\n              └─ Yeah I agree. His political connections and donations were plastered all over the news\n                 Score: 1 | Author: Grazsrootz\n\n          └─ Which campaigns . The democratic ones or the republican ones?\n             Score: 2 | Author: P00slinger\n\n              └─ Both\n                 Score: 4 | Author: Real-Technician831\n\n                  └─ Overwhelmingly Democratic however\n                     Score: 54 | Author: DicksOut4Edamame\n\n                      └─ Sad reality!\n                         Score: 5 | Author: BlackWarrior322\n\n                      └─ depends on your threshold for \"overwhelming.\" ftx also made substantial contributions to the republican party, particularly through ryan salame.\n                         Score: -18 | Author: theoneburger\n\n                          └─ Threshold: nominally\n\n\nResult: overwhelmingly Democrat\n                             Score: 9 | Author: My5thAccountSoFar\n\n          └─ And it was reported he did it to try to get through America's red tape before bnb\n             Score: 1 | Author: Glad_Being_5146\n\n          └─ It wasn’t his money lol that was the problem.\n             Score: 1 | Author: Leading_Document_464\n\n          └─ They most definitely did talk about it what 😂?\n             Score: 1 | Author: AFB27\n\n          └─ That’s because all the politicians gave back the money they received to the defrauded customers right?\n             Score: 1 | Author: AriesThef0x\n\n          └─ I remember it being very well reported tbh\n             Score: 1 | Author: thecasey1981\n\n      └─ People kept trying to figure out what \"team\" he was on. Democrats called him a Republican, Republicans called him a Democrat\n\nAt the end of the day his team is just \"Not yours\". It's like George Carlin said, it's a big club and you ain't in it\n         Score: 70 | Author: ZenkaiZ\n\n          └─ Every business man is on both sides, just look at how Mark Zuckerberg and Jeff Bezos came crawling to Trump after his win.\n             Score: 38 | Author: partymsl\n\n              └─ At the end of the day they serve their one true boss: Money\n                 Score: 8 | Author: Every_Hunt_160\n\n                  └─ It's power. Money is a tool.\n                     Score: 1 | Author: Ok_Ticket_889\n\n          └─ Do you believe a democrat would pardon him? They could today.\n             Score: 8 | Author: illegal_deagle\n\n          └─ Democrats called him a Republican because they didn't want to reveal how much he was funding them. Well that info is public now and the money says he was a Democrat seeing as he was one of the largest donors to the Biden campaign.\n             Score: 8 | Author: daOyster\n\n              └─ \\> Salame, the former co-CEO of FTX's Bahamian unit, gave more than $24 million to Republican candidates and causes in the 2022 election cycle, according to Federal Election Commission data.\n\n\\> Prosecutors said Salame told a family member in a November 2021 message that Bankman-Fried wanted to use political donations to \"weed-out\" anti-crypto Democratic and Republican lawmakers, and would likely “route money through me to weed out that republican side.”\n                 Score: 1 | Author: crimsonjava\n\n          └─ Nah, he was playing both sides while there wasn't an official indictment, but once the investigations were kicking up he was considering \"[‘Coming Out’ as a Republican on Tucker Carlson After FTX Collapse](https://gizmodo.com/sbf-floated-coming-out-republican-tucker-carlson-1851340731)\". They found a document of his thoughts and plans on his personal computer.\n\nHe would likely take the (already popular despite not true) argument that \"Cemocrats are anti-crypto AND THEREFORE that's why they're persecuting me AND THEREFORE I am now a Republican\".\n\nGuy is a spineless shitbag however you look at it.\n\nI don't think Biden will pardon him, and certainly don't hope he does.\n\nI do, however, think Trump will pardon him if he \"kisses the ring\" (like JD Vance who called Trump \"America's Hitler\" but once he put his tail between his legs and lifted his asshole for daddy Trump was enough to get him on the ship), which I also hope doesn't happen.\n             Score: 1 | Author: Harucifer\n\n          └─ They are all in this club called \"You're not in it, sucka!\"\n             Score: 2 | Author: Every_Hunt_160\n\n      └─ Idk man, it was just a little fraud. We should all be able to do a little bit of fraud now and then\n         Score: 1 | Author: noobcodes\n\n      └─ And this is where I show my surprised face when the crypto community crowdsources a hit man for all the money he stole…\n         Score: 1 | Author: TopAd1369\n\n      └─ Heavy donations to Biden\n         Score: 1 | Author: cleveage\n\n  └─ That would completely destroy any residual belief in the justice system.\n     Score: 1418 | Author: MichaelAischmann\n\n      └─ 40 billion dollars is crazy, how can that be pardoned\n         Score: 424 | Author: sadiq_238\n\n          └─ It's not like ...40 grams of marihuana, so pardon is reasonable.\n             Score: 228 | Author: purpleefilthh\n\n              └─ ScamMan Fraud should not be pardoned for a single thing, not even his horrible looking haircut\n                 Score: 56 | Author: Every_Hunt_160\n\n                  └─ Then Caroline Ellison should be locked up for life\n                     Score: 6 | Author: InclineDumbbellPress\n\n                  └─ Or the fact that he slept with that girl (allegedly)\n                     Score: 1 | Author: imprimis2\n\n                  └─ ESPECIALLY the haircut.\n                     Score: 1 | Author: Pandelein\n\n                  └─ He greased the right Demoncrat palms.\n                     Score: -1 | Author: emakhno\n\n                      └─ We all knew he had coffee sessions with Greasy Gary Gensler\n                         Score: 1 | Author: Every_Hunt_160\n\n                          └─ Yes he did, plus many others like Mad Maxine Waters.\n                             Score: 1 | Author: emakhno\n\n                      └─ Dude paid pretty equally into both parties. He was vying for less regulation in crypto, so he wanted everyone on his side\n                         Score: 0 | Author: MaxTheRealSlayer\n\n                          └─ No, mostly Demoncrats. You're either unaware or lying. Probably the latter....\n\nhttps://www.marketwatch.com/story/here-are-the-politicians-who-received-money-from-ftxs-sam-bankman-fried-11670359945\n                             Score: 2 | Author: emakhno\n\n              └─ Yes, not like the guy who stole a 100 dollar bill at a bank and sentenced to spend 15 years in prison.\n\n\n/s\n                 Score: 17 | Author: latencia\n\n          └─ Because he funded the democrats with it.\n             Score: 76 | Author: Michichael\n\n              └─ If it ever happens it would be interesting to see how they weasel their way into giving a reason as to why SBF was pardoned lol\n                 Score: 29 | Author: Every_Hunt_160\n\n                  └─ He doesn't have to give any explanation or reason.\n                     Score: 1 | Author: OoPieceOfKandi\n\n                  └─ Why? \n\nBiden just pardoned his son of literally every crime knowingly or unknowingly committed thus far.\n\nMade a few incoherent rambles about how hard his son had it.\n\nThen called it a day.\nThere won’t be much to see.\n                     Score: -16 | Author: PeterParkerUber\n\n                      └─ Hunter purchasing a gun and hiding the fact that he did drugs is like a mosquito bite vs SBF scamming billions which is more like being anal probe with a bazooka and pulling the trigger.\n\nOne can be overlooked and pardoned.\n                         Score: 26 | Author: snksleepy\n\n                          └─ Hunter Biden didnt pay his taxes for 4 years. If you or I did it, we’d be screwed big time.\n\n“The indictment alleges that from tax years 2016 through 2019, Hunter Biden didn’t pay at least $1.4 million in self-assessed federal taxes, and that he filed false returns for tax year 2018 in order to evade the assessment of taxes. The indictment alleges that the president’s son “subverted the payroll and tax withholding process of his own company by withdrawing millions outside of the payroll and tax withholding process; spent millions of dollars on an extravagant lifestyle rather than paying his tax bills; in 2018, stopped paying his outstanding and overdue taxes for tax year 2015; willfully failed to pay his 2016, 2017, 2018 and 2019 taxes on time, despite having access to funds to pay some or all of these taxes; willfully failed to file his 2017 and 2018 tax returns, on time; and when he did finally file his 2018 returns, included false business deductions in order to reduce the very substantial tax liability he faced as of February 2020.”\n                             Score: 4 | Author: wee_d\n\n                              └─ That’s actually not true.  We’d have to pay it plus penalties.  Almost nobody gets criminal charges for tax evasion (unfortunately).  Look at Roger Stone or Alex Jones for more egregious examples.\n                                 Score: 11 | Author: asuds\n\n                                  └─ Hunter is getting convicted for crimes that just about no one gets charged for. Other people would just pay a fines and be on their way.\n                                     Score: 3 | Author: snksleepy\n\n                                  └─ You could still face jail time if the IRS decides it wants to go after you for that. Hunter Biden is not a special case. \n\n-Texas Man Sentenced To 41 Months in Prison for Tax Evasion\n(https://www.justice.gov/opa/pr/texas-man-sentenced-41-months-prison-tax-evasion)\n\n-Colorado man sentenced to a year in federal prison for not paying almost a quarter of a million dollars in federal taxes. \n(https://www.cbsnews.com/amp/colorado/news/colorado-man-steven-darbee-sentenced-little-or-no-federal-taxes-nine-years-irs/)\n\nArt Gallery Owner Mary Boone Sentenced To 30 Months In Prison For Filing False Tax Returns\n(https://www.justice.gov/usao-sdny/pr/manhattan-art-gallery-owner-mary-boone-sentenced-30-months-prison-filing-false-tax)\n\nCary man sentenced in $1+ million tax evasion scheme\n\n-Survivor winner Richard Hatch was sentenced to 51 months in prison for tax evasion, failing to report his 1 million dollar winnings \n\n-Wesley Snipes served 28 months in federal prison for tax evasion\n\n-Ja Rule was sentenced to prison for tax evasion\n                                     Score: 0 | Author: wee_d\n\n                                      └─ It looks like you've posted a [Google AMP link](https://www.socpub.com/articles/chris-graham-why-google-amp-threat-open-web-15847).  Please try posting again with the direct link to the article (You shouldn't see \"amp\" anywhere in the URL) or contact the moderators if you need help.\n\nAMP is a proprietary walled garden which [benefits Google](https://www.socpub.com/articles/chris-graham-why-google-amp-threat-open-web-15847) and [hurts everyone else](https://www.theregister.co.uk/2017/05/19/open_source_insider_google_amp_bad_bad_bad). It is destroying the open web through anti-competitive violation of standards.\n\nIt is bad for publishers because it forces them to duplicate development effort, and prevents differentiation and customisation. It also allows Google to watch you even after you've left their search results page.\n\nFor individuals seeking an automated solution to this problem, they can try installing the Redirect AMP to HTML extension on [Chrome](https://chrome.google.com/webstore/detail/redirect-amp-to-html/kifkmmpiicbcnkjaliilaoeaojlldonl) and [Firefox](https://addons.mozilla.org/en-US/firefox/addon/amp2html/?src=search). \n\nThank you to OtherAMPBot for this information and detection code.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n                                         Score: 1 | Author: AutoModerator\n\n                                      └─ Those cases are different. They involve egregious intentional fraud, including fraud after the fact\n\nNot failure to file or pay.\n                                         Score: 0 | Author: asuds\n\n                                          └─ They’re not (so) different from Hunter’s. \n\nAccording to the indictment (which he pleaded guilty to) in https://www.justice.gov/sco-weiss/pr/robert-hunter-biden-convicted-three-felony-tax-offenses-and-six-misdemeanor-tax-offenses, \n\nand I directly quote he:\n\n-subverted the payroll and tax withholding process of his own company by withdrawing millions outside of the payroll and tax withholding process;\n\n-willfully failed to pay his 2016, 2017, 2018 and 2019 taxes on time, despite having access to funds to pay some or all of these taxes;\n\n-willfully failed to file his 2017 and 2018 tax returns, on time; and\n\n-when he did finally file his 2018 returns, included false business deductions in order to reduce the very substantial tax liability he faced as of February 2020\n                                             Score: 1 | Author: wee_d\n\n                              └─ Lmao I know a dude who claimed 10 kids for a decade on taxes and just had to set up a 10+ year repayment plan. Not paying taxes for a few years isn't that serious, especially when you're rich\n                                 Score: 6 | Author: dcchillin46\n\n                              └─ You still can't compare 1.4 mil to 40 bil you look like an idiot.\n                                 Score: 8 | Author: praisetheboognish\n\n                                  └─ 😂 It makes you look like an idiot for assuming I was comparing them to begin with., but after all this is Reddit, my expectations were too high.\nThe point I was making is other regular folks, not called Hunter, are going to jail for similar crimes of tax evasion.\n                                     Score: -4 | Author: wee_d\n\n                                      └─ No they wouldn't they would be given a fair trial, something Biden definitely didn't get and probably just be given the option to pay the taxes.\n                                         Score: -14 | Author: praisetheboognish\n\n                      └─ If it was you would you not do the same?\n                         Score: 1 | Author: Feisty-Season-5305\n\n                      └─ But Matt Gaetz pedophilia is okay, right? Y'all republicans are weird\n                         Score: 1 | Author: DontB2Sensitive\n\n                          └─ Two wrongs don’t make a right!\n                             Score: 1 | Author: Awkward-Amount-1255\n\n                          └─ You really don't want to be going down that road.\n\nThrowing rocks in a glass house isn't wise......\n                             Score: 1 | Author: PeterParkerUber\n\n                      └─ I mean... hunter IS his son. Ok i get it. If my son was an ass, i probably would do the same.. the world sucks. Some kids get privilidge. \n\nBut it's not like any criminal can be a president's son. \n\n\nBut bankman? Why???? Cos he paid (ahem.. donated) democrat party 40millions?? Is that it? That's the price? Any major criminals can do that! 40 mil is cheap.\n\n\n So basically if you do major crime, just make sure you make profit more than 40mil? So you can buy yourself  get out of jail card??\n\nBasically democrats just show us their price tag.\n                         Score: 1 | Author: bigbrainnowisdom\n\n                      └─ [deleted]\n                         Score: -12 | Author: None\n\n                          └─ \"don't investigate Hunter for corruption, poor guy is a crackhead\" lmaoo\n                             Score: 7 | Author: No-Lab-1445\n\n                              └─ [deleted]\n                                 Score: 1 | Author: None\n\n                                  └─ Doesn't mean more evidence won't come out in the future. The corruption is there (as shown by the leaked WhatsApp messages and testimony), it's just finding the paper trail and enough evidence to convict him.\n                                     Score: 1 | Author: No-Lab-1445\n\n                                      └─ [deleted]\n                                         Score: 1 | Author: None\n\n                          └─ Just go ahead and ignorantly ignore the gun case. \nhttps://apnews.com/article/hunter-biden-gun-trial-federal-charges-delaware-5dd8a9380235c6360a1ddb691ef24a06\n                             Score: 3 | Author: isquarei\n\n                              └─ The “gun case” also only gets charged as an add-on to more serious charges.\n\nHunter would almost never be prosecuted and definitely never be jailed for those actions, if he was not Hunter.\n                                 Score: 2 | Author: asuds\n\n                          └─ Whatever man. All I know is Biden kept telling everyone for four years he wouldn’t presidential pardon his son and then on his way out, lol.\n\nGuess what guys? Changed my mind, whatcha gonna do?\n\nAnyway, his son was being harassed and stuff I guess. So it’s whatever. All crimes pardoned forever.\n\nI mean, his son could’ve murdered someone that we don’t know of. But the blanket pardon covers all. Cos he was gonna be harassed yknow? Drinks alcohol and does drugs. That’s some sensitive stuff man.\n                             Score: -4 | Author: PeterParkerUber\n\n                              └─ Lying hasn't been the lowest bar anymore for decades so I don't think that's a valid reason to be upset at Biden for using the pardon on his son\n                                 Score: -7 | Author: ForumsDwelling\n\n                                  └─ Point being, a SBF pardon will likely be as unspectacular as a Hunter Biden pardon.\n\nBut I guess it WOULD be a tad less predictable than the Hunter pardon.\n                                     Score: -5 | Author: PeterParkerUber\n\n                                      └─ Unspectacular at first. There's a lot of people who are still pissed at sbf and want their money back though, and he doesn't have money for security anymore\n                                         Score: 3 | Author: Sooh1\n\n                                          └─ Dude still has millions\n                                             Score: 1 | Author: jminer1\n\n                                      └─ Equating one of the biggest financial frauds in history with Hunter Biden is some wild shit\n                                         Score: 2 | Author: Pacify_\n\n                                      └─ It's absolutely insane to compare the two, dumbest shit I've read all year.\n                                         Score: -2 | Author: praisetheboognish\n\n              └─ He is paid up on both sides\n                 Score: 13 | Author: Bear-Bull-Pig\n\n              └─ Misconception.  He funded both Democrats and Republicans.  SBF was the public face for Dems, Ryan for the GOP (Ryan’s in jail for this as well.)\n                 Score: 5 | Author: asuds\n\n              └─ Typical democrats. And he is the best version of them.\n                 Score: -10 | Author: goldenbuyer02\n\n              └─ And GOP\n                 Score: 0 | Author: Morepastor\n\n          └─ He pardoned someone for anything between 2014-2024 and the person had zero records against him.\n\nSo 40bn is probably fuck all in comparison to whatever that person did.\n             Score: 16 | Author: AncientProduce\n\n              └─ Person being his son \n\nAlso, maga will try to get Hunter put away in jail for anything so he's just protecting his son from a bat shit crazy president and FBI\n                 Score: -14 | Author: wallabee32\n\n                  └─ Voted for him and Harris\n\nIt is incredibly wrong that he granted the pardon for Hunter\n                     Score: 25 | Author: dakaroo1127\n\n                      └─ Oh really how so. The dude got prison time for something nobody else ever gets a day in jail for. Ffing clowns. Trump pardonned people like Bannon who scammed the MAGA fans out of millions  to \"Build a border wall\" aka line his pockets.\n                         Score: 11 | Author: Femininestatic\n\n                          └─ Normal people don't get blanket pardons and have their weapons + gun charges dismissed. I grew up with friends who got petty charges that ruined their lives. It is an insult to justice the Hunter got special treatment especially after running on the promise he wouldnt.\n                             Score: 3 | Author: dakaroo1127\n\n                      └─ While in a normal world I would agree it still makes me sick the double standards that Biden and Trump are measured by.\n\nTrump pardoned actual traitors, and anyone else who paid him money\n\nBiden was \"too old and mentally unwell\" Trump has been a helluva lot worse for longer.\n\nSo many examples like that but the media and the majority of people just don't seem to care as much when it is Trump.\n                         Score: 18 | Author: Tryhard3r\n\n                          └─ >Biden was \"too old and mentally unwell\" Trump has been a helluva lot worse for longer.\n\nI'm not even american and I have no dog in the fight but this is ridiculous. Biden talks like he's been a vegetable for half his life, lol.\n                             Score: 5 | Author: Baecchus\n\n                              └─ Seriously. first they fought tooth and nail denying that there was anything wrong with Biden. Then once it was so obvious you couldn't hide it suddenly everyone thinks trump has dementia for the first time\n                                 Score: 0 | Author: presidentcoffee85\n\n                                  └─ After he dropped out,  he's been fine and nothing close to the debate.  Actually had some pretty good press conferences\n                                     Score: 6 | Author: reklatzz\n\n                      └─ I think most if not all parents would do the same if given the chance, though. I know I would depending on the crime.\n                         Score: 5 | Author: Ok-Effect8502\n\n                          └─ Which is exactly why presidential pardon shouldn't exist at all\n                             Score: 13 | Author: sdavids6\n\n                              └─ You're right it shouldn't.\n                                 Score: 7 | Author: Ok-Effect8502\n\n                              └─ What do you expect someone to do when they’re foaming at the mouth for somebody for years? They showed his dick in an official capacity and they’re still crazy for him despite their own investigation turning up jack shit. \n\nIf anything it’s a good reason to have pardons around and I say that as somebody who doesn’t even like Biden. It’d been one thing if they approached the case with a shred of good faith somewhere but they left that behind years ago.\n                                 Score: -2 | Author: F1shB0wl816\n\n                                  └─ Investigations to put people away because you don't like them should also not exist. These things aren't mutually exclusive and one existing doesn't make the other right\n                                     Score: -4 | Author: sdavids6\n\n                                      └─ I never claimed otherwise. Just getting rid of that leaves you with no other alternatives apparently, which is a huge issue. You can’t just let bullshit investigations run rampant and treat it like they’re not different sides of the same coin. There’s far more justifications for pardons than vengeful, biased and bad faith investigations or public trials that go unchecked.\n                                         Score: 1 | Author: F1shB0wl816\n\n                      └─ It is called an abuse of power and we should not be surprised any longer that it happens all the time\n                         Score: 2 | Author: Every_Hunt_160\n\n                      └─ Tbh I think if Harris won there would be no pardon, but after seeing the lunatics that Trump is nominating on his quest for revenge, I don't blame Biden for the pardon.  \n\nNow if he pardoned SBF, I would be a bit more upset.  But I personally doubt that would happen.\n                         Score: -1 | Author: demagogueffxiv\n\n                  └─ If he did nothing wrong he had nothing to hide.. thats what the lefts been saying for years.\n\nThis just proves that he was guilty of something.\nAlso this now opens the gates to the republicans doing the same in the future.\n                     Score: 1 | Author: AncientProduce\n\n                      └─ You can have done little wrong and still be put through court for a decade because of vengeful political opponents\n                         Score: 2 | Author: SweetVarys\n\n                          └─ Yea Biden pardoned him for anything he did in a 10 year span because he did a little weed. He obviously did a lot worse that hasn't been discovered yet\n                             Score: 4 | Author: presidentcoffee85\n\n                              └─ I think its east to connect the dots that a major war broke out in the same country where his son was employed in a field he has no experience in, by a company that also by chance happens to be in one of the most corrupt countries in the world and generates billions of dollars in profit.\n                                 Score: 2 | Author: TheRicFlairDrip\n\n                  └─ You’re speaking to terminally online people bro. We were all literally online and saw with our own two eyes; hunters crack smoking selfies, and the resulting censorship, gas lighting and election interference\n                     Score: 0 | Author: jdawg3051\n\n                      └─ Lol election interference\n                         Score: 1 | Author: Final-Ad1756\n\n                          └─ Yeah lol when big tech colludes to censor your son smoking crack, gas lights the “idiots for believing it” and the admits it’s true all 1 month before an election. That is election interference on a scale unlike anything else in history\n                             Score: 1 | Author: jdawg3051\n\n                  └─ You lot who think it's fine are on fucking crazy pills.\n                     Score: 0 | Author: pickin666\n\n                  └─ Stop defending that bullshit you lunatic. That isn’t justice\n                     Score: -2 | Author: Tlux0\n\n          └─ Because of who he paid\n             Score: 4 | Author: coinsRus-2021\n\n          └─ Crypto scammer being pardoned is unfathomable? Have you seen the list of people pardoned this year? Throughout history?\n             Score: 2 | Author: theski2687\n\n          └─ He pardoned a Chinese national in prison that was caught with 40,000 pedophile files on his computer. I'm more appalled by that than if he pardons sbf\n             Score: 3 | Author: gunzby2\n\n          └─ Because a lot of these dems were in on it\n             Score: 4 | Author: imprimis2\n\n          └─ By the president on a piece of paper he signs.\n             Score: 1 | Author: praisetheboognish\n\n          └─ Who do you think donated huge amounts to both campaigns last election? It’s not about who you take the money from it’s who you turn around and give it to.\n             Score: 1 | Author: Mr_Notacop\n\n          └─ Because they've (the FTX estate) managed to recoup the entire sum plus more (they found some lost wallets and a lot of their AI investments went to the moon). So no money was actually lost.\n             Score: 1 | Author: banana_buddy\n\n      └─ That ship has already sailed.  Poor criminals go to jail, rich criminals go to the White House.  The justice system is an obscene farce.\n         Score: 49 | Author: CallousBastard\n\n          └─ lol seriously. That’s your line in the sand? \n\nOur justice system is only for the poor people. Been that way since the start of this country.\n             Score: 0 | Author: CrumpledForeskin\n\n              └─ Are you serious? The US have been a laughing stock for years for how much the rich are above the law.\n                 Score: 0 | Author: Objective_Digit\n\n      └─ There’s residual belief in our justice system?  Where?  Who??\n         Score: 23 | Author: flux8\n\n          └─ I'm starting to think that there's a good reason why the lady justice is blind\n             Score: 1 | Author: Every_Hunt_160\n\n              └─ That was no mistake\n                 Score: 1 | Author: Pinheaded_nightmare\n\n      └─ eh, he already commuted the\"cash for kids\"judge. SBF is nothing\n         Score: 23 | Author: Ill_Yogurtcloset_982\n\n          └─ That fucker should rot in a hole until it becomes his grave. It’s obscene he got a pardon.\n             Score: 11 | Author: Echo609\n\n          └─ Presidents should be forced to stand there and announce, then defend and explain every single pardon in front of the senate and the press. What the fuck is that bullshit even it's been normalized forever ago that 'yeah on their way out they can just let people out of prison for money/favors because they no longer need to worry about their reputation.\n             Score: 4 | Author: JohnHamFisted\n\n              └─ i agree with you 100% my fellow American. it's some crazy shit what they do with pardons\n                 Score: 1 | Author: Ill_Yogurtcloset_982\n\n      └─ Definitely not the explicit intent of one of the most prolific white collar criminals of our generation, no.\n         Score: 9 | Author: blaktronium\n\n      └─ I predicted his pardon a year ago lol. Its all about money.\n         Score: 5 | Author: fishingrex\n\n      └─ He’s rich so why not\n         Score: 2 | Author: bledig\n\n      └─ I think a few people would be mangioned\n         Score: 2 | Author: Necessary-Low-5226\n\n      └─ You actually have residual belief in the justice system?\n         Score: 2 | Author: Huth_S0lo\n\n          └─ Must be nice.\n             Score: 1 | Author: Magikarpeles\n\n      └─ How could anyone with half a brain still have any belief in America's justice system.\n         Score: 2 | Author: eunit250\n\n  └─ It would simply show the world that you can get away with anything in the US if lick the right asses.\n     Score: 401 | Author: Wadafak19\n\n      └─ Spoiler alert: we’ve known, for a very a long time.\n         Score: 107 | Author: jovialguy\n\n          └─ Creed knew\n\n \"You don't go by Monopoly, man. That game is nuts. Nobody just picks up Get Out of Jail Free cards. Those things cost thousands\"\n             Score: 29 | Author: Bear-Bull-Pig\n\n          └─ Surely were gonna make lobbying illegal soon right?\n             Score: 2 | Author: InclineDumbbellPress\n\n              └─ Nope, because the people that have that level of influence are actively going against it. The people that have the power, your people, are preoccupied being programmed by trump echo chambers and hating on trans people (dunno why they became the scapegoat in all this). \n\nThe funniest part? This whole gender, non binary, trans stuff was all created by Russians to cause internal turmoil for your people. \n\nIt’s generally a sad state of affairs and people are too poor and weak minded to do anything about it. \n\nLive your life to the best of your abilities, spend it with family and friends, eat and drink well. Earth will be saved when humanity goes extinct. \n\nHappy holidays from your friendly jovial redditor.\n                 Score: 0 | Author: jovialguy\n\n      └─ The justice system holds the most power domestically. This happens every single day with prosecutorial discretion. Bring those elections into the light because they let people get away with more than just financial fraud.\n         Score: 8 | Author: S-Kenset\n\n      └─ Did people not already know that?\n\nUS government is one of the very few countries in the world with an open bribery system, they really should not be lecturing any other countries in the world about corruption.\n         Score: 11 | Author: Every_Hunt_160\n\n      └─ And being rich. Definitely gotta be rich.\n         Score: 1 | Author: AMorder0517\n\n      └─ lick the left* asses\n         Score: 0 | Author: b0bbybitcoin\n\n  └─ Sure at this point go ahead, we're heading into a class war anyway might as well tell the population that the rich are above everyone else in such a blatant way.\n     Score: 288 | Author: Alkohal\n\n      └─ *\"I'm not even angry, just disappointed\"*\n         Score: 19 | Author: Every_Hunt_160\n\n      └─ Already did by not throwing trump in jail and voting him in as president\n         Score: 34 | Author: therealluqjensen\n\n          └─ Lmfao. Brainrot\n             Score: -28 | Author: LadleVonhoogenstein\n\n              └─ How is it incorrect?\n                 Score: 13 | Author: TransitoryPhilosophy\n\n                  └─ In jail for what as if any other politician would be jailed for what he did. The trump hate has made so many people numb and that's coming from someone who didn't vote for him.\n                     Score: -12 | Author: so0vixnbmsb11\n\n                      └─ For the false electors scheme, which is literal treason. You gonna hand wave that away? Lol. America is dead.\n                         Score: 6 | Author: TransitoryPhilosophy\n\n                          └─ Didn't he get caught asking to do that on the phone?\n                             Score: 7 | Author: lordofming-rises\n\n                              └─ That was him pushing one of the governors to falsify the vote. Similar theme, different crime.\n                                 Score: 7 | Author: TransitoryPhilosophy\n\n                                  └─ Sorry it's difficult to remember all the crimes he did\n                                     Score: 7 | Author: lordofming-rises\n\n              └─ The rot is your own.\n                 Score: 5 | Author: sorites\n\n      └─ Don't count on it\n         Score: 2 | Author: PM_Me_Ur_Clues\n\n      └─ He already did that when he pardoned Hunter Biden.\n         Score: 1 | Author: Vaginosis-Psychosis\n\n      └─ You voted for Biden right?\n         Score: -10 | Author: LadleVonhoogenstein\n\n          └─ No I voted for Trump 3x\n             Score: 1 | Author: Alkohal\n\n  └─ There's no source or anything for this bullshit. I could have written this just to whip naive people up. Shoot, maybe I did\n     Score: 64 | Author: jdbway\n\n      └─ Dead internet theory\n\nJust bots on bots on bots on bots everywhere\n         Score: 17 | Author: EnigmaSpore\n\n      └─ Just another crypto news site being uncritically consumed by the gullible morons on this subreddit.\n         Score: 8 | Author: wesser234\n\n      └─ The sources are an Elon Musk tweet, a based crypto bro tweet, and 4% rise in heavily manipulated polymarket wagers (in reaction to Elmo's tweet). This sub will believe literally anything.\n         Score: 5 | Author: ratbear\n\n      └─ Don't pay attention to the 13 billionaires in Trump's cabinet. Instead get angry at this completely hypothetical nonsense with zero evidence.\n         Score: 14 | Author: SlightAppearance3337\n\n      └─ The source is common sense. SBF and his family funnel money into major Democrat super PACS and Biden is pardoning anybody he owes a favor\n         Score: -3 | Author: jeekp\n\n          └─ That's not news. That's conjecturing to make yourself mad while Trump gives the levers of government to billionaires\n             Score: 4 | Author: jdbway\n\n  └─ \"Luigi, we have another job for you\"\n     Score: 41 | Author: No-Lab-1445\n\n      └─ There are conveniently in the same jail for now\n         Score: 10 | Author: Bear-Bull-Pig\n\n  └─ Hell no\n     Score: 47 | Author: sadiq_238\n\n      └─ [deleted]\n         Score: -9 | Author: None\n\n          └─ why would Tramp pardon him?? you tweakin\n             Score: 9 | Author: TheRicFlairDrip\n\n              └─ SBF parents are rich.\n                 Score: 1 | Author: Real-Technician831\n\n                  └─ SBF is richer than his parents, but besides that there are many people with a higher net worth than him that are also in prison so thats a weak argument.\n                     Score: 2 | Author: TheRicFlairDrip\n\n                      └─ Let’s see how long any rich will be in prison.\n                         Score: 2 | Author: Real-Technician831\n\n                          └─ You people are delusional. Did Trump just release all rich people last time or did he forget?\n                             Score: 0 | Author: MusaRilban\n\n          └─ Steal the thunder? NOBODY WANTS THIS\n             Score: 4 | Author: unrulystowawaydotcom\n\n              └─ Trumpists want as soon as Trump decides to pardon. \n\nTrump is not pro crypto, it’s just yet another grift for him.\n                 Score: -1 | Author: Real-Technician831\n\n              └─ Only a few criminal justice diehards over nuanced things like he was never offered a plea deal and his company was actually less shady than some of the other players in crypto. But unless you're going to law school, I doubt anyone besides his lawyers care.\n                 Score: 0 | Author: KingofTheTorrentine\n\n          └─ Wow, you Americans are fucking lost. Both sides are equally damaged.\n             Score: 4 | Author: Jocciz\n\n              └─ I am not from US, but kinda understand Trumps style of stupid pointless gestures.\n                 Score: -3 | Author: Real-Technician831\n\n  └─ Deny Defend Depose\n     Score: 149 | Author: CG-Saviour878879\n\n      └─ Yea my first thought was someone who lost everything bc of that guy will find him and this will become a theme\n         Score: 14 | Author: tankfortua20\n\n          └─ Depositors were fully refunded\n             Score: -1 | Author: Negative_Pilot8786\n\n              └─ I wasn’t, and neither were 2 of my friends. We were partially refunded\n                 Score: 2 | Author: jayeballz\n\n      └─ 🤞 Mario\n         Score: 11 | Author: ckhumanck\n\n          └─ Chill\n             Score: -1 | Author: MarioV2\n\n              └─ The fck is you on aboot?\n                 Score: 1 | Author: CG-Saviour878879\n\n                  └─ Check username\n                     Score: 2 | Author: MarioV2\n\n                      └─ lmfao i completely missed\n                         Score: 1 | Author: ckhumanck\n\n      └─ Free Luigi!\n         Score: 16 | Author: BlackWarrior322\n\n          └─ The funny thing is that Luigi is actually SBF's cellmate lol\n             Score: 7 | Author: Every_Hunt_160\n\n              └─ SBF, Diddy and Luigi are all in the same floor lol.\n                 Score: 11 | Author: BlackWarrior322\n\n                  └─ The wildest random threesome in history\n                     Score: 0 | Author: Every_Hunt_160\n\n  └─ if that happens crypto further loses credibility to not just be a giant money launder scam ponzi for criminals\n     Score: 80 | Author: cryptoislife_k\n\n      └─ Well crypto did start out with the aim to replace banking, so it's apropos\n         Score: 16 | Author: Worth_Tip_7894\n\n          └─ Apropos, does not mean appropriate\n             Score: 1 | Author: pterofactyl\n\n              └─ Top synonym result \"relevant\" also \"appropriate\"\n\nSource: https://www.merriam-webster.com/thesaurus/apropos\n                 Score: 1 | Author: Worth_Tip_7894\n\n                  └─ Appropriate is not in any of those lists\n                     Score: 1 | Author: pterofactyl\n\n                      └─ Edit; can't be bothered to argue with stupid, Merry Christmas.\n                         Score: 1 | Author: Worth_Tip_7894\n\n      └─ Ffs, It's not crypto being criminal it's a person running a company stealing investors money and giving it to politicians and spending it.\n A Ponzi is like the former head of the s.e.c. Bernie Maddof fraud scheme. Don't confuse corrupt people and companies or institutions with software or computer networks.\n         Score: 11 | Author: ace250674\n\n          └─ Bernie Maddof  was sentenced to 150 years and caused an estimated $18B in losses to investors. Spent 11 years in prison until he died.\n\nSam Bankman-Fried is sentenced to 25 years in prison and ordered to pay $11 billion in forfeiture. \n\nIf Madoff could never get a pardon, I think its unlikely SBF will.\n             Score: 1 | Author: intelw1zard\n\n      └─ Too late. Crypto is a giant money launder tool for everyone. \n\nWithout AI, how will a country actually police crypto with millions of global addresses mixing with privacy blockchains?\n\nThe new future smart contract blockchains are building in privacy. So many new compression techniques have been developed to completely eliminate the ability to track everything.\n         Score: 2 | Author: EarningsPal\n\n      └─ The truth is that because of all the ties to shady individuals and dealings, crypto never really had credibility in the public's eyes to begin with\n         Score: 1 | Author: Every_Hunt_160\n\n      └─ it's main purpose\n         Score: -2 | Author: random869\n\n      └─ Oh because the dollar was never used for this purpose?\n         Score: 0 | Author: Mort332e\n\n  └─ Only if joe wants to ruin the dems ever winning an election again\n     Score: 60 | Author: milnivek\n\n      └─ Lol for this? Even if this speculation comes to fruition, voters are dumb and forget in a matter of days. This isn't even that egregious. After 4 years of trump, this is going to be child's play. \n\n\nThough I do bet media could spin people up about this just as they've softened the idiocy of Trump talking about taking over Canada, buying Greenland and all that.\n         Score: 7 | Author: beecums\n\n      └─ Evil Brandon has been unleashed\n         Score: 12 | Author: BlackWarrior322\n\n      └─ Joe's last act of revenge lol\n         Score: 9 | Author: Every_Hunt_160\n\n          └─ Read the article, this is complete speculation.  There is no indication that this is even remotely on the table as an option.\n             Score: 19 | Author: Cptn_BenjaminWillard\n\n              └─ But it sure is a good distraction from the 13 billionaires in Trump's cabinet.\n                 Score: 8 | Author: SlightAppearance3337\n\n                  └─ Indeed.\n                     Score: 2 | Author: Cptn_BenjaminWillard\n\n          └─ Revenge of what though. It would just piss everyone that lost stuff in ftx debacle \n\nSeriously that w9uld be a spit in the face of people losing all their life savings\n             Score: 1 | Author: lordofming-rises\n\n      └─ honestly, what if he's trying to spite them for forcing him to step down for Kamala? Childish vengeance on the party, seems believable to me\n         Score: 4 | Author: AccountOfMyAncestors\n\n          └─ It seems believable to you because you just completely made it up in your head.\n             Score: 3 | Author: busmans\n\n      └─ Why would Biden pardon him?  That makes ZERO sense.\n\nIt makes more sense for the CONVICTED FELON to want to do it.\n         Score: 1 | Author: Xanth1879\n\n  └─ tldr; Sam Bankman-Fried, former CEO of FTX, is rumored to be considered for a presidential pardon after receiving a 25-year sentence for fraud and embezzlement. His significant donations to Democratic campaigns, including $5.2 million to pro-Biden super PACs, have fueled speculation about potential leniency. Critics highlight controversial clemency precedents and lenient penalties for FTX collaborators, sparking public outcry. Elon Musk's comments on social media have further intensified the debate about political influence and judicial fairness in this high-profile case.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.\n     Score: 21 | Author: coinfeeds-bot\n\n      └─ Rumored. So no evidence at all just rage bait.\n         Score: 45 | Author: Bear-Bull-Pig\n\n          └─ Musk-fueled rage bait. Big surprise\n             Score: 9 | Author: bebophone\n\n          └─ Yeah there is zero benefit to pardoning him for political reasons and there is no moral or ethical reason. This is completely made up based on an option that no one buys on betting markets.\n             Score: 9 | Author: Miserable_Twist1\n\n              └─ The benefit is to encourage more money laundered into their political party\n                 Score: 1 | Author: jeekp\n\n  └─ man I've about had it with this country\n     Score: 25 | Author: Grundens\n\n      └─ Did you even read the “article”?\n         Score: 3 | Author: Pkmn_Gold\n\n          └─ I did and don't see your point in asking\n             Score: 0 | Author: Grundens\n\n              └─ It's speculation posted by Musk, it's not coming from any kind of Dem insider. It's pure speculation created to make you even think it's going to happen when it's not based in any actual reality.\n                 Score: 2 | Author: Syvinick\n\n                  └─ yeah and fuck musk. I'm tired of hearing what he thinks nvm what he's gonna get once his servant is potus.\n                     Score: 1 | Author: Grundens\n\n      └─ Migrate, but where to?\n         Score: 1 | Author: Every_Hunt_160\n\n          └─ phuket has a nice ring to it lol\n             Score: 0 | Author: Grundens\n\n  └─ Does anybody actually read linked articles? This is completed unfounded rumor mongering that was bolstered by a post by Elon Musk containing nothing but opinion. There’s literally no concrete indication cited in the article that this is actual being considered.\n     Score: 18 | Author: leaflavaplanetmoss\n\n      └─ Dude, it’s Reddit, why would we do that when we could just comment about the headline?\n         Score: 5 | Author: Pkmn_Gold\n\n      └─ Do you need Biden to say it into a microphone with a NYT logo to consider the likelihood?\n         Score: -1 | Author: jeekp\n\n          └─ Yeah kinda.\n             Score: 1 | Author: voyaging\n\n  └─ Can we pardon the silk road guy first?\n     Score: 11 | Author: KiwiPrimal\n\n      └─ No, you see, he was competing with major pharmaceutical companies and other online shops, so that’s a big no from the “ law and order” crowd.\n         Score: 3 | Author: DrSpacecasePhD\n\n  └─ Democrats and their “respect for the rule of law” 👎🏾\n     Score: 3 | Author: Mr_IV1\n\n  └─ Run the ponzi back\n     Score: 7 | Author: noviwu97\n\n      └─ Lol run that shit\n         Score: 2 | Author: liquidswords777\n\n      └─ Reboot FTX 2.0 !\n         Score: 1 | Author: Every_Hunt_160\n\n  └─ After the 2008 global financial crisis, no one went to jail, and that was much worse.  SBF just made the mistake of not perpetuating his scam in TradFi banking.\n     Score: 6 | Author: Worth_Tip_7894\n\n  └─ So this is just a rumor from maga-hats, that Musk has commented about? That's the news?\n     Score: 3 | Author: real_actual_doctor\n\n  └─ Lol Biden out here trying to make trump look like a saint 😂 wth\n     Score: 3 | Author: ish00traw\n\n  └─ Part of me thinks this was all orchestrated.\n     Score: 6 | Author: PumperNikel0\n\n      └─ Well they lined the pockets of both sides so probably.\n         Score: 2 | Author: P00slinger\n\n          └─ It’s interesting how they all fell at the same time like a domino effect\n             Score: 0 | Author: PumperNikel0\n\n              └─ There was a lot of funding between exchanges etc … it’s kinda like when a real big bank crashes it takes others out with it , plus in crypto the ups and downs are super amplified\nThere’s a theory Saylor could be the catalyst this time round .\n                 Score: 0 | Author: P00slinger\n\n                  └─ Except, these are independent companies. Gemini partnered with Genesis to handle the funds to their earn program and they would have stolen funds if it wasn’t for the New York attorney general.\n                     Score: 1 | Author: PumperNikel0\n\n                      └─ Yeah but wasn’t there several companies who FTX had loaned money to and from .\n\nAnd let’s not forget they were one of the biggest exchanges, it can trigger a capitulation through fear and uncertainty.  I got spooked myself and pulled money from exchanges. \nThe Lehman Brothers bankruptcy is widely considered to have been a major trigger for the whole gfc.\n                         Score: 2 | Author: P00slinger\n\n                          └─ There was mismanagement of funds and a liquidity crisis with everyone withdrawing. Yes, I’d agree with you there\n                             Score: 2 | Author: PumperNikel0\n\n      └─ A part of you? It was all orchestrated lmao.\n         Score: 1 | Author: Jovatheconniseur\n\n      └─ The article? Yes, it was.\n         Score: 0 | Author: wesser234"
  },
  {
    "post_id": "1hlkkqa",
    "post_content": "11 Years ago, Michael Saylor compared Bitcoin to online gambling, today Saylor’s MicroStrategy owns 444,262 BTC worth $27.7B.\n",
    "post_url": "https://i.redd.it/yls3wjxkku8e1.jpeg",
    "score": 843,
    "author": "Silver-Maximum9190",
    "created_utc": 1735068205.0,
    "num_comments": 138,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ A wise man changes his mind sometimes, but a fool never. To change your mind is the best evidence you have one.\n     Score: 352 | Author: hiorea\n\n      └─ Agreed. I don't know when it became a bad thing to change your mind....\n         Score: 39 | Author: Boonune\n\n          └─ Maybe SaylorMoon woke up one day and realised \"Actually I myself am a degen gambler\"\n             Score: 2 | Author: Every_Hunt_160\n\n          └─ For so many folks out there, their ego and self worth is tied to being right all the time.\n             Score: 1 | Author: Abysskitten\n\n          └─ They're called conservatives\n             Score: -7 | Author: JynsRealityIsBroken\n\n              └─ Ohhh sick burn! The other team is so stupid! My team is 100% correct!\n                 Score: 14 | Author: Meme_Stock_Degen\n\n                  └─ Hahahaha ggez\n                     Score: -7 | Author: JynsRealityIsBroken\n\n              └─ Buttcoiners?\n                 Score: 4 | Author: CryptoAd007\n\n              └─ I don't know.... I consider myself \"conservative\", but I guess I could be wrong? 💁\n                 Score: 1 | Author: Boonune\n\n      └─ I immensely respect people who can admit they’re wrong!\n         Score: 14 | Author: BlackWarrior322\n\n          └─ Everyone's acting like he changed his mind or admitted he's wrong.\n\nNot at all. He's just really into online gambling now.\n             Score: 19 | Author: loulan\n\n              └─ 🤣😭\n                 Score: 3 | Author: Tlux0\n\n              └─ it's highly possible\n\nwhat i'm impressed with, is that he managed to design a semi-ponzi loop between btc and his company stock in the process\n                 Score: 2 | Author: agumonkey\n\n              └─ He is the billionaire version of an online gambler on steroids today\n\nEven hardcore gamblers can't compete with this guy!\n                 Score: 1 | Author: Every_Hunt_160\n\n          └─ It can be tough but it’s the only way to grow wise.\n             Score: 1 | Author: ifv6\n\n      └─ Wasn’t Saylor facing liquidation when BTC was in the ~20K range because he had Long positions open? \n\nHe gambled, and won. But he was gambling\n         Score: 7 | Author: king_carrots\n\n          └─ All of crypto is a gamble. Don't let anyone tell you otherwise.\n\nEven Bitcoin.\n             Score: 1 | Author: Every_Hunt_160\n\n      └─ Not on the internet\n         Score: 2 | Author: Smashedavoandbacon\n\n      └─ Its still a fool's world out there where many people still waiting for Bitcoin bubble to burst. Guess what, they will b waiting forever\n         Score: 4 | Author: DaRunningdead\n\n          └─ That and every other bubble lol\n             Score: 4 | Author: EmotionalLecture9318\n\n              └─ Everything is a bubble in the modern world.\n                 Score: 4 | Author: innocentrrose\n\n      └─ Sorry but sir, this is still a casino.\n         Score: 2 | Author: kirtash93\n\n      └─ Bitcoin is an excellent ego check.\n         Score: 2 | Author: ShittingOutPosts\n\n      └─ A wise man doesn’t buy at the top.\n         Score: 2 | Author: AmbitiousBread\n\n      └─ Not so sure he changed his mind - back in 2013 there was a risk of govt intervention or trying to kill BTC. Price continued higher as those early risks were mitigated. Online gambling didn’t die because it was a fad - govt cracked down on it.\n         Score: 1 | Author: Sherlo12\n\n      └─ Full circle, like circle circle\n         Score: 1 | Author: Good_Spray4434\n\n  └─ He was pretty wrong about online gambling as well.  \n  \n^(This comment is sponsored by DraftKings.)\n     Score: 168 | Author: FrostyYoYos\n\n      └─ I was about to comment that. Online gambling is current a big issue in my country with lots of people addicted and these companies earning billions\n         Score: 29 | Author: CapivaraMan\n\n          └─ Given what he's doing with bitcoin, even Saylor is really into online gambling.\n             Score: 6 | Author: loulan\n\n          └─ Yeah i love how sports are constantly advertising gambling now and a huge chuck of the audience is children.\n             Score: 2 | Author: herefromyoutube\n\n              └─ How terrible for you\n                 Score: 1 | Author: joethecrow23\n\n          └─ SaylorMoon might have been a visionary with his tweet about online gambling over 10 years ago before we saw online gambling industry earning tens of billions\n             Score: 1 | Author: Every_Hunt_160\n\n      └─ Well he was right really. Bitcoin did suffer the same fate. It became massively popular and mainstream\n         Score: 5 | Author: gevis\n\n      └─ yeah what an idiot.. he gonna be wrong again with buying hella lot of bitcoin without an exit plan after cycle is over..\n         Score: 3 | Author: yslow3469\n\n      └─ Online gambling is still huge and has exploded during covid so yeah\n         Score: 2 | Author: FoxTheory\n\n          └─ So he was right. Online gambling and Bitcoin have shared the same fate.\n             Score: 4 | Author: IntelliDev\n\n              └─ I guess so lol\n                 Score: 1 | Author: FoxTheory\n\n      └─ Draftkings made me a couple hundred during the last World Cup by betting on that Morocco team.\n         Score: 1 | Author: Long_Lecture_1080\n\n  └─ He took the right U turn\n     Score: 21 | Author: DaRunningdead\n\n      └─ I mean he was correct it is Gambling, but this one’s house edge is just dependent on how much money you have. That and gambling is going crazy right now other than this.\n         Score: 3 | Author: Xist3nce\n\n      └─ Meanwhile, contrast that with Peter Schiff my Arse\n         Score: 2 | Author: Every_Hunt_160\n\n          └─ The difference between wise and fool\n             Score: 1 | Author: DaRunningdead\n\n  └─ It’s almost like he changed his mind based on new information and a better understanding of the facts.\n     Score: 29 | Author: Wise-Grapefruit-1443\n\n      └─ Barely anyone does that, so it's even more appealing that he did it.\n         Score: 5 | Author: partymsl\n\n      └─ I’m curious what new information there is? The only thing that’s changed about Bitcoin is the aim as it’s now a store of value.\n\nMaybe people should take responsibility for what they say publicly.\n         Score: 5 | Author: revzjohnson\n\n          └─ Let's be real, the new information was that he saw an opportunity to make a shit tonne of money off Bitcoin and he did\n             Score: 1 | Author: Every_Hunt_160\n\n          └─ It is called educating yourself. Some thing a lot of people don't seem to have the ability to do. The more research he did, the more he was convinced. Education can have the effect.\n             Score: -1 | Author: BroncoFanInOR\n\n      └─ People who enjoy logic and math love bitcoin.\n         Score: 1 | Author: BraidRuner\n\n      └─ Maybe he didn’t actually change his mind only his words. How do we know he still doesn’t feel this way and it’s still a gamble?\n         Score: -1 | Author: chivakenevil\n\n  └─ Same fate as online gambling. Both are booming high!!\n     Score: 9 | Author: SpaceFire000\n\n  └─ *From FUD to Shill: A Michael Saylor Story*\n     Score: 15 | Author: goldyluckinblokchain\n\n      └─ From Safemoon to SaylorMoon\n         Score: 9 | Author: DaRunningdead\n\n      └─ Changing your mind after looking at the facts earns you at least mine outmost respect.\n         Score: 2 | Author: partymsl\n\n      └─ From Hell to the Moon: The story of Michael SaylorMoon\n         Score: 1 | Author: Every_Hunt_160\n\n  └─ Well, I guess a person learns as long as they are alive.\n     Score: 9 | Author: KIG45\n\n      └─ Tell that to the Buttcoiners!\n         Score: 1 | Author: Every_Hunt_160\n\n  └─ The difference between an intelligent guy that realises if he is wrong and Peter Schiff\n     Score: 5 | Author: G6br0v5ky\n\n      └─ Its not over yet\n         Score: 2 | Author: Mammon84\n\n  └─ ITT: Captain Hindsight and friends. \n\nI would love to see how the average person in this thread would have reacted to being offered compensation in bitcoin back in 2013. 99% of you would have laughed at the idea and demanded they pay you in fiat.\n     Score: 3 | Author: LilEately\n\n  └─ People can change their mind, in general I would tend to trust these people more than those who never change their opinions on anything. That being said, I think Saylor is as big of a grifter as they come, and wouldn’t trust him with a dime lol\n     Score: 5 | Author: fedzo\n\n      └─ Exactly my opinion. A change of heart is a sign someone is willing to progress as a person. But this dude failed to make his software company profitable for 20÷ years, already bankrupted a company (too drunk to remember is it this one or another one) was on trial for fraud. We all know how successful the US justice system is in prosecuting the wealthy, so why do people assume he cracked the code at Bitcoin's ATH. \n\nIt's just a simple momentum play for him, and I think he's hoping they become too big to fail. But he seems to forget the \"Mr. Market\" doesn't care about retail investors and rarely rewards those who step out of line (not investing in s&p/vanguard/other market ETFs). Bogleheads is a movement based on obedience (no disrespect, free money is free money) but from what I can see even fundamentally sound businesses get shorted to death and murdered on the market, so investing in regular stock that has good value can still badkfire. (congratilations to the folks who were on time in Tesla and Palantir especially those who held )\n\n\nReality is at this point major investors move the market and until the bubble bursts, whether its 25 or 27, we're just in the mercy of them. When they decide they have made enough money and It's time to enjoy them we'll be all left with losses until their vacation is over.\n\nIMHO, right now MSTR is just abusing a bullish retail market but eventually they will run into a crossroad of a Bitcoil bear days combined with retail sell off, and this will be close to their demise. Nothing is ever for sure, especially crypto, but this is my amateurish assumption and assuming \"digital gold\" will keep getting pricier instead of getting broken into is risky.\n\nToo much time has passed and too much value was added. Going for BTC is now a 7 digit game minimum instead of a 6 digit game and this changes a lot. \n\nCrypto brothers love to talk about Bitcoin being the new gold but they forget seemingly that all value has It's chasers, not always with the right motives.\n\nIf you wanna get into crypto, wait for bear days and then get in. But don't bet on people betting on things. It's a guaranteed failure, especially coming from Saylor, who complektely disregarded the actual business of his company (software).\n\nJust follow fundamentals and \"Mr Market\" will reward you over time. If you follow hype and momentum then you're in for a long and painful game as years go by, especially with MSTR, a company with no real product apart from a highly volatile crypto currency as its cash reserves.\n         Score: 1 | Author: Viagraonviagra\n\n  └─ Original tweets:\n\nhttps://x.com/saylor/status/413478389329428480\n\nhttps://x.com/saylor/status/1871309389413724620\n     Score: 2 | Author: Silver-Maximum9190\n\n  └─ A smart man/girl is able to adapt 😉\n     Score: 2 | Author: Tasigur1\n\n  └─ Say one thing to keep people away and load up. This is the strategy used by all institutions.\n     Score: 2 | Author: Traditional_Curve444\n\n  └─ Yeah dude. Fuck people changing their mind and admitting they were wrong a decade ago.\n     Score: 2 | Author: Cattledude89\n\n  └─ Smart man to have learned from his mistakes\n     Score: 2 | Author: Ok_Angle94\n\n  └─ When the facts change, I change my mind\n     Score: 2 | Author: Sizzlinbettas\n\n  └─ To be fair, online gambling is taking off like crazy just like bitcoin\n     Score: 2 | Author: Appelmoesje\n\n  └─ Shill if you have it\n     Score: 2 | Author: aaaanoon\n\n  └─ I mean, online gambling is also booming\n     Score: 2 | Author: CragBawz\n\n  └─ Well Ill be damned - Michael Saylor can be as bipolar as my wife\n     Score: 3 | Author: InclineDumbbellPress"
  },
  {
    "post_id": "1hl9nkx",
    "post_content": "Russia bans crypto mining for 6 years in 10 regions\n",
    "post_url": "https://cointelegraph.com/news/russia-crypto-mining-ban-2025-2031",
    "score": 305,
    "author": "Experimentationq",
    "created_utc": 1735030551.0,
    "num_comments": 101,
    "subreddit": "CryptoCurrency",
    "comments": "\n  └─ Possibly related to energy supply management I guess\n     Score: 95 | Author: Lillica_Golden_SHIB\n\n      └─ I thought Bitcoin maxis said that Bitcoin is good for the environment /s\n         Score: 11 | Author: Every_Hunt_160\n\n          └─ Net base load management. If I have in a region a certain demand which outstrips the production of electricity I have to manage the grid accordingly. It isn't so hard to understand.\n             Score: 32 | Author: Monkeyinchief\n\n          └─ Your sarcasm would be funny if you wrote something that wasnt false and actually stupid and actually has to do with the topic being discussed, you are literally like the wind of spam right now.\n             Score: 2 | Author: Character-Dot-4078\n\n          └─ XRP is a scam, liquidity for Ripple. \n             Score: 2 | Author: Rent_South\n\n          └─ Has to be a bot account, look at that post volume\n             Score: 1 | Author: mwdeuce\n\n          └─ We never said that. We just said we know BTC will out perform alts and that in bear markets alts consolidate into BTC and if you buy BTC you'll get gains.\n\nYou're welcome to anyone who listened to me over the past 12 years.\n             Score: 1 | Author: ToxicBTCMaximalist\n\n      └─ I’m surprised they haven’t built up more nuclear infrastructure? They also have ample oil supplies. That said, I guess the oligarchs have been looting instead of building basic stuff in the country.\n         Score: 0 | Author: DrSpacecasePhD\n\n          └─ Pretty much only liberal democracies have a main goal of providing for their citizens.   \nI think it was first theorized and applied by frederick the great.\n\nOther state forms do not care about doing the best for their citizens. Some care about legacy, some about religion, and some, like the soviets, care about world domination.\n             Score: 1 | Author: CowboysfromLydia\n\n              └─ Sure, but Russia also has a major incentive to maintain their nuclear reactor infrastructure…\n                 Score: 1 | Author: DrSpacecasePhD\n\n                  └─ 'Russia' is not a singlar, logical entity. The real question is if the people in power in Russia have the incentive to maintain their infrastructure and the answer is not really. Other than the few specific cities and areas they care about. \n                     Score: 0 | Author: AntiGravityBacon\n\n  └─ i swear few weeks ago  i saw that russia will support crypto, especially mining\n     Score: 118 | Author: Status-Travel6685\n\n      └─ They can still use crypto but ban its mining due to the resources it consumes. They are not mutually exclusive.\n         Score: 57 | Author: Which-Occasion-9246\n\n          └─ Putin cares about the environment?!\n             Score: 2 | Author: InclineDumbbellPress\n\n              └─ No dude, he cares that there's maybe enough energy for people to not revolt since weirdly there has been an absolutely massive surge of smoking related explosions and fires across the energy infrastructure. Entirely unrelated to events that started with their neighbor being rude. \n                 Score: 1 | Author: AntiGravityBacon\n\n          └─ Owning Crypto = Acceptable\n\nMining Crypto = Banned\n\nSeems like some people can't tell the difference\n             Score: 1 | Author: Every_Hunt_160\n\n          └─ Probably the case. But I don't trust Russia to be pro-Crypto.\n             Score: 1 | Author: partymsl\n\n      └─ They might support it in certain regions. If you read the headline, it talks about 10 regions.\n         Score: 6 | Author: iampuh\n\n      └─ Probably oligarchs only.\n         Score: 6 | Author: J-96788-EU\n\n      └─ They're bankrupt... And it eats a lot of energy.\n\nThe crypto community is in for a rude awakening.\n         Score: 4 | Author: Feisty_Sherbert_3023\n\n          └─ But they have oil.\n\nI'd similarly read recently about them getting in on mining.\n             Score: 3 | Author: Pericombobulator\n\n              └─ Thats the upside of beign a totalitarian regime, you ban private sector from mining and setup a refime owned mining farms from taxpayers money, less people mining, more blocks to mine.\n                 Score: 2 | Author: BrokeButFabulous12\n\n                  └─ This is the answer!\n                     Score: 2 | Author: Feisty_Sherbert_3023\n\n          └─ The sanctions definitely took a toll on them it seems.\n             Score: 0 | Author: Experimentationq\n\n              └─ They're using crypto to evade the sanctions.\n                 Score: 1 | Author: Stunning_Gur1850\n\n                  └─ For now. When Russia collapses so will crypto. Kaboom\n                     Score: 0 | Author: Feisty_Sherbert_3023\n\n      └─ You are not crazy, I saw it too and several times but I imagine they are doing it because of resources available.\n         Score: 1 | Author: kirtash93\n\n      └─ War and energy crisis\n         Score: 1 | Author: Scholes_SC2\n\n      └─ They had a significantly higher energy production capacity a few weeks ago\n         Score: 1 | Author: Airith0\n\n  └─ tldr; The Russian government has announced a ban on cryptocurrency mining in 10 regions for six years, starting January 1, 2025, until March 15, 2031. The regions affected include Dagestan, Ingushetia, and Chechnya, among others. The ban will impact both mining pool activities and individual mining. Additionally, there will be seasonal restrictions in three Siberian regions during winter to prevent energy blackouts. These measures align with Russia's cryptocurrency mining laws enacted in 2024.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.\n     Score: 14 | Author: coinfeeds-bot\n\n      └─ Those are the regions they want to recruit soldiers from. Makes sense to take alternate means of income from the people there to push them into becoming cannon fodder.\n         Score: 5 | Author: Guilty_Palpitation37\n\n      └─ Interesting that these are the regions that are most likely to revolt against the Kremlin criminals.\n         Score: 1 | Author: invest-interest\n\n  └─ I am not mining, i am heating my apartment.\n     Score: 7 | Author: -Monero\n\n      └─ Hey, how come your *heating equipment* has generated $1.71 in the past week?\n         Score: 2 | Author: Experimentationq\n\n  └─ Damn... they're really *Stalin* adoption with that move.\n     Score: 58 | Author: DBRiMatt\n\n      └─ Just when the market was *Lenin* towards being positive again\n         Score: 12 | Author: TheLegendOfZero\n\n          └─ *Slow applause to you 2*\n             Score: 1 | Author: Every_Hunt_160\n\n      └─ They shouldn't be *Putin* a stop to the mining activities.\n         Score: 3 | Author: MichaelAischmann\n\n      └─ I wonder how those old grandmas will heat their room now... Sad\n         Score: 1 | Author: kirtash93\n\n      └─ Dodgy pun.\n         Score: 1 | Author: Objective_Digit\n\n      └─ Nice\n         Score: 1 | Author: susosusosuso\n\n      └─ Joke of the year award goes to...\n         Score: 0 | Author: partymsl\n\n  └─ “Who can ban bitcoin? Nobody.“ - Putin\n\n\n\nhttps://www.coindesk.com/policy/2024/12/04/putin-says-no-one-will-be-able-to-ban-cryptocurrencies-state-media\n     Score: 10 | Author: hquer\n\n      └─ Well, *technically,* only mining is banned. Not cryptocurrency altogether.\n\nBut still, the irony lol.\n         Score: 2 | Author: Experimentationq\n\n      └─ but not bitcoin mining.\n         Score: 3 | Author: GreedVault\n\n  └─ u/pepetipbot 15 pepe\n     Score: 4 | Author: Teranya8\n\n      └─ Woah! Thank you, human being!\n         Score: 3 | Author: Experimentationq\n\n          └─ Welcome to the pond, fren !\n             Score: 3 | Author: Teranya8\n\n      └─ **^([pending accept]) u/Teranya8 tipped u/Experimentationq __15 Pepecoin__** |[ accept ](https://www.reddit.com/message/compose?to=pepetipbot&subject=accept&message=accept) | [ decline ](https://www.reddit.com/message/compose?to=pepetipbot&subject=decline&message=decline)|\n         Score: 1 | Author: pepetipbot\n\n      └─ **^([verified]) u/Teranya8 tipped u/Experimentationq __15 Pepecoin__** |[ wiki ](/r/pepecoin/wiki/index) | [ stats ](/r/pepecoin/wiki/stats)|\n         Score: 1 | Author: pepetipbot\n\n  └─ Nobody cares about it (except Russian mainers). More for us.\n     Score: 9 | Author: zorro7392\n\n      └─ If you look at how infective the mining ban in China was, miners in Russia probably mostly won't care either. As long as they make enough money to bribe local authorities they're fine.\n         Score: 8 | Author: BrooklynNeinNein_\n\n          └─ They  can also move shit to other regions if they have problems or pay to someone from the local government 🤣👍. This is a long term ban.\n             Score: 5 | Author: zorro7392\n\n      └─ Do individuals still mine these days? I thought it was now too expensive for individual miners to set up and almost all of mining is controlled by the big mining companies nowadays\n         Score: 2 | Author: Every_Hunt_160\n\n          └─ Ban is for everyone. Individuals, small and big companies. Individuals with 5-10 miners are \"small companies\" also.\n             Score: 1 | Author: zorro7392\n\n  └─ I guess they anticipate a strong push to the moon for bitcoin, so that those areas would mine like crazy. That means basically that the US and Russia will next year accumulate Bitcoins and drive the price to 1 Mio. $\n     Score: 2 | Author: Successful_Shake8348\n\n  └─ Weren't they pro crypto / mining just a few weeks ago? Can't rely on Cointelegraph news either\n     Score: 2 | Author: CriticalCobraz\n\n  └─ its difficult to find and defenestrate people that want to stay hidden, easier to say its now illegal to do\n     Score: 2 | Author: lurker512879\n\n  └─ Russia just having mood swings like my girlfriend\n     Score: 5 | Author: DaRunningdead\n\n      └─ People on r/cc have girlfriends??\n\nImpossible.\n         Score: 11 | Author: Experimentationq\n\n          └─ ~~have~~ had\n             Score: 5 | Author: DaRunningdead\n\n          └─ They have mistaken their left hand and right hand as girlfriends\n             Score: 2 | Author: Every_Hunt_160\n\n          └─ waifu...\n             Score: 1 | Author: GreedVault\n\n      └─ If one per month, is normal. If more.... run🏃‍♂️\n         Score: 1 | Author: zorro7392\n\n      └─ *imaginary girlfriend\n         Score: 1 | Author: -Monero\n\n      └─ They are desperate\n         Score: 1 | Author: invest-interest\n\n  └─ Don't they rely on crypto to circumvent sanctions and fund their various activities?\n     Score: 2 | Author: LaserCondiment\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings Tycconn. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 0 | Author: AutoModerator\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings DAEECRYTO. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 0 | Author: AutoModerator\n\n  └─ Whatever\n     Score: 1 | Author: Medium_Change4574\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings gidadomg. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 1 | Author: AutoModerator\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings Fragrant_Heron_4332. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 1 | Author: AutoModerator\n\n  └─ [removed]\n     Score: 1 | Author: None\n\n      └─ Greetings Immediate-Invite-315. Your comment contained a link to telegram, which is hard blocked by reddit. This also prevents moderators from approving your comment, so please repost your comment without the telegram link.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*\n         Score: 1 | Author: AutoModerator\n\n  └─ But how will they know?\n     Score: 1 | Author: SeatedDruid"
  }
]