[
  {
    "post_id": "1hbswzl",
    "post_content": "Hired 100’s of designers. AMA\nHey. I’ve helped companies hire 100’s of designers. There’s so much noise out there for designers (and leaders) on how to land jobs, so I thought I’d try distill some of that here with an AMA if I can help anyone. \n\nIf anyone has any questions on:\n\n- The current job market \n- How to design a portfolio to land you an interview \n- Best approaches to cold outreach \n- What companies and hiring managers are really looking for \n- anything else on design talent\n\nPlease ask away. Happy to help in anyway I can. ",
    "post_url": "https://www.reddit.com/r/productdesign/comments/1hbswzl/hired_100s_of_designers_ama/",
    "score": 23,
    "author": "tomscottttt",
    "created_utc": 1733922018.0,
    "num_comments": 24,
    "subreddit": "productdesign",
    "comments": "\n  └─ Would love to know more about approaches for cold outreach. I feel like my portfolio is solid, but it seems like it doesn’t even get seen beyond HR.\n     Score: 5 | Author: balakaylakay\n\n      └─ Firstly, with the portfolio: \n\n**Key things I would think about:**\n\n**-** Focus on crafting a story. Rather than detailing how you did wireframes etc. This is all stuff I would expect a designer to be doing. This is literally your job. What recruiters care about is results, so we can sell\n\n\\- Simple information hierarchy. Make a first impression in as few clicks as possible. Make it easy to read and scan.\n\n\\- Put your best work in there. Not many companies care about what you did 10 years ago.\n\n\\- Show end results and business impact. Hiring managers want to see how your skills are relevant to the kind of work they're going to assign to you, if you join. Metrics that impact the business are always a nice addition!\n\n\\- Show breadth of craft i.e not just across one type of product.\n\n\\- Product sense (Critical thinking, product craft, how you work with teams etc)\n\n\\- Focus on visual craft AKA attention to detail\n\n\\- Storytelling. A lot of companies are looking for full-stack designers these are people who can take something from 0 through to a deliverable on the product roadmap. This requires people who can think strategically but also understand the steps and detailed needed to hit that goal, as well as who they need to collaborate with to get things done.\n\nWith the cold approach: \n\n\\- I would focus on hiring managers. \n\n\\- Find who the hiring manager is on LinkedIn (or other social media platforms) and approach direct. \n\n\\- HR is great, but often finding a reason to rejecting you. The hiring manager will understand the nuance of design a little more.\n         Score: 17 | Author: tomscottttt\n\n          └─ Great advice, thanks!\n             Score: 2 | Author: balakaylakay\n\n  └─ What are some qualities of designers who stand out from the rest? What are the missed opportunities? And what are some tips for designers to interview the team/company?\n     Score: 6 | Author: Anxious-Yak-9952\n\n  └─ How is the current market looking for hiring and what are your projections for changes within the next year or two?\n     Score: 4 | Author: Merciless_Cult\n\n      └─ Still fucked\n         Score: 4 | Author: gintonic999"
  },
  {
    "post_id": "1hmkm72",
    "post_content": "Looking for Product Designer job opportunities (2+ Years Experience)\n\nHi everyone,\n\nI’m a product designer with over 2 years of experience, primarily in fintech and e-commerce. Unfortunately, I was recently impacted by a mass layoff in my previous company, where the entire design team was let go due to cost-cutting measures. The product I built from scratch was for an options trading platform, but it didn’t generate expected revenue.\n\nI’m now actively seeking new opportunities and am available for immediate joining. I have hands-on experience in designing and shipping products end-to-end.\n\nI’m open to:\n\nWork modes: Remote, hybrid, on-site\nWork types: Full-time, part-time, freelance, contract\nRelocation: Willing to relocate (currently based in Gurugram)\n\nIf you know of any opportunities or can refer me, please feel free to send me a message. Happy to share my contact details and portfolio for further discussion.\n\nThank you in advance for your support!",
    "post_url": "https://www.reddit.com/r/productdesign/comments/1hmkm72/looking_for_product_designer_job_opportunities_2/",
    "score": 5,
    "author": "Extra_Association201",
    "created_utc": 1735203655.0,
    "num_comments": 3,
    "subreddit": "productdesign",
    "comments": "\n  └─ I have some questions, I'm studying product design right now (started since 2018), and lately i have seen a massive change in what it was supposed to be, recently we went from building stuff to basicaly web or app design but without coding, when this change happened? Personally i am exploring new options because a teacher told me that is one of the worst paying positions and i think si because this transition from physical to digital (now known as ux), sorry for any misinterpretation of the panorama, as i said i'm just a student, but i'm worried\n\nWhat do you think?\n     Score: 1 | Author: Ambition_Capital\n\n  └─ Sounds amazing. Have a look at OneBanking, maybe a really interesting company for you. The most innovative FINTECH with IBAN, crypto and AI - coming 2025.\n     Score: -1 | Author: MrSuperSaiyan"
  },
  {
    "post_id": "1hpiw2h",
    "post_content": "How does the design process for complex moulded parts typically work?\nWhen developing a product that requires complex moulded parts (lets stick with plastic for now), what does the work flow look like?\n\nI'd imagine the overall look, feel, shape is designed by the product designer, but then the part would have to be modelled in CAD and turned into a functional part with things like wall thicknesses, clips, bosses, ribs, draft angles and then collaboration with the tool makers etc.   \n  \nIs a typical product designer skilled in these areas or would they stop at some point in the design process and hand over to a mechanical engineer? If handed over to a mechanical engineer then I'd imagine that this in itself a specialist role as designing complex plastic mouldings is very different to designing structural steel parts for example. If not a mech eng then who?  \n  \nCan people explain their workflows for work like this including role names, education required or explain how you think this type of work is done?",
    "post_url": "https://www.reddit.com/r/productdesign/comments/1hpiw2h/how_does_the_design_process_for_complex_moulded/",
    "score": 4,
    "author": "Alarming_Support_458",
    "created_utc": 1735547804.0,
    "num_comments": 3,
    "subreddit": "productdesign",
    "comments": "\n  └─ It depends on where you work. Some experienced industrial designers will do everything themselves. However in education it seems that design for manufacturing isn’t much in focus anymore.\n\nFrom my experience industrial designers define the shape and collaborate with mechanical engineers to ensure manufacturability, check parting lines etc. At some point the responsibility is handed over to the mechanical engineers who will then be in contact with the tooling manufacturers.\n\nAfter that there might still be some back and forth as the tool makers also can give some pointers\n     Score: 5 | Author: dsgnjp\n\n  └─ Surprised you didn't ask this in r/InjectionMolding but I guess not really. We're not as popular and easy to miss.\n\nTypically the part designer designs the product and parts involved in CAD from the beginning using parametric modeling software. If injection molding isn't already chosen, after a DFM (Design For Manufacturing) analysis is completed the manufacturing process is decided. In this case we'll say stamping, casting, etc. weren't ideal and it was decided to be injection molding (usually due to volume of parts needed, surface finishes, etc.) but the reasons don't really matter in this case I guess. We'll say that *somehow* it was determined to be a plastic injection molded part/component.\n\nFrom there (and often as part of the DFM) the part design is modified to be suitable for injection molding. This includes removing sharp corners (especially inside corners), maintaining a constant wall thickness, adding assembly features (screw bosses, alignment/spacing features, clips, heat stakes, etc.), and adding necessary draft angles for release/ejection from the mold.\n\nFrom there the part(s) design(s) are sent to a mold designer who designs the mold and then to a toolmaker who builds it and tests it for function, shutoffs, etc. then a molder for an initial run of parts that are sent to a customer for approval before the molder runs production or the mold is sent back for alteration (resizing of features that have to mate with some other part).\n\nOften you'll find many places can complete the whole project given a part design or initial prototype (part design is absolutely preferred), from the part design through to production. Stages may be contracted out; maybe one place doesn't have a part designer, they will know and work with one for sure. Only exception to that would be a place that does work exclusively (or almost exclusively) for an OEM.\n\nThere's people in the subreddit linked above that have more experience in the overall process and can offer more insight into specific areas than I can alone, so I would encourage you to post a similar question there, ideally a bit more detailed as to what information you're specifically seeking if this comment doesn't answer your question.\n\nA mechanical engineer is often not required past the part design, if at all, and a project would practically never be handed off to one. If anything they may be employed by a large enough company or consulted through a firm to determine certain features or wall thickness. If you're wanting sporks or tchotchkes likely not at all involved, if you're wanting automotive safety components, medical/aerospace, or maybe even patio furniture they're more likely to be involved.\n\nThe company I work for molds small metal parts via metal injection molding, but I started in plastics and have been working in the injection molding industry for over a decade now. They'll work a bit differently from place to place, but for the most part all you need is a part design--ideally in some popular CAD format (part drawings with tolerances are a plus as well)--that you're okay with being modified to adapt to the process, and capital; although some places will finance and/or retain ownership of the mold and the right to market/sell the parts themselves if you fail to.\n\nI should also say I am sick so even though I went over this a few times, I may be incorrect on some parts or speaking complete gibberish. This fever is kinda trippy tbh.\n     Score: 2 | Author: mimprocesstech\n\n  └─ [deleted]\n     Score: 1 | Author: None\n\n      └─ I will be messaging you in 12 hours on [**2024-12-30 20:54:41 UTC**](http://www.wolframalpha.com/input/?i=2024-12-30%2020:54:41%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/productdesign/comments/1hpiw2h/how_does_the_design_process_for_complex_moulded/m4hx8up/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fproductdesign%2Fcomments%2F1hpiw2h%2Fhow_does_the_design_process_for_complex_moulded%2Fm4hx8up%2F%5D%0A%0ARemindMe%21%202024-12-30%2020%3A54%3A41%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201hpiw2h)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|\n         Score: 1 | Author: RemindMeBot"
  },
  {
    "post_id": "1hocuzp",
    "post_content": "I redesigned LinkedIn's UI\nThis is a redesign I came up with—any ideas are welcomed ! I feel like the original LinkedIn desktop site is too cluttered, especially for beginners, so I tried redesigning it. My goal was to make it cleaner and easier to use. This is just the first iteration. If you guys have any positive idea please share it in the comment section. I would love to learn a lot from this project.",
    "post_url": "https://www.reddit.com/gallery/1hocuzp",
    "score": 917,
    "author": "Designguru01",
    "created_utc": 1735413241.0,
    "num_comments": 114,
    "subreddit": "FigmaDesign",
    "comments": "\n  └─ And stripped away a lot of money making features.\n\nGreat visual exercise though.\n     Score: 299 | Author: SleepingCod\n\n      └─ I know lol 😂, I get annoyed with their premium ad\n         Score: 61 | Author: Designguru01\n\n          └─ The real puzzle is to make sales feel delightful. Don’t strip them, make them work. Your client wouldn’t allow to remove the ads.\n             Score: 94 | Author: korkkis\n\n              └─ Exactly why product design doesn’t focus on just UI and redesigns like this aren’t applicable. \n\nProduct needs to make money, but we can still reach a middle ground and make it a great experience, while still meeting business needs. At the end of the day, users aren’t the ones signing your paycheck.\n                 Score: 46 | Author: alloyednotemployed\n\n          └─ If you just disregard the needs of the business, then this isn’t really a design project, it’s an art project.\n             Score: 62 | Author: thegooseass\n\n              └─ This can be turned into a good quote\n\nif it looks beautiful but isn't useful it's art\nif it looks beautiful and useful, it's design\n                 Score: 17 | Author: indianladka\n\n          └─ In your design you should make provision for those ads. Then it be complete work..\n             Score: 3 | Author: dashing-night\n\n  └─ feels like u removed most of the content and function and gave basic functions too much space.\n     Score: 69 | Author: swordytv\n\n  └─ I think you stripped away too much of the identity and the result lacks some contrast. Try preserving what makes LinkedIn distinguishable at first glance. Users will appreciate familiarity.\n     Score: 96 | Author: Raph-123\n\n      └─ And stakeholders will appreciate not removing profit-driving features.\n         Score: 29 | Author: EchidnaMore1839"
  },
  {
    "post_id": "1ha2rwv",
    "post_content": "Just finished 430 pages of UI design Project\nCooked up a 430+ page UI/UX project for a client this past month:\n\n- Includes a responsive website, dashboard & mobile app\n- The largest project I’ve worked on so far\nTook time, effort, & focus\n- Can’t share everything yet, but here’s a sneak peek\n\nMore details coming soon!",
    "post_url": "https://i.redd.it/5kye7wpxer5e1.jpeg",
    "score": 864,
    "author": "Designguru01",
    "created_utc": 1733722441.0,
    "num_comments": 130,
    "subreddit": "FigmaDesign",
    "comments": "\n  └─ This is awesome work! Congrats! How long did it take you to complete this?\n     Score: 46 | Author: D3nny01\n\n      └─ Thanx  it took me about  a month\n         Score: 29 | Author: Designguru01\n\n          └─ Good stuff, really like it! If you were to charge your client for this design, how much money would you want for your service?\n             Score: 7 | Author: danielo199854\n\n              └─ This is a very very broad project (i just shared some of it), like a full package user flow, design and prototype. i charged $25 per page, around $11,000\n                 Score: 26 | Author: Designguru01\n\n          └─ 430 screens / \\~20 labor days = 21.5 screens per day. That's insane.\n\nI image that probably most of the screens were a simpler version or similar to other screens. But I can imagine a project where the clientes needs 430 individual screens in a month.\n             Score: 4 | Author: brianmoyano\n\n      └─ *This is awesome work!*\n\n*Congrats! How long did it take*\n\n*You to complete this?*\n\n\\- D3nny01\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")\n         Score: 5 | Author: haikusbot\n\n  └─ CAP - You did not design 4 screens an hour. Any decent designer knows how much work and thought it takes to design just one page, and that 400+ screens for a project of this type is not even closely needed.\n\nI doubt you designed even a pixel of the showm work, probably stolen. I’m calling you out, because I saw your other post in a different subbreddit, where you mentioned 4000+ screens (xD). Moreover, the comments were all similar to those under this post. Therefore, this post is a bunch of crap and full of botted comments.\n\nI do not know what you seek to achieve by posting this, but gladly reported.\n     Score: 21 | Author: faulty_processor\n\n      └─ Let’s assume this person did though. Humor me…\n\nIf you replace the vibrant illustrations with grey boxes a lot of questionable patterns and architecture issues are easier to spot. Like what’s the progress bar signaling in the hero section? Why is there no blue in the mobile version of that bar/divider/whatever it is? Or is that supposed to be a carousel indicator? Who knows…\n\nThe second section’s header has mixed content case styling and the hierarchy puts the CTA above content you’d ideally want people to see before taking action. Even if the bounding boxes are drawn right, the hierarchy makes the relationship between the content more difficult to understand if someone is using assistive technology to navigate the screen (accessibility issue). Then you have product cards of mixed height and weird white space created by all the card shapes. Anyone that has worked in tech can tell you every pixel of screen real estate is valuable and has stiff competition from jockeying PMs.\n\nThat and the data viz screen in the middle throws everything and the kitchen sink at us visually but what’s the POV on the one most beneficial to a person or business? Time is money. \n\nAt the end, these designs make a lot of assumptions, and don’t take into account many fundamental UX and design best practices.\n\nThey’re visually stimulating at a glance, but don’t go deeper than UI or articulate a clear product vision. And if you’re not worried about any of the UX, product, business case, content, or strategy, it’s not that hard to slap random boxes on a frame in Figma and drop in a colorful photo.\n         Score: 7 | Author: Jojobeezus\n\n          └─ Adopt me and teach me UI/UX 🙏\n             Score: 2 | Author: Objective_Writing_25\n\n      └─ The dashboards are taken from a free figma community file. If you zoom in a little, it's clear this is not a real project. What is this company offering exactly? Why is it an e-commerce with a dashboard that looks like an airplane's cockpit?\n         Score: 4 | Author: sca34\n\n      └─ Yea this is absolute horseshit. I’m not saying 430 page projects don’t exist, but it seems extremely excessive for (just) a website, app and a ‘dashboard’. And even if it somehow was true, all of that in a month and for 11k coupled with the nonsensical design choices tells me it’s copied work at best, if not a complete work of fiction\n         Score: 2 | Author: UndeadPolarbear\n\n          └─ Could have not said it better.\n             Score: 1 | Author: faulty_processor\n\n  └─ Dang, that’s an incredible amount of work for a month. Looks really polished too, congrats!\n     Score: 11 | Author: JusticeHao\n\n      └─ Yeah, it took a lot of effort, really appreciated\n         Score: 2 | Author: Designguru01"
  },
  {
    "post_id": "1h9w4i8",
    "post_content": "Currently obsessed with the \"tactility\" effect\n",
    "post_url": "https://i.redd.it/l75e6pjbnp5e1.jpeg",
    "score": 407,
    "author": "Specialist_Wrap5718",
    "created_utc": 1733701069.0,
    "num_comments": 85,
    "subreddit": "FigmaDesign",
    "comments": "\n  └─ 2013 has returned!\n     Score: 166 | Author: No_Presentation1242\n\n      └─ It’s all a cycle. Takes me back to 2008 also when doing this in photoshop and slicing it up… good times.\n         Score: 52 | Author: DunkingTea\n\n          └─ I used to hire psd2html for that lol.\n             Score: 16 | Author: Prize_Literature_892\n\n              └─ I used to slice it in photoshop, and export to dreamweaver… then link and add hover effects etc.\n\nOr recreate in macromedia Flash. Good times\n                 Score: 11 | Author: DunkingTea\n\n      └─ I'm having nightmares of 1px vertical or horizontal slices for repeating edge backgrounds in an html table.\n         Score: 15 | Author: snds117\n\n      └─ Good. Flat is boring AF\n         Score: 9 | Author: savageotter\n\n  └─ Time to dust off my old friends Bevel and Emboss.\n     Score: 75 | Author: dimonqui\n\n      └─ 🤣\n         Score: 5 | Author: Jessievp\n\n      └─ yes that psd. effect is stupid and never used. but to be fair, if you know how to use it, when to use it, and have it not be so 'drastic', but subtle, it's ok to use it. I never use it but have seen it used in ways not the cheesy way we usually have seen it used.\n         Score: 2 | Author: KJ_dunk_over_hakeem\n\n  └─ A dozen of comments and only one mentions the absolutely horrible corner radii alignment. \n\nWhile we are nitpicking the nuances, I would also suggest making top and side paddings equal.\n     Score: 30 | Author: seeaitchbee\n\n      └─ Thanks for the feedback! For the corner radii, are you talking about the inner element vs the whole card  radii? How can I improve it?\n         Score: 2 | Author: Specialist_Wrap5718\n\n          └─ Here's an [updated version of yours with corner-radii stacking](https://image.non.io/8bb376b4-da60-4900-8b56-574ad6578b12.webp)\n             Score: 8 | Author: pwnies\n\n              └─ thanks, I fixed my radii\n                 Score: 1 | Author: Specialist_Wrap5718\n\n          └─ [This article](https://cloudfour.com/thinks/the-math-behind-nesting-rounded-corners/) should help.\n             Score: 6 | Author: seeaitchbee\n\n              └─ thanks, really helpful\n                 Score: 1 | Author: Specialist_Wrap5718\n\n          └─ The radii should tighten on the inside corners. \n\nPicture a donut. The radius of the inside ‘hole’ is naturally smaller than the radius of the whole donut. \n\nThe same principle applies when nesting boxes with rounded corners.\n             Score: 1 | Author: used-to-have-a-name\n\n      └─ Thank you. ;)\n\nEDIT: This feed gives me strong bot vibes\n         Score: -1 | Author: tbimyr"
  },
  {
    "post_id": "1hghsk4",
    "post_content": "I need help.\nHey everyone! I'm a junior-level UX/UI designer, and I'm working on my portfolio so I can start applying for jobs.  \nI've been studying for a little over a year, taking a few courses, and finishing a BootCamp, but today, when talking about my portfolio with a superior, I heard that recruiters do not consider fake projects.  \nI have a few projects (case studies) that I designed and researched by myself that I really liked. I was planning on using them in the portfolio, both research and design, but I don't really know what to do.  \n(I used chat GPT to simulate people so I could do the user interviews).  \nIf someone could give me any feedback or any help at all about this subject I'd be very grateful!",
    "post_url": "https://www.reddit.com/r/UX_Design/comments/1hghsk4/i_need_help/",
    "score": 18,
    "author": "None",
    "created_utc": 1734461548.0,
    "num_comments": 12,
    "subreddit": "UX_Design",
    "comments": "\n  └─ They do consider fake projects, don't worry. Document your decisions and lay it out. I also was rejected from a hundred places before I was able to land a role at a design agency, but every rejection taught me:). Don't worry, you gotta start somewhere, and someone who understands that will love to have you.\n     Score: 9 | Author: runsonchai\n\n      └─ Thank you so much for the advice! I'll keep structuring the researches and I'll do my best to make a nice portfolio.\n         Score: 1 | Author: None\n\n  └─ Hey! I also think that good case studies, even if \"fake\", can catch the attention of recruiters. If the  process is well documented and you are able to show the skills they are looking for, it's not a big deal if the project comes from a real company or not.   \nFeel free to share your project if you would like any feedback!\n     Score: 2 | Author: simonedez\n\n      └─ Thank you very much! I'll keep working on the research, and thank you for offering your help!\n         Score: 1 | Author: None\n\n  └─ As someone at junior level, this is exactly what you should have in your folio! Most juniors portfolios will all look the same with the same style boot camp case studies…but yours will stand out and show your passion as you’ve put extra time into your own projects - it’s what I’ve always heard recruiters say on panels when asked what juniors can do to stand out\n     Score: 2 | Author: bbyriox\n\n      └─ Thank you very much! I'm way more relieved now. Thank you for taking your time, and thank you for the incentive!\n         Score: 2 | Author: None"
  },
  {
    "post_id": "1hs5x9l",
    "post_content": "data analyst or UX designer\n\"I have a bachelor's degree in Fine Arts, and I worked as a painter for a while. However, I became exhausted by the instability and constant financial struggles. I decided to transition my career, but I’m unsure whether to choose UX design or data analytics. My main goal is to achieve stability and a good salary. I’m also concerned that my lack of a STEM degree might affect my ability to succeed in data analytics. Please help me.\"\n",
    "post_url": "https://www.reddit.com/r/UX_Design/comments/1hs5x9l/data_analyst_or_ux_designer/",
    "score": 14,
    "author": "ConstructionOver5363",
    "created_utc": 1735855604.0,
    "num_comments": 5,
    "subreddit": "UX_Design",
    "comments": "\n  └─ Oops both of them are very tough rn😬\nDo you have other options besides those choices?\n\nAnd yes for your last worry that if you choose data, you need to fight those STEM students who have degrees + internships, and the same goes for UX. But sth can be positive, if you are going to pursue more into UI, your fine art experience can be the strength in some cases.\n     Score: 5 | Author: Limeholy_\n\n      └─ I would really appreciate if you have any recommendations! I am very much lost and overwhelmed! \n         Score: 1 | Author: ConstructionOver5363\n\n  └─ My company has 30+ designers and 1 Data Science person. I'm guessing the market for data science is worse than design.\n     Score: 4 | Author: Infinite-One-5011\n\n      └─ may I ask .. what type of company do you work in ?\n         Score: 1 | Author: ConstructionOver5363\n\n  └─ My perception may be different from others - straight UX roles seem to be hard to come by, as it is more and more mixed in with UI. In my career it's been way harder to recruit really good data analysts. There are a lot of people who are good at numbers , but what most companies need from a data analyst is someone who can use data to address business issues, and explain the findings to business people who don't understand data. If you can be great at that, and it might take time, I think you'll make the most in the long run.\n     Score: 2 | Author: SameCartographer2075"
  },
  {
    "post_id": "1hab6v7",
    "post_content": "How would you learn if you were to begin your ux career today?\nI did Google's UX course and was even able to land a job with it. I had to quit my job due to health issues and now 3 years later, I feel I'm so out of touch with the field. Are Interaction Design Foundation courses worthy or any other bootcamps or even free courses!?? I am too confused rn.",
    "post_url": "https://www.reddit.com/r/UX_Design/comments/1hab6v7/how_would_you_learn_if_you_were_to_begin_your_ux/",
    "score": 11,
    "author": "runsonchai",
    "created_utc": 1733755262.0,
    "num_comments": 27,
    "subreddit": "UX_Design",
    "comments": "\n  └─ I have gained more skills trying to build my own projects than anything I have found online. My recommendation is try to build a product using no-code like Bubble.io then use that project as a case study. People are always impressed when I present a product Iv built and grown on my own.\n     Score: 8 | Author: design-feedback\n\n  └─ UX is so much about perception and understanding of a system which visual design excels at. People say it is about making something pretty but that is incorrect. It is about making something easy to understand, demonstrating hierarchy, allowing the most useful elements to stand out and creating harmony which all makes something engaging while improving the user experience. \n\nI did a four year design degree and picked up UX later on once in the web design field. Visual Design theory and skills have helped me immensely in every aspect especially in my current role as Principal Advisor UX for a government agency. I am the go to for all UX and brand/visual design which has helped me get in front of the CFO, CEO and others. It helps get you maximum visibility across an organisation (depending on the organisation). It also gets me all sorts of outside work gigs which gets you noticed by all sorts of people.\n     Score: 3 | Author: Johnny_Africa\n\n      └─ Agreed, a lot of design theoretical knowledge will translate. I also came from a 4 yr degree in Illustration and then learned from others and reading a ton of books. \n\nThe key is it has to be a good 4 yr program. There are good and bad versions of that too but your chances are higher than boot camps and short-form stuff. Heck even reading a ton of books from reputable publishers will get more mileage. \n\nIt just takes a long time and having a rushed mindset or wanting shortcuts will be very limiting.\n         Score: 2 | Author: taadang\n\n      └─ So how did you really learn the ins-and-outs of UX? Did you degree help you with it?\n         Score: 1 | Author: runsonchai\n\n          └─ Great question. UX is so broad and not many if any are highly skilled in all areas. I learnt skills such as IA, usability testing, wireframing from working with UX designers who excelled at this. I learnt research skills such as interviews and user shadows by doing. I’ve learnt workshop and presentation skills by doing as well.\nHope that helps.\n             Score: 1 | Author: Johnny_Africa\n\n              └─ Yes, thank you!\n                 Score: 1 | Author: runsonchai\n\n  └─ I have a design degree that I went back to school for, after coming from healthcare.\n\nIf I were to do it again I'd get a design degree. It was worth every penny I paid\n     Score: 3 | Author: kimchi_paradise\n\n      └─ Thank you, I'm planning a degree as well. I am just debating whether the student loan is worth it.\n         Score: 1 | Author: runsonchai\n\n          └─ Worth it imo! For the boot camps you can't take student loans, and that was a barrier for me.\n             Score: 1 | Author: kimchi_paradise\n\n      └─ Hey, what degree did you do in design school? Sorry I'm just clueless about this, I transitioned from a Life sciences background.\n         Score: 1 | Author: airen008\n\n          └─ Human factors! Human Computer Interaction is also a good one\n             Score: 0 | Author: kimchi_paradise\n\n      └─ [deleted]\n         Score: 1 | Author: None\n\n          └─ Masters degree, if they have research or thesis programs or leaders involved in such the better! \n\nI was part time and it took me 2.5 years to finish! I think in my program you could finish in 18 months full time.\n             Score: 1 | Author: kimchi_paradise\n\n              └─ [deleted]\n                 Score: 1 | Author: None"
  }
]